[
    {
        "id": "andor",
        "name": "À la recherche d'Andor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Mon père Mikhail m'a dit qu'Andor n'était pas revenu à la maison depuis hier. Je dois aller le rechercher dans le village.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Leonid dit qu'il a vu Andor parler avec Gruil. Je dois aller demander ce qu'il sait à Gruil.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Gruil veut que je lui rapporte une glande à venin. Après, il pourrait m'en dire un peu plus. Il m'a dit que certains serpents venimeux avaient de telles glandes.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Gruil dit qu'Andor recherchait quelqu'un du nom de Umar. Je dois interroger son ami Gaela à Fallhaven à l'Est.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "J'ai discuté avec Gaela à Fallhaven. Il me conseille d'aller voir Bucus et de lui demander des informations à propos de la guilde des voleurs.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Bucus m'a autorisé à passer par la trappe dans la maison en ruines de Fallhaven. Il faut que je parle à Umar.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Umar de la guilde des voleurs de Fallhaven a cru me reconnaître, mais il a dû me confondre avec Andor. Apparemment, Andor l'a déjà rencontré.",
                "finishesQuest": 0
            },
            {
                "progress": 55,
                "logText": "Umar dit qu'Andor est allé voir un concocteur de potions dénommé Lodar. Je dois rechercher sa retraite.",
                "finishesQuest": 0
            },
            {
                "progress": 61,
                "logText": "I heard a story in Loneford, where it seemed like Andor had been in Loneford, and that he might have had something to do with the illness that the people are suffering from there. I am not sure if it actually was Andor. If it was Andor, why would he have made the people of Loneford ill?",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_bread",
        "name": "Pain du petit déjeuner",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "J'ai rapporté du pain à Mikhail.",
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail veut que j'aille lui acheter du pain chez Mara à la halle du village.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_rats",
        "name": "Les rats !",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "J'ai tué les deux rats de notre jardin.",
                "rewardExperience": 20,
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail me demande de voir s'il n'y aurait pas des rats dans le jardin. Je dois tuer les rats de notre jardin et revenir voir Mikhail. Si je suis blessé, je peux revenir et me reposer dans le lit pour reprendre mes forces.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "leta",
        "name": "Époux manquant",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leta du village de Crossglen veut que je recherche son époux Oromir.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "J'ai retrouvé Oromir dans le village de Crossglen, se cachant de son épouse Leta.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "J'ai dit à Leta qu'Oromir se cachait dans le village de Crossglen.",
                "rewardExperience": 50,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "odair",
        "name": "Invasion de rats",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Odair veut que je purge la réserve du village de Crossglen des rats qui l'ont envahie. Je dois en particulier tuer le gros rat et revenir voir Odair.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "J'ai aidé Odair à se débarasser des rats qui avaient envahi la réserve du village de Crossglen.",
                "rewardExperience": 300,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bonemeal",
        "name": "Produit interdit",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leonid dans la halle de Crossglen m' dit qu'il y avait eu des désordres dans le village il y a quelques semaines. Apparemment, le seigneur Geomyr a banni toute utilisation des potions d'os comme soin.\n\nTharal, le prêtre du village devrait en savoir plus.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Tharal ne veut pas parler des potions d'os. Je pourrais peut-être le persuader si je lui ramène 5 ailes d'insectes.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Tharal m'a dit que la potion d'os était un médicament très efficace, et il est embêté qu'elle soit désormais interdite. Je devrais aller voir Thoronir à Fallhaven si je désire en apprendre davantage. Je dois lui dire le mot de passe « lueur de l'Ombre ».",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "J'ai parlé à Thoronir à Fallhaven. Il pourrait être capable de me concocter une potion d'os si je lui ramenais 5 os de squelettes. Il doit y avoir quelques squelettes dans une maison abandonnée au nord de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "J'ai ramené les os à Thoronir. Désormais, il peut me fournir en potions d'os.\nJe dois cependant être prudent en les utilisant, car le seigneur Geomyr a interdit leur consommation.",
                "rewardExperience": 900,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jan",
        "name": "Ami tombé",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jan m'a raconté son histoire, au cours de laquelle lui et ses deux amis Gandir et Irogotu sont descendus dans ce gouffre pour creuser à la recherche d'un trésor caché, puis se sont battus, Irogotu tuant Gandir dans sa fureur.\nJe dois récupérer l'anneau de Gandir's auprès d'Irogotu, et revenir voir Jan lorsque je l'aurais.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Irogotu est mort. J'ai ramené l'anneau de Gandir à Jan, et vengé son ami.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bucus",
        "name": "La clef de Luthor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bucus à Fallhaven sait peut-être quelque chose à propos d'Andor. Il veut que je lui ramène la clef de Luthor des catacombes sous l'église de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Les catacombes sous l'église sont fermées. Athamyr est la seule personne ayant le droit et le courage d'y entrer. Je dois aller le trouver dans sa maison au Sud-Ouest de l'église.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Athamyr veut que je lui ramène de la viande préparée, il pourra alors m'en dire plus.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "J'ai ramené de la viande préparée à Athamyr.",
                "rewardExperience": 700,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Athamyr m'a donné la permission d'entrer dans les catacombes sous l'église de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "J'ai apporté la clef de Luthor à Bucus.",
                "rewardExperience": 2150,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "fallhavendrunk",
        "name": "Histoire d'ivrogne",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un ivrogne à l'extérieur de la taverne de Fallhaven à commencé à me raconter son histoire, mais il voudrait que je lui ramène de l'hydromel. Je ne sais cependant pas si cette histoire va me conduire quelque part.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "L'ivrogne m'a dit qu'il avait l'habiture de voyager avec Unnmir. Je dois parler à Unnmir.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "calomyran",
        "name": "Les secrets de Calomyran",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un vieil homme dans les rues de Fallhaven a perdu son livre « les secrets de Calomyran ». Je devrais partir à sa recherche. Peut-être dans la maison d'Arcir vers le Sud ?",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "J'ai trouvé une page déchirée d'un livre intitulé « les secrets de Calomyran » sur laquelle était inscrit le nom « Larcal ».",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "J'ai rendu son livre au vieil homme.",
                "rewardExperience": 600,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "nocmar",
        "name": "Trésors perdus",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Unnmir m'a dit qu'il était un ancien aventurier, et m'a laissé sous-entendre que je devrais voir Nocmar. Sa maison est juste au Sud-Ouest de la taverne de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Nocmar m'a dit qu'il était un ancien forgeron. Mais le seigneur Geomyr a interdit l'utilisation de l'acier-cœur, et il ne peut plus forger ses armes.\nSi je pouvais trouver une pierre-cœur et la ramener à Nocmar, il pourrait à nouveau forger de l'acier-cœur.",
                "finishesQuest": 0
            },
            {
                "progress": 200,
                "logText": "J'ai ramené une pierre-cœur à Nocmar. Il devrait disposer d'articles en acier-cœur désormais.",
                "rewardExperience": 1200,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "flagstone",
        "name": "Ancients secrets",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "J'ai rencontré un garde en faction à l'extérieur d'une forteresse appelée Flagstone. Le garde m'a dit que Flagstone était un acien camp de prisonniers pour les travailleurs fugitifs du Mont Galmore. Il y a eu récemment une augmentation du nombre de monstres morts-vivants déferlant de Flagstone. Je devrais aller rechercher l'origine des ces monstres mort-vivants. Le garde m'a dit de revenir le voir si j'avais besoin d'aide.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "J'ai trouvé un tunnel creusé sous Flagstone, qui a l'air de mener à une caverne plus importante. La caverne est gardée par un démon dont je ne suis même pas capable de m'approcher. Peut-être le garde en faction devant Flagstone en sait-il plus ?",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Le garde m'a dit que l'ancien gardien portait toujours un collier. Le collier avait probablement l'incantation nécessaire pour approcher le démon. Je devrais revenir demander au garde de m'aider à déchiffrer tout message que je pourrais trouver sur le collier une fois que je l'aurais récupéré.",
                "finishesQuest": 0
            },
            {
                "progress": 31,
                "logText": "J'ai trouvé l'ancien gardien de Flagstone à l'étage supérieur. Je dois retourner voir le garde désormais.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "J'ai appris l'incantation requise pour pouvoir approcher le démon dans les souterrains de Flagstone. « Ombre du jour ».",
                "rewardExperience": 1600,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Dans les profondeurs sous Flagstone, j'ai trouvé l'origine de l'invasion des morts-vivants. Une créature née des griefs des anciens prisonniers de Flagstone.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "J'ai trouvé un prisonnier, Narael, encore en vie sous Flagstone. Narael est un ancien citoyen de la ville de Nor. Il est trop faible pour marcher seul, mais si je peux trouver son épouse à la ville de Nor, je recevrais une généreuse récompense.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "vacor",
        "name": "Articles manquants",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un mage dénommé Vacor, au Sud-Ouest de Fallhaven a essayé de lancer un sort de scission.\nIl semblait troublé et était particulièrement obsédé par son sort. Quelque chose concernant un grand pouvoir qu'il pourrait en tirer.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Vacor veut que je lui ramène les quatre articles de son sort de scission dont il affirme qu'ils lui ont été dérobés. Les quatre bandits doivent être quelque part au Sud de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "J'ai ramené les quatre articles du sort de scission à Vacor.",
                "rewardExperience": 1200,
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Vacor m'a parlé de son ancien apprenti Unzel, qui commençait à douter de lui. Vacor veut désormais que je tue Unzel. Je devrais être capable de le trouver au Sud-Ouest de Fallhaven. Je doit ramener sa chevalière à Vacor une fois que je l'aurais tué.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Unzel me donne le choix de m'allier à Vacor ou à lui-même.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "J'ai choisi de m'allier avec Unzel. Je dois aller au Sud-Ouest de Fallhaven pour parler à Vacor d'Unzel et de l'Ombre.",
                "finishesQuest": 0
            },
            {
                "progress": 53,
                "logText": "J'ai commencé à combattre Unzel. Je dois ramener sa chevalière à Vacor une fois qu'il sera mort.",
                "finishesQuest": 0
            },
            {
                "progress": 54,
                "logText": "J'ai commencé à combattre Vacor. Je dois ramener son anneau à Unzel une fois qu'il sera mort.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "J'ai tué Unzel et rapporté mon acte à Vacor.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            },
            {
                "progress": 61,
                "logText": "J'ai tué Vacor et rapporté mon acte à Unzel.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            }
        ]
    }
]
