[
    {
        "id": "bwm_agent",
        "name": "L'agent et la bête",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "J'ai rencontré un homme recherchant de l'aide pour sa colonie, le « Mont Blackwater ». Il semblerait que la colonie soit attaquée par des monstres et des bandits, et ils ont besoin d'une aide exérieure."
            },
            {
                "progress": 5,
                "logText": "J'ai accepté d'aider l'homme et la colonie du Mont Blackwater à résoudre son problème."
            },
            {
                "progress": 10,
                "logText": "L'homme m'a demandé de le retrouver de l'autre côté de la mine effondrée. Il va passer en rampant à travers les éboulis pendant que je descendrai dans la nuit noire du puits de la mine abandonnée."
            },
            {
                "progress": 20,
                "logText": "J'ai parcouru l'obscurité de la mine abandonnée et retrouvé l'homme de l'autre côté. Il insistait pour me convaincre de me diriger plein Est une fois que je serais sorti de la mine. Je dois retrouver cet homme au pied de la montagne à l'Est."
            },
            {
                "progress": 25,
                "logText": "J'ai entendu une histoire au sujet des habitants de Prim et de la colonie du Mont Blackwater se combattant les uns les autres."
            },
            {
                "progress": 30,
                "logText": "Je dois suivre le chemin qui monte dans la montagne vers la colonie de Blackwater."
            },
            {
                "progress": 40,
                "logText": "J'ai retrouvé l'homme en gravissant le Mont Blackwater. Je dois continuer mon ascension."
            },
            {
                "progress": 50,
                "logText": "Je suis arrivé aux pentes enneigées du Mont Blackwater. L'homme m'a dit de continuer à grimper dans la montagne. Apparemment, la colonie du Mont Blackwater est proche."
            },
            {
                "progress": 60,
                "logText": "Je suis arrivé à la colonie du Mont Blackwater. Je dois trouver le chef de guerre Harlenn."
            },
            {
                "progress": 65,
                "logText": "J'ai discuté avec Harlenn dans la colonie du Mont Blackwater. Apparemment, la colonie est soumise à des attaques par de nombreux monstres, les Aulaeth et des wyrms blanches. Pour couronner le tout, ils sont aussi attaqués par les gens de Prim."
            },
            {
                "progress": 66,
                "logText": "Harlenn pense que les gens de Prim sont d'une manière ou d'une autre derrière les attaques de monstres."
            },
            {
                "progress": 70,
                "logText": "Harlenn veut que je transmette un message à Guthbered de Prim. Les gens de Prim doivent cesser leurs attaques contre la colonie du Mont Blackwater, ou alors ils en supporteront les conséquences. Je dois aller parler à Guthbered à Prim."
            },
            {
                "progress": 80,
                "logText": "Guthbered dément le fait que les gens de Prim aient la moindre responsabilité dans les attaques de monstres contre la colonie du Mont Blackwater. Je dois aller parler à Harlenn"
            },
            {
                "progress": 90,
                "logText": "Harlenn est certain que les gens de Prim sont mêlés à ces attaques."
            },
            {
                "progress": 95,
                "logText": "Harlenn veut que j'aille à Prim et que j'y recherche des preuves qu'ils se préparent à attaquer la colonie. Je dois rechercher des indices à proximité de l'endroit où Guthbered se tient."
            },
            {
                "progress": 100,
                "logText": "J'ai trouvé des plans à Prim pour recruter des mercenaires et attaquer la colonie du Mont Blackwater. Je dois aller en parler à Harlenn immédiatement."
            },
            {
                "progress": 110,
                "logText": "Harlenn m'a remercié d'avoir enquêté sur ces plans d'attaque.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Afin de faire cesser les attaques contre la colonie du Mont Blackwater, Harlenn veut que j'assassine Guthbered à Prim."
            },
            {
                "progress": 130,
                "logText": "J'ai commencé à me battre avec Guthbered."
            },
            {
                "progress": 131,
                "logText": "J'ai dit à Guthbered que j'avais été envoyé pour le tuer, mais l'ai laissé vivre. Il m'a remercié avec profusion et a quitté Prim.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "I have told Harlenn that Guthbered is gone."
            },
            {
                "progress": 150,
                "logText": "Harlenn m'a remercié pour l'aide que je lui ai fournie. Désormais, les attaques contre la colonie du Mont Blackwater devraient cesser.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "J'ai maintenant gagné la confiance de la colonie du Mont Blackwater, et devrais avoir accès à tous les services.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "J'ai décidé de ne pas aider les gens de la colonie du Mont Blackwater.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Comme j'aide Prim, Harlenn ne veut plus me parler.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Bien reposé",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "J'ai discuté avec le cuisinier de Prim, au pied du Mont Blackwater. Il y a une chambre à louer, mais elle est déjà louée par Arghest. Je dois aller parler à Arghest pour voir s'il a toujours besoin de louer cette chambre. Le cuisinier m'a indiqué une direction au Sud-Ouest de Prim."
            },
            {
                "progress": 20,
                "logText": "J'ai parlé avec Arghest au sujet de la chambre dans l'auberge. Il souhaite toujours pouvoir en disposer pour s'y reposer. Il m'a cependant déclaré que je pourrais le persuader de me laisser l'utiliser si je lui offrais une compensation suffisante."
            },
            {
                "progress": 30,
                "logText": "Arghest veut que je lui rapporte 5 bouteilles de lait. Je devrais pouvoir trouver un peu de lait dans un des plus gros villages."
            },
            {
                "progress": 40,
                "logText": "J'ai rapporté du lait à Arghest. Il est d'accord pour me laisser utiliser la chambre de l'auberge de Prim. Je devrais pouvoir m'y reposer désormais. Je dois aller le dire au cuisinier de l'auberge.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "J'ai expliqué au cuisinier que j'avais la permission d'Arghest d'utiliser la chambre.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Intentions brumeuses",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Juste à l'extérieur de la mine effondrée sur le chemin du Mont blackwater, j'ai rencontré un homme du village de Prim. Il m'a supplié de les aider."
            },
            {
                "progress": 11,
                "logText": "Le village de Prim a besoin d'une aide extérieure pour se défendre contre des attaques de monstres. Je devrais aller parler avec Guthbered à Prim si je désire les aider."
            },
            {
                "progress": 15,
                "logText": "On peut trouver Guthbered dans la grande halle de Prim. Je dois rechercher une maison en pierres au centre du village."
            },
            {
                "progress": 20,
                "logText": "J'ai parlé avec Guthbered au sujet de l'histoire de Prim. Prim est depuis quelques temps soumis à des attaques permanentes de la colonie du Mont Blackwater."
            },
            {
                "progress": 25,
                "logText": "Guthbered veut que je monte jusqu'à la colonie et que je demande à leur chef de guerre Harlenn pourquoi (ou si) ils ont invoqué les monstres de Gornaud contre Prim."
            },
            {
                "progress": 30,
                "logText": "J'ai parlé avec Harlenn des attaques contre Prim. Il dément le fait que les gens de la colonie du Mont Blackwater aient quoi que ce soit à voir avec ces attaques. Je dois retourner parler avec Guthbered à Prim."
            },
            {
                "progress": 40,
                "logText": "Guthbered continue de croire que les gens de la colonie de Blackwater sont mêlés à ces attaques."
            },
            {
                "progress": 50,
                "logText": "Guthbered veut que je recherche des preuves que les gens de la colonie du Mont Blackwater se préparent à lancer une attaque d'envergure contre Prim. Je dois aller rechercher des indices près des quartiers privés d'Harlenn, mais doit prendre garde ne me pas me faire voir."
            },
            {
                "progress": 60,
                "logText": "J'ai trouvé des papiers du côté des quartiers privés d'Harlenn brossant un plan d'attaque contre Prim. Je dois aller en parler à Guthbered immédiatement."
            },
            {
                "progress": 70,
                "logText": "Guthbered m'a remercié de l'avoir aidé à trouver des preuves du plan d'attaque.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "Afin de faire cesser les attaques contre Prim, Guthbered veut que j'aille tuer Harlenn en haut dans la colonie du Mont Blackwater."
            },
            {
                "progress": 90,
                "logText": "J'ai commencé à me battre avec Harlenn."
            },
            {
                "progress": 91,
                "logText": "J'ai dit à Harlenn que j'avais été envoyé pour le tuer, mais l'ai laissé vivre. Il m'a remercié avec profusion et a quitté la colonie.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "I have told Guthbered that Harlenn is gone."
            },
            {
                "progress": 100,
                "logText": "Guthbered m'a remercié pour l'aide que je lui ai fournie. Désormais, les attaques contre Prim devraient cesser. En remerciement, Guthbered m'a donné quelques objets et un laisser-passer falsifié afin que je puisse entrer dans les quartiers confidentiels de la colonie du Mont Blackwater.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "J'ai montré le laisser-passer falsifié au garde et ai pu entrer dans les quartiers confidentiels."
            },
            {
                "progress": 240,
                "logText": "J'ai maintenant gagné la confiance de Prim, et devrais avoir accès à tous les services.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "J'ai décidé de ne pas aider les gens de Prim.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Comme j'aide la colonie du Mont Blackwater, Guthbered ne veut plus me parler.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Lumières dans le noir",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "J'ai trouvé mon chemin dans les quartiers confidentiels de la colonie du Mont Blackwater et découvert un groupe de mages dirigés par un homme dénommé Throdna."
            },
            {
                "progress": 9,
                "logText": "Throdna semblait très intéressé par quelqu'un (ou quelque chose) appelé Kazaul, et en particulier par un rituel célébré en son nom."
            },
            {
                "progress": 10,
                "logText": "J'ai accepté d'aider Throdna à en savoir plus au sujet du rituel proprement dit, en recherchant les pièces qui semblent avoir été dispersées à travers la montagne. Je dois rechercher les éléments du rituel de Kazaul sur le chemin en descendant du Mont Blackwater vers Prim."
            },
            {
                "progress": 11,
                "logText": "Je dois trouver les deux couplets du chant et les trois stances décrivant le rituel proprement dit, et revenir voir Throdna lorsque j'aurais tout trouvé."
            },
            {
                "progress": 21,
                "logText": "J'ai trouvé le premier couplet du chant du rituel de Kazaul."
            },
            {
                "progress": 22,
                "logText": "J'ai trouvé le second couplet du chant du rituel de Kazaul."
            },
            {
                "progress": 25,
                "logText": "J'ai trouvé la première stance du rituel de Kazaul."
            },
            {
                "progress": 26,
                "logText": "J'ai trouvé la seconde stance du rituel de Kazaul."
            },
            {
                "progress": 27,
                "logText": "J'ai trouvé la troisième stance du rituel de Kazaul."
            },
            {
                "progress": 30,
                "logText": "Throdna m'a remercié d'avoir trouvé tous les éléments du rituel.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna veut que je mette un terme aux réapparitions de l'engeance de Kazaul qui se produisent près du Mont Blackwater. Il y a un mausolée au pied de la montagne que je devrais inspecter."
            },
            {
                "progress": 41,
                "logText": "On m'a donné une fiole d'élixir purificateur que Throdna me demande de verser sur le mausolée de Kazaul. Je dois revenir voir Throdna lorsque j'aurais trouvé et purifié le mausolée."
            },
            {
                "progress": 50,
                "logText": "Au mausolée du pied du Mont Blackwater, j'ai rencontré le gardien de Kazaul. En récitant les couplets du chant du rituel, j'ai réussi à déclencher son attaque."
            },
            {
                "progress": 60,
                "logText": "J'ai purifié le mausolée de Kazaul.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "J'espérais quelque signe d'appréciation de Throdna pour l'avoir aidé à en apprendre plus sur le rituel et pour avoir purifié le mausolée. Mais il semblait plus occupé par ses divagations concernant Kazaul. Je n'ai rien compris à ses élucubrations.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Sans faiblesse",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Herec au second niveau de la colonie du Mont Blackwater fait des recherches au sujet des wyrms blanches à l'extérieur de la colonie. Il veut que je lui rapporte 5 griffes de wyrms blanches afin qu'il puisse continuer ses recherches. Apparemment, seules certaines des wyrms blanches ont ces griffes. Il va falloir que j'en tue un certain nombre pour m'en procurer."
            },
            {
                "progress": 20,
                "logText": "J'ai donné les 5 griffes de wyrms blanches à Herec."
            },
            {
                "progress": 30,
                "logText": "Herec a achevé la création d'une potion soulageant la fatigue qui sera très utile pour combattre les wyrms dans le futur.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Éveillés du repos",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur à Prim à la base du Mont Blackwater pense que quelque chose a dérangé la tombe de ses parents, au Sud-Ouest de Prim, juste à l'extérieur de la mine de Elm."
            },
            {
                "progress": 15,
                "logText": "Bjorgur veut que j'aille vérifier la tombe et que je m'assure que la dague de sa famille est toujours en sécurité dans la tombe."
            },
            {
                "progress": 20,
                "logText": "Fulus à Prim aimerait obtenir la dague de famille de Bjorgur que possédait le grand-père de Bjorgur."
            },
            {
                "progress": 30,
                "logText": "J'ai rencontré un homme qui portait une dague étrange au fond d'un caveau au Sud-Ouest de Prim. Il a du piller la tombe pour voler la dague."
            },
            {
                "progress": 40,
                "logText": "J'ai remis la dague à sa place dans la tombe. Étonnamment, les morts sans repos semblent plus apaisés désormais.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur m'a remercié pour mon aide. Il m'a dit que je devrais aussi aller trouver ses parents à Feygard.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "J'ai dit à Fulus que j'avais aidé Bjorgur à remettre la dague de sa famille à sa place d'origine."
            },
            {
                "progress": 60,
                "logText": "J'ai donné la dague de famille de Bjorgur à Fulus. Il m'a remercié de la lui avoir apportée, et m'a remercié avec largesse.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
