[
    {
        "id": "taevinn",
        "message": "Please, you must help us!",
        "replies": [
            {
                "text": "Do you know anything about the illness?",
                "nextPhraseID": "taevinn_1",
                "requires": [
                    {
                        "requireType": "questProgress",
                        "requireID": "loneford",
                        "value": "11"
                    }
                ]
            },
            {
                "text": "What's wrong?",
                "nextPhraseID": "loneford_farmer0_1"
            }
        ]
    },
    {
        "id": "taevinn_1",
        "message": "I'll tell you what I know. We try to follow the law around here. Without rules and laws, how would we be any different from the savages that roam the southern lands?",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_2"
            }
        ]
    },
    {
        "id": "taevinn_2",
        "message": "But even if we here in Loneford keep as peaceful as possible, there's always someone that has a desire to cause mischief.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_3"
            }
        ]
    },
    {
        "id": "taevinn_3",
        "message": "Have you seen him? That fool Sienn. Him and his 'pet' are always trying to cause some trouble. We can't have that around here in our friendly village. Especially not in times like these when we are trying to show our good side to those magnificent guards from Feygard that are here.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_4"
            }
        ]
    },
    {
        "id": "taevinn_4",
        "message": "Did you know I tried to talk to him on several occasions about his so called 'pet'? I couldn't really make out what he was trying to tell me, but that thing of his nearly tried to kill me, it did!",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_5"
            }
        ]
    },
    {
        "id": "taevinn_5",
        "message": "I tell you, there's mischief all around him and that thing he keeps around. I am sure they are up to something. They probably caused this illness somehow. Maybe we caught something contagious from that thing of his that he keeps around?",
        "rewards": [
            {
                "rewardType": "questProgress",
                "rewardID": "loneford",
                "value": 24
            }
        ],
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "loneford_ill_c_1"
            }
        ]
    }
]
