[
    {
        "id": "sign_wild3_grave",
        "message": "The cross reads: Rest in peace, my friend."
    },
    {
        "id": "sign_wild6_stump",
        "message": "You notice that the tree-stump is partially hollow, and looks like an excellent hiding place. It is empty now."
    },
    {
        "id": "sign_snakecave3_grave",
        "message": "The ground around the grave is full of small holes, probably by something that has slithered its way to its nest down there. The cross has some writing on it, but you cannot understand what it says."
    },
    {
        "id": "sign_fallhaven_ne_grave1",
        "message": "Here lies Kargir the merchant."
    },
    {
        "id": "sign_fallhaven_ne_grave2",
        "message": "(The stone is covered with a thin layer of green moss. The writing on the stone has eroded and is completely unreadable.)"
    },
    {
        "id": "sign_fallhaven_ne_grave3",
        "message": "Rest with the Shadow, one-legged Berth. She lived a full life, but in the end she could not stand up to the illness that befell her."
    },
    {
        "id": "sign_fallhaven_ne_grave4",
        "message": "The remains of Kigrim lies here, after he was killed by wolves south of Fallhaven."
    },
    {
        "id": "sign_fallhaven_ne_grave5",
        "message": "Gimlont the corpulent lies here. May we finally be free from his fat hands being part of all of our businesses."
    },
    {
        "id": "sign_fallhaven_ne_grave6",
        "message": "Here lies Terdar the smith. May he forever be embraced by the comfort of the Shadow."
    },
    {
        "id": "sign_fallhaven_ne_grave7",
        "message": "Here lies O'llath, praised by her fellow citizens of Fallhaven for her delicious cakes."
    },
    {
        "id": "sign_fallhaven_ne_grave8",
        "message": "Sidari the woodcutter lies here. We all told him to be careful with that axe of his, but he never listened."
    },
    {
        "id": "sign_fallhaven_ne_grave9",
        "message": "Tyngose the noble lies here. May her legacy never be forgotten."
    },
    {
        "id": "sign_catacombs1_grave1",
        "message": "Here lies the remains of Sir Eneryth's horse, Shadowsteed."
    },
    {
        "id": "sign_catacombs1_grave2",
        "message": "Here lies Sir Eneryth of house Gellir. Son of Sir Anarogas, and the elder brother of Sir Karthanir."
    },
    {
        "id": "sign_catacombs1_grave3",
        "message": "Here lies Sir Karthanir of house Gellir. Son of Sir Anarogas, and the younger brother of Sir Eneryth."
    },
    {
        "id": "sign_catacombs1_grave4",
        "message": "Here lies Lady Gelythus of house Gellir. Wife of Sir Eneryth of house Gellir."
    },
    {
        "id": "sign_catacombs2_grave1",
        "message": "Here lies ta'Draiden, servant of the Shadow in the chapel of Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave2",
        "message": "Here lies ta'Tembas, servant of the Shadow in the chapel of Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave3",
        "message": "Here lies Elodam, servant of Sir Eneryth of house Gellir."
    },
    {
        "id": "sign_catacombs2_grave4",
        "message": "Here lies the remains of one-eyed Tragdas, servant of Sir Eneryth of house Gellir."
    },
    {
        "id": "sign_catacombs2_grave5",
        "message": "Here lies Lerythal the kind. May she rest with the Shadow."
    },
    {
        "id": "sign_catacombs2_grave6",
        "message": "Here lies Kragnis the second, steward of the chapel of Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave7",
        "message": "The writing on the grave reads: Rest with the Shadow, my dearest."
    },
    {
        "id": "sign_catacombs2_papers1",
        "message": "(On the floor is what looks like some torn out pages from a book.)"
    },
    {
        "id": "sign_catacombs2_papers2",
        "message": "(You find some crumpled papers on the floor, containing scribbled notes about the fine arts of pottery making. You decide to leave them be.)"
    },
    {
        "id": "sign_catacombs3_grave1",
        "message": "(The grave reads: Here lies Sir Anarogas of house Gellir, son of Gellir the brave.)"
    },
    {
        "id": "sign_catacombs3_grave2",
        "message": "(The stench coming from the grave is unbearable. Something must have disturbed the grave recently)"
    },
    {
        "id": "sign_catacombs4_grave1",
        "message": "(The cross reads: ta'Dreg lies here, advisor of the Shadow to king Luthor.)"
    },
    {
        "id": "sign_catacombs4_grave2",
        "message": "(The grave reads: King Luthor, our savior and leader. The grave is also adorned with the golden seal of house Luthor.)"
    },
    {
        "id": "sign_hh3_papers",
        "message": "Perched under the statue, you find some papers with drawings of what looks like skeletons. The drawings look like they were made by a child, and you start to wonder how they could have ended up in a place such as this."
    },
    {
        "id": "sign_hh3_grave",
        "message": "(Someone has written the words 'Rest' and 'Shadow' on the cross, in what looks like dried blood.)"
    },
    {
        "id": "sign_bwm30_grave",
        "message": "(The cross reads: Rest with the Shadow, my dear.)"
    },
    {
        "id": "sign_bwm33_grave",
        "message": "(The tombstone contains writing in a language that you do not understand)"
    },
    {
        "id": "sign_bwm52_grave1",
        "message": "(The cross reads: Here lies Magnir the trader. Another casualty of those beasts.)"
    },
    {
        "id": "sign_bwm52_grave2",
        "message": "(The grave looks like it has been recently dug)"
    },
    {
        "id": "sign_bwm52_grave3",
        "message": "(The cross reads: Here lies Torkurt, loyal servant of the Blackwater settlement.)"
    },
    {
        "id": "sign_bwm52_grave4",
        "message": "(The cross reads: Here lies o'Rani, the most fierce warrior on this side of the mountain. May she rest in peace.)"
    },
    {
        "id": "sign_bwm52_grave5",
        "message": "(The cross reads: Unnamed traveller. Found on the cliff-side, killed by one of those beasts.)"
    },
    {
        "id": "sign_bwm52_grave7",
        "message": "(The cross reads: Here lies Trombul, the famous potion maker.)"
    },
    {
        "id": "sign_bwm52_grave6",
        "message": "(The cross reads: Here lies the remains of Antagnart, loved by none but remembered by everyone.)"
    },
    {
        "id": "sign_bwm52_papers1",
        "message": "(On the floor is what looks like some torn out pages from a book)"
    },
    {
        "id": "sign_bwm52_papers2",
        "message": "(You find a crude drawing of one of the white wyrms, but you decide not to keep it since it must belong to someone.)"
    },
    {
        "id": "sign_pwcave1_grave",
        "message": "(The cross shows lots of small indentations, as if someone hit it repeatedly with a sharp object. You can barely make out the words: Rest with the Shadow, my friend. I will avenge those beasts.)"
    },
    {
        "id": "sign_pwcave2a_grave",
        "message": "(The cross contains symbols that you cannot understand.)"
    },
    {
        "id": "sign_pwcave4_grave1",
        "message": "(The cross contains symbols that you cannot understand. It looks like someone started digging up this grave recently, but stopped halfway.)"
    },
    {
        "id": "sign_pwcave4_grave2",
        "message": "(The cross contains symbols that you cannot understand, in addition to a crude drawing of what you think should resemble an Izthiel beast.)"
    },
    {
        "id": "sign_pwcave4_grave3",
        "message": "(The cross contains symbols that you cannot understand, in addition to a crude drawing of what you think should resemble a frog.)"
    },
    {
        "id": "sign_pwcave4_grave4",
        "message": "(The cross contains symbols that you cannot understand, but you recognize the word 'Iqhan'.)"
    },
    {
        "id": "sign_pwcave4_grave5",
        "message": "(The cross contains symbols that you cannot understand, in addition to a crude drawing of what you think should resemble a sword.)"
    },
    {
        "id": "sign_pwcave4_grave6",
        "message": "(The cross contains symbols that you cannot understand, in addition to a crude drawing of something that you cannot make out what it should resemble.)"
    },
    {
        "id": "sign_pwcave4_grave7",
        "message": "(The cross contains symbols that you cannot understand, in addition to an elaborate drawing of a skull.)"
    },
    {
        "id": "sign_waterway14_hole",
        "message": "(You stop to notice a hole in the wall near the ground, large enough to fit something in. The ground here shows recent shoe-prints, which could indicate that the hole in the wall is a hiding place of some sort. However, it seems to be empty now.)"
    },
    {
        "id": "sign_waterway11e_grave",
        "message": "(The cross reads: Here lies Telban. A beloved friend of many, and a dreaded foe for those that did not pay up.)"
    },
    {
        "id": "sign_mountaincave0_grave",
        "message": "(The cross reads: Tengil the needy lies here, after having succumbed to the nastiest of poisons. Rest with the Shadow, my friend.)"
    },
    {
        "id": "sign_mountainlake1_grave",
        "message": "(The ground around the grave looks like it has been partially dug up by animals. They don't seem to have gotten anywhere yet though.)"
    },
    {
        "id": "sign_waytobrim3_grave1",
        "message": "Here lies the remains of Ilirathos, mother of two."
    },
    {
        "id": "sign_waytobrim3_grave2",
        "message": "Ke'roos lies here. No one knew him in life since he always kept to himself, but we all thank him for the generous gifts he left behind for Brimhaven."
    },
    {
        "id": "sign_waytobrim3_grave3",
        "message": "Here lies Lawellyn the weak."
    },
    {
        "id": "sign_waytolake2_grave",
        "message": "(The cross is covered with a thick layer of web. You wonder why anyone would choose this place as a grave for their fallen)"
    },
    {
        "id": "sign_lh1_grave",
        "message": "(Even though the wood on the cross looks like it was cut recently, you see no signs of anything being buried here.)"
    },
    {
        "id": "sign_lh1_sign",
        "message": "(On the wall, you see a plaque that reads 'Bring unto me, that which I cannot bear, for it makes me stronger.')"
    }
]
