[
    {
        "id": "farrik",
        "name": "Night visit",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Farrik in the Fallhaven Thieves' Guild told me of a plan to help a fellow thief escape from the Fallhaven jail.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Farrik in the Fallhaven Thieves' Guild told me the details of the plan, and I accepted the task of helping him. The guard captain apparently has a drinking problem. The plan is that I get a prepared mead from the cook in the Thieves' Guild that will knock out the guard captain in the jail. I might be required to bribe the guard captain.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "I got the prepared mead from the cook in the Thieves' Guild.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "I told Farrik that I don't fully agree with their plan. I might tell the guard captain about their shady plan.",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "I have given the prepared mead to the guard captain.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "I have told the guard captain of the plan that the thieves have to release their friend.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "The guard captain wants me to tell the thieves that the security will be lowered for tonight. We might be able to catch some of the thieves.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "I managed to bribe the guard captain into drinking the prepared mead. He should be out during the night allowing the thieves to break their friend free.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Farrik rewarded me for helping the Thieves' Guild.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "I have told Farrik that the security will be lowered tonight.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "The guard captain thanked me for helping him plan to catch the thieves. He said he will also tell other guards that I helped him.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "A lost potion",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I should find a potion maker called Lodar. Umar in the Fallhaven Thieves' Guild told me that I will need to know the right words to pass a guardian in order to reach Lodar's hideaway.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "Umar told me I should go see someone called Ogam in Vilegard. Ogam can supply me with the right words to reach Lodar's hideaway.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "I have visited Ogam in southwest Vilegard. He was talking in what seemed like riddles. I could barely make out some details when I asked about Lodar's hideaway. 'Halfway between the Shadow and the light. Rocky formations.' and the words 'Glow of the Shadow.' were among the things he said. I am not sure what they mean.",
                "finishesQuest": 0
            },
			{
			   "logText": "I have found a formation of rocks on the Duleian Road. It does not look like they were naturally placed, but rather that they are meant to symbolize something.",
			   "progress": 30
			},
			{
			   "logText": "Could this be the 'rocky formation' that the old man Ogam mentioned? If that is the case, then this might be a clue as to where Andor went.",
			   "progress": 31,
			   "rewardExperience": 1500
			},
			{
			   "logText": "In the woods close to the rocky formation, I encountered a creature blocking the way into the forest.",
			   "progress": 40
			},
			{
			   "progress": 45,
			   "logText": "By speaking the words that Ogam had mentioned, the creature moved out of the way, and almost seemed to welcome me further into the forest.",
			   "rewardExperience": 3000
			},
			{
			   "logText": "I encountered a guard from Feygard in the woods. He told me a tale of a madman that the guards from Feygard are searching for. The madman is wanted for a number of reasons that he would not disclose. He warned me both about the twisty mazes ahead, and about the madman. Apparently, several guards have gone missing after venturing forth, either by getting lost in the maze, or by something that the madman has done to them.",
			   "progress": 50
			},
			{
			   "progress": 51,
			   "logText": "Before leaving, the guard warned me both about the twisty mazes ahead, and about the madman. Apparently, several guards have gone missing after venturing forth, either by getting lost in the maze, or by something that the madman has done to them."
			},
			{
			   "logText": "I found another rocky formation that looked out of place.",
			   "progress": 60,
			   "rewardExperience": 2000
			},
			{
			   "logText": "I encountered another guard from Feygard, disoriented and lost. The things he said did not make sense.",
			   "progress": 71
			},
			{
			   "progress": 72,
			   "logText": "I encountered another guard from Feygard, that seemed to be affected by something. He attacked me without provocation."
			},
			{
			   "logText": "I encountered another guard from Feygard, that rambled of something that 'lurks underneath'. He attacked me without provocation.",
			   "progress": 73
			},
			{
			   "progress": 80,
			   "logText": "I found yet another rocky formation that looked out of place.",
			   "rewardExperience": 2000
			},
			{
			   "progress": 90,
			   "logText": "In a well-hidden cave, I encountered yet another rocky formation that looked similar to the other ones that I've already seen. I must be getting close to whatever these formations lead to.",
			   "rewardExperience": 2000
			},
			{
			   "logText": "In the cave, I reached what looks like a tomb. I was unable to venture further into the tomb because of something that held me back.",
			   "progress": 100
			},
			{
			   "logText": "After navigating through the immense twisty green maze and the damp cave, I have reached a cabin in a clearing. The cabin is occupied by the potion-maker called Lodar.",
			   "finishesQuest": 1,
			   "progress": 110,
			   "rewardExperience": 5000
			}
        ]
    },
    {
        "id": "vilegard",
        "name": "Trusting an outsider",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "The people of Vilegard are very suspicious of outsiders. I was told to go see Jolnor in the Vilegard chapel if I want to gain their trust.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "I have talked to Jolnor in the Vilegard chapel. He suggests I help three influential people in order to gain the trust of the people in Vilegard. I should help Kaori, Wrye and Jolnor in Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "I have helped all three people in Vilegard that Jolnor suggested. Now the people of Vilegard should trust me more.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Kaori's errands",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Jolnor in Vilegard chapel wants me to talk to Kaori in northern Vilegard, to see if she wants any help.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Kaori in northern Vilegard wants me to bring her 10 bonemeal potions.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "I have brought 10 bonemeal potions to Kaori.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Uncertain cause",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor in Vilegard chapel wants me to talk to Wrye in northern Vilegard. She has apparently lost her son recently.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Wrye in northern Vilegard tells me that her son Rincel has gone missing. She thinks that he has died or gotten critically hurt.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Wrye tells me that she thinks the royal guard from Feygard are involved in his disappearance, and that they have recruited him.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Wrye wants me to go search for clues as to what has happened to her son.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "I should go look in the Vilegard tavern and the Foaming Flask tavern north of Vilegard.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "I heard of a boy being in the Foaming Flask tavern a while ago. Apparently he left to the west of the tavern somewhere.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "To the northwest of Vilegard I found a man that had found Rincel fighting some monsters. Rincel had apparently left Vilegard by his own will to go see the city of Feygard. I should go tell Wrye in northern Vilegard what happened to her son.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "I have told Wrye the truth about her son's disappearance.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Spies in the foam",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor in Vilegard chapel tells me of a guard outside of the Foaming Flask tavern, that he thinks is a spy for the Feygard royal guard. He wants me to make the guard disappear, in any way that I see fit. The tavern should be just north of Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "I have convinced the guard outside the Foaming Flask tavern to leave after his shift ends.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "I have started a fight with the guard outside the Foaming Flask tavern. I should bring his Feygard royal guard ring to Jolnor once he is dead to show Jolnor that he has disappeared.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "I have told Jolnor that the guard is now gone.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
