[
    {
        "id": "bwm_agent",
        "name": "The agent and the beast",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "I met a man seeking help for his settlement, the 'Blackwater Mountain'. Supposedly, his settlement is being attacked by monsters and bandits, and they need help from the outside."
            },
            {
                "progress": 5,
                "logText": "I have agreed to help the man and Blackwater Mountain in dealing with the problem."
            },
            {
                "progress": 10,
                "logText": "The man told me to meet him on the other side of the collapsed mine. He will crawl through the mine shaft and I will descend into the pitch-black abandoned mine."
            },
            {
                "progress": 20,
                "logText": "I have navigated through the pitch-black abandoned mine, and met the man on the other side. He seemed very anxious about telling me to head straight to the east once I exit the mine. I should meet the man at the bottom of the mountain to the east."
            },
            {
                "progress": 25,
                "logText": "I heard a story about Prim and the Blackwater Mountain settlement fighting against each other."
            },
            {
                "progress": 30,
                "logText": "I should follow the mountain path up the mountain to the Blackwater settlement."
            },
            {
                "progress": 40,
                "logText": "I met the man again on my way up to Blackwater Mountain. I should proceed further up the mountain."
            },
            {
                "progress": 50,
                "logText": "I have made it up to the snow-filled parts of the Blackwater Mountain. The man told me to proceed further up the mountain. Apparently, the Blackwater Mountain settlement is close by."
            },
            {
                "progress": 60,
                "logText": "I have reached the Blackwater mountain settlement. I should find and talk to their battle master, Harlenn."
            },
            {
                "progress": 65,
                "logText": "I have spoken to Harlenn in the Blackwater Mountain settlement. Apparently, the settlement is under attack by a number of monsters, the Aulaeth and white wyrms. On top of that, they are being attacked by the people of Prim."
            },
            {
                "progress": 66,
                "logText": "Harlenn thinks the people of Prim are behind the monster attacks somehow."
            },
            {
                "progress": 70,
                "logText": "Harlenn wants me to give a message to Guthbered of Prim. Either the people of Prim stop their attacks on the Blackwater Mountain settlement, or they will have to be dealt with themselves. I should go talk to Guthbered in Prim."
            },
            {
                "progress": 80,
                "logText": "Guthbered denies that the people of Prim have anything to do with the monster attacks on the Blackwater mountain settlement. I should go talk to Harlenn"
            },
            {
                "progress": 90,
                "logText": "Harlenn is sure that the people of Prim are behind the attacks somehow."
            },
            {
                "progress": 95,
                "logText": "Harlenn wants me to go to Prim and look for signs that they are preparing for an attack on the settlement. I should go look for clues around where Guthbered stays."
            },
            {
                "progress": 100,
                "logText": "I have found some plans in Prim about recruiting mercenaries and attacking the Blackwater Mountain settlement. I should go talk to Harlenn immediately."
            },
            {
                "progress": 110,
                "logText": "Harlenn thanked me for investigating the attack plans.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "To make the attacks on the Blackwater Mountain settlement stop, Harlenn wants me to assassinate Guthbered in Prim."
            },
            {
                "progress": 130,
                "logText": "I have started a fight with Guthbered."
            },
            {
                "progress": 131,
                "logText": "I told Guthbered that I was sent to kill him, but I let him live. He thanked me deeply, and left Prim.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "I have told Harlenn that Guthbered is gone."
            },
            {
                "progress": 150,
                "logText": "Harlenn thanked me for the help I have provided. Hopefully, the attacks on the Blackwater Mountain settlement should stop now.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "I am now trusted in the Blackwater Mountain settlement, and all services should be available for me to use.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "I have decided to not help the people of the Blackwater Mountain settlement.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Since I am helping Prim, Harlenn no longer wants to talk to me.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Well rested",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I talked to the cook in Prim, at the base of Blackwater Mountain. There is a back room available for rent, but it is currently rented out to Arghest. I should go talk to Arghest to see whether he still wants to rent the room. The cook pointed me towards the southwest of Prim."
            },
            {
                "progress": 20,
                "logText": "I talked to Arghest about the back room at the inn. He is still interested in having it as an option to rest at. But he told me he could probably be persuaded to let me use it if I compensate him sufficiently."
            },
            {
                "progress": 30,
                "logText": "Arghest wants me to bring him 5 bottles of milk. I can probably find some milk in any of the larger villages."
            },
            {
                "progress": 40,
                "logText": "I have brought the milk to Arghest. He agreed to let me use the back room at the Prim inn. I should be able to rest there now. I should go talk to the cook at the inn.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "I have explained to the cook that I have permission by Arghest to use the back room.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Clouded intent",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Just outside the collapsed mine on the way to Blackwater Mountain, I met a man from the village of Prim. He begged me to help them."
            },
            {
                "progress": 11,
                "logText": "The village of Prim needs help from someone from the outside to deal with attacks from some monsters. I should speak to Guthbered in Prim if I want to help them."
            },
            {
                "progress": 15,
                "logText": "Guthbered can be found in the main hall of Prim. I should look for a stone house in the center of town."
            },
            {
                "progress": 20,
                "logText": "I talked to Guthbered about the story about Prim. Prim has recently been under constant attack from the Blackwater Mountain settlement."
            },
            {
                "progress": 25,
                "logText": "Guthbered wants me to go up to the settlement atop the Blackwater Mountain and ask their battle master Harlenn why (or if) they have summoned the Gornaud monsters against Prim."
            },
            {
                "progress": 30,
                "logText": "I have talked to Harlenn about the attacks on Prim. He denies that the people of the Blackwater Mountain settlement have anything to do with them. I should go talk to Guthbered in Prim again."
            },
            {
                "progress": 40,
                "logText": "Guthbered still believes that the people in the Blackwater settlement have something to do with the attacks."
            },
            {
                "progress": 50,
                "logText": "Guthbered wants me to go look for any clues that the people of the Blackwater Mountain settlement is preparing for a larger attack on Prim. I should go look for hints near Harlenn's private quarters, but make sure not to be seen."
            },
            {
                "progress": 60,
                "logText": "I have found some papers around Harlenn's private quarters outlining a plan to attack Prim. I should go talk to Guthbered immediately."
            },
            {
                "progress": 70,
                "logText": "Guthbered thanked me for helping him find evidence of the plans for an attack.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "In order to make the attacks on Prim stop, Guthbered wants me to kill Harlenn up in the Blackwater Mountain settlement."
            },
            {
                "progress": 90,
                "logText": "I have started a fight with Harlenn."
            },
            {
                "progress": 91,
                "logText": "I told Harlenn that I was sent to kill him, but I let him live. He thanked me deeply, and left the settlement.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "I have told Guthbered that Harlenn is gone."
            },
            {
                "progress": 100,
                "logText": "Guthbered thanked me for the help I have provided to Prim. Hopefully, the attacks on Prim should stop now. As thanks, Guthbered gave me some items and a forged permit so that I can enter the inner chamber up in the Blackwater Mountain settlement.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "I have shown the forged permit to the guard and was let through to the inner chamber."
            },
            {
                "progress": 240,
                "logText": "I am now trusted in Prim, and all services should be available for me to use.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "I have decided to not help the people of Prim.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Since I am helping the Blackwater Mountain settlement, Guthbered no longer wants to talk to me.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Lights in the dark",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "I have made my way into the inner chamber in the Blackwater Mountain settlement and found a group of mages led by a man named Throdna."
            },
            {
                "progress": 9,
                "logText": "Throdna seems very interested in someone (or something) called Kazaul, and in particular a ritual performed in its name."
            },
            {
                "progress": 10,
                "logText": "I have agreed to help Throdna find out more about the ritual itself, by looking for pieces of the ritual that apparently are scattered across the mountain. I should go look for the parts of the Kazaul ritual on the mountain path down from Blackwater Mountain to Prim."
            },
            {
                "progress": 11,
                "logText": "I need to find the two parts of the chant and the three pieces describing the ritual itself, and return to Throdna once I have found them all."
            },
            {
                "progress": 21,
                "logText": "I have found the first half of the chant for the Kazaul ritual."
            },
            {
                "progress": 22,
                "logText": "I have found the second half of the chant for the Kazaul ritual."
            },
            {
                "progress": 25,
                "logText": "I have found the first piece of the Kazaul ritual."
            },
            {
                "progress": 26,
                "logText": "I have found the second piece of the Kazaul ritual."
            },
            {
                "progress": 27,
                "logText": "I have found the third piece of the Kazaul ritual."
            },
            {
                "progress": 30,
                "logText": "Throdna thanked me for finding all the pieces of the ritual.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna wants me to put an end to the Kazaul spawn uprising that has taken place near the Blackwater Mountain. There is a shrine at the base of the mountain that i should investigate closer."
            },
            {
                "progress": 41,
                "logText": "I have been given a vial of purifying spirit that Throdna wants me to apply to the shrine of Kazaul. I should return to Throdna when I have found and purified the shrine."
            },
            {
                "progress": 50,
                "logText": "In the shrine at the base of Blackwater Mountain, I met a guardian of Kazaul. By reciting the verses of the ritual chant, I was able to make the guardian attack me."
            },
            {
                "progress": 60,
                "logText": "I have purified the shrine of Kazaul.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "I had expected some form of appreciation from Throdna for helping him learn more about the ritual and for purifying the shrine. But he seemed more occupied with rambling on about Kazaul. I could not make out anything sane from his ramblings.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "No weakness",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Herec on the second level of the Blackwater Mountain settlement is researching the white wyrms outside the settlement. He wants me to bring him 5 white wyrm claws so that he can continue his research. Apparently, only some of the wyrms have these claws. I will have to kill some to find them."
            },
            {
                "progress": 20,
                "logText": "I have given the 5 white wyrm claws to Herec."
            },
            {
                "progress": 30,
                "logText": "Herec has finished making a potion of fatigue restoration that will be very useful when fighting against the wyrms in the future.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Awoken from slumber",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur in Prim at the base of the Blackwater Mountain thinks that something has disturbed the grave of his parents, to the southwest of Prim, just outside the Elm mine."
            },
            {
                "progress": 15,
                "logText": "Bjorgur wants me to go check the grave, and make sure his family's dagger is still secure in the tomb."
            },
            {
                "progress": 20,
                "logText": "Fulus in Prim is interested in obtaining Bjorgur's family dagger that Bjorgur's grandfather used to possess."
            },
            {
                "progress": 30,
                "logText": "I met a man that wielded a strange looking dagger in the lower parts of a tomb to the southwest of Prim. He must have robbed this dagger from the grave."
            },
            {
                "progress": 40,
                "logText": "I placed the dagger back into its place in the tomb. The restless undead seem much less restless now, strangely enough.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur thanked me for my assistance. He told me I should also seek his relatives in Feygard.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "I have told Fulus that I helped Bjorgur return his family dagger to its original place."
            },
            {
                "progress": 60,
                "logText": "I have given Bjorgur's family dagger to Fulus. He thanked me for bringing it to him, and rewarded me handsomely.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
