[
  {
    "id": "lodar2",
    "name": "Searching for madness",
    "showInLog": 1,
    "stages": [
      {
        "logText": "The potion-maker Lodar seems to be obsessed with something called the Hira'zinn.",
        "progress": 10
      },
      {
        "logText": "Apparently, it relates to something that has started to happen recently.",
        "progress": 15
      },
      {
        "logText": "Lodar gave me a glowing stone, that he said would allow me to enter some sort of tomb. He did not say which tomb, where the tomb is located, or how to reach it - only that it's somewhere 'below'. Below what, I wonder?",
        "progress": 20
      },
      {
        "logText": "In the cave leading to Lodar's Hideaway, I reached what looks like a tomb. Could this be the one Lodar was referring to?",
        "progress": 30
      },
      {
        "logText": "The glowing stone that Lodar gave me, crumbled to dust as I got near the tomb. However, it seems that I am now able to enter.",
        "progress": 35
      },
      {
        "logText": "I have encountered a foul creature inside the tomb. I assume this is the Hira'zinn that Lodar was referring to. I should kill it and then tell Lodar.",
        "progress": 40
      },
      {
        "logText": "I have presented the heart of the Hira'zinn to Lodar.",
        "progress": 50,
        "rewardExperience": 1000
      },
      {
        "logText": "As soon as I presented the heart of the Hira'zinn to Lodar, he seemed to snap out of his previous state of mind.",
        "progress": 51
      },
      {
        "logText": "Lodar thanked me for defeating the Hira'zinn. In return, he promised to help me in any way he can. He has a large selection of potent potions available for me to purchase at a discount.",
        "progress": 60,
        "finishesQuest": 1
      }
    ]
  },
  {
    "id": "lodar_pots",
    "name": "Lodar's potions",
    "showInLog": 1,
    "stages": [
      {
        "logText": "Lodar says that he can make potions from some animal remains, if I first bring him some Spotted Hornbeam fungus. Apparently, the potion-maker in Fallhaven has a stock of it, if you know enough to ask.",
        "progress": 10
      },
      {
        "logText": "I have retrieved some Spotted Hornbeam fungus from the potion-maker in Fallhaven. I should return to Lodar with it as soon as possible.",
        "progress": 20
      },
      {
        "logText": "I have given the Spotted Hornbeam fungus to Lodar.",
        "progress": 30
      },
      {
        "logText": "Lodar thanked me for bringing him the fungus. In return, he can now create his special potions for me.",
        "finishesQuest": 1,
        "progress": 40,
        "rewardExperience": 2000
      },
      {
        "logText": "Lodar can create a defensive potion if I bring him two White wyrm claws and a Ruby gem.",
        "progress": 41
      },
      {
        "progress": 42,
        "logText": "Lodar can create a potion of strength if I bring him a dead spider and the wings of an insect."
      },
      {
        "logText": "Lodar can create a potent defensive potion if I bring him two Arulir skins and a claw from some monster. The Arulir beasts can be found somewhere up in the north, and the claws can apparently be found from creatures that dwell underground and in caves somewhere outside Fallhaven.",
        "progress": 43
      }
    ]
  },
  {
    "id": "xulviir",
    "name": "A creeping fear",
    "showInLog": 1,
    "stages": [
      {
        "logText": "I was told that the broken sword that I found on the body of the Hira'zinn should be taken to the smith in Vilegard.",
        "progress": 10
      },
      {
        "logText": "I have restored the Xul'viir. I had to threaten the smith in Vilegard to get it restored.",
        "finishesQuest": 1,
        "progress": 20,
        "rewardExperience": 2000
      },
      {
        "logText": "I have destroyed the Xul'viir.",
        "finishesQuest": 1,
        "progress": 30,
        "rewardExperience": 2000
      }
    ]
  },
  {
    "id": "lodar13_rest",
    "name": "No rest for the guilty",
    "showInLog": 1,
    "stages": [
      {
        "logText": "In the maze of green vines east of the Duleian road, I met a guard named Aulowenn from Feygard, guarding some crates. She told me that she was part of a larger group of guards searching for a madman that supposedly hides somewhere in the nearby hills, but that the other guards are now dead or missing.",
        "progress": 10
      },
      {
        "logText": "Aulowenn requested my help in defeating a monster that haunts the grave of her fellow guards to the east. She warned me that the foul beast will most likely try to trick me into listening to its story.",
        "progress": 11
      },
      {
        "logText": "I have met the creature that Aulowenn spoke of.",
        "progress": 20
      },
      {
        "logText": "I listened to the creature's story. Its name is Tiqui, and he is the head of his clan. Apparently, the guards have been ruthlessly killing off his kin. He asked me to kill the guard for him, as revenge for what they have done.",
        "progress": 22
      },
      {
        "logText": "The creature tried to trick me into listening to its story.",
        "progress": 24
      },
      {
        "logText": "I attacked the creature before it could spew out more of its foul lies.",
        "progress": 30
      },
      {
        "logText": "I attacked Aulowenn.",
        "progress": 31
      },
      {
        "logText": "Aulowenn thanked me for bringing peace to the grave of her fallen companions by killing the creature.",
        "progress": 40
      },
      {
        "logText": "Tiqui was overjoyed that I helped him kill the guard for him. He promised that if we ever run into each other again, he'd help me somehow.",
        "progress": 41
      },
      {
        "logText": "I am now able to use Aulowenn's bed whenever I wish to rest.",
        "finishesQuest": 1,
        "progress": 60,
        "rewardExperience": 3000
      },
      {
        "logText": "I will not be able to resolve the conflict between Aulowenn and her attacker.",
        "finishesQuest": 1,
        "progress": 65
      }
    ]
  }
]