[
    {
        "id": "remgard",
        "name": "Everything in order",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I have reached the bridge to enter the town of Remgard. According to the bridge guard, the town is closed for outsiders to enter, and no-one is currently allowed to leave. They are investigating some disappearances of some of the townspeople."
            },
            {
                "progress": 15,
                "logText": "I have offered my assistance in helping the people of Remgard investigate what has happened to the townspeople that have disappeared."
            },
            {
                "progress": 20,
                "logText": "The bridge guard has asked me to investigate an abandoned house to the east along the northern shore of the lake. I should be wary of any inhabitants that may be there."
            },
            {
                "progress": 30,
                "logText": "I have reported back to the bridge guard that I met Algangror in the abandoned house.",
                "rewardExperience": 3000
            },
            {
                "progress": 31,
                "logText": "I have reported back to the bridge guard that the abandoned house was empty.",
                "rewardExperience": 3000
            },
            {
                "progress": 35,
                "logText": "I have been granted entrance into Remgard. I should go visit Jhaeld, the town elder, to talk about what the next step should be. Jhaeld can probably be found in the tavern to the southeast."
            },
            {
                "progress": 40,
                "logText": "Jhaeld was rather arrogant, but told me that they have had a problem with people disappearing for a while now. They have no clue what could be causing it."
            },
            {
                "progress": 50,
                "logText": "I should visit four people in Remgard, and ask them about any clues on what might have happened to the missing people."
            },
            {
                "progress": 51,
                "logText": "First is Norath, whose wife Bethir has disappeared. Norath can be found in the south-westernmost farmhouse."
            },
            {
                "progress": 52,
                "logText": "Second, I should go talk to the Knights of Elythom, here in the tavern."
            },
            {
                "progress": 53,
                "logText": "Third, I should go talk to the old woman Duaina in her house to the south."
            },
            {
                "progress": 54,
                "logText": "Lastly, I should talk to Rothses, the armorer. He lives on the west side of town."
            },
            {
                "progress": 59,
                "logText": "I tried to tell Jhaeld about Algangror, but he dismissed me as he had not heard me."
            },
            {
                "progress": 61,
                "logText": "I have talked to Norath. He and his wife had been fighting recently, but he has no idea on what may have happened to her."
            },
            {
                "progress": 62,
                "logText": "The Knights of Elythom in the Remgard tavern have had one of their knights disappearing recently. No one noticed anything when she disappeared, however."
            },
            {
                "progress": 63,
                "logText": "Duaina has seen me in her visions. I did not understand all that she spoke of, but the parts that were clear were that me and Andor were parts of a larger plot. I wonder what this means? She did not speak of any disappearing people however, not that I could understand anyway."
            },
            {
                "progress": 64,
                "logText": "Rothses told me that Bethir visited him the night before she disappeared, to sell some equipment. He did not see where she went after that."
            },
            {
                "progress": 70,
                "logText": "I have talked to all of the people that Jhaeld wanted me to talk to, but did not get any information from any of them about what may have happened to the missing people. I should go back to Jhaeld and ask what his plans are next."
            },
            {
                "progress": 75,
                "logText": "Jhaeld was really upset that I did not find out anything from the people that I was sent to talk to.",
                "rewardExperience": 15000
            },
            {
                "progress": 80,
                "logText": "If I still want to help Jhaeld and the people of Remgard, I should look for clues in other places.",
                "finishesQuest": 1
            },
            {
                "progress": 110,
                "logText": "Jhaeld does not want to talk to me. I will not help them find out what happened to the missing people of Remgard.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "remgard2",
        "name": "What is that stench?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I have told Jhaeld, the village elder in Remgard, about the woman named Algangror that lives in the abandoned house to the east along the northern shore of the lake outside Remgard."
            },
            {
                "progress": 20,
                "logText": "Jhaeld told me that he would rather not deal with her, since he believes she is very dangerous. For the sake of his guards, he will not risk going against her since he is afraid of what might happen to all of them."
            },
            {
                "progress": 21,
                "logText": "If I want to help Jhaeld and the people of Remgard, I should find a way to make Algangror disappear. He also warns me to be extremely careful."
            },
            {
                "progress": 30,
                "logText": "Algangror admitted to me that she had made some people disappear from Remgard. She would not tell me what happened to them though."
            },
            {
                "progress": 35,
                "logText": "I have started attacking Algangror. I should return to Jhaeld with proof of defeating her when she is dead."
            },
            {
                "progress": 40,
                "logText": "I have told Jhaeld that I defeated Algangror."
            },
            {
                "progress": 41,
                "logText": "Jhaeld was very pleased to hear the good news. The people of Remgard should now be safe, and the town can be opened to outsiders again."
            },
            {
                "progress": 45,
                "logText": "For helping the people of Remgard find the cause of the disappearing people, Jhaeld told me to talk to Rothses. He might be able to improve some of my equipment.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 46,
                "logText": "Ervelyn, the Remgard tailor, gave me a feathered hat as thanks for helping the people of Remgard find out what happened to the missing people."
            }
        ]
    },
    {
        "id": "fiveidols",
        "name": "The five idols",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Algangror wants me to help her with a task. She cannot describe the nature of the task, or the reasoning behind it. If I help her, she has promised to give me her enchanted necklace, that apparently is worth a lot."
            },
            {
                "progress": 20,
                "logText": "I have agreed to help Algangror with her task."
            },
            {
                "progress": 30,
                "logText": "Algangror wants me to place five idols near five different people in Remgard. The idols should be placed near the beds of these five people, and must be hidden so that they are not found easily."
            },
            {
                "progress": 31,
                "logText": "The first person is Jhaeld, the village elder that can be found in the Remgard tavern."
            },
            {
                "progress": 32,
                "logText": "Second, I should place an idol by the bed of Larni the farmer, that lives in one of the northern cabins in Remgard."
            },
            {
                "progress": 33,
                "logText": "The third person is Arnal the weapon-smith, that lives in the northwest of Remgard."
            },
            {
                "progress": 34,
                "logText": "Fourth is Emerei, that can be found to the southeast of Remgard."
            },
            {
                "progress": 35,
                "logText": "The fifth person is Carthe. Carthe lives on the eastern shore of Remgard, near the tavern."
            },
            {
                "progress": 37,
                "logText": "I must not tell anyone of my task, or of the placement of the idols."
            },
            {
                "progress": 41,
                "logText": "I have placed an idol by Jhaeld's bed."
            },
            {
                "progress": 42,
                "logText": "I have placed an idol by Larni the farmer's bed."
            },
            {
                "progress": 43,
                "logText": "I have placed an idol by Arnal's bed."
            },
            {
                "progress": 44,
                "logText": "I have placed an idol by Emerei's bed."
            },
            {
                "progress": 45,
                "logText": "I have placed an idol by Carthe's bed."
            },
            {
                "progress": 50,
                "logText": "All the idols have been placed by the beds of the people that Algangror told me to visit. I should return to Algangror."
            },
            {
                "progress": 51,
                "logText": "Algangror thanked me for helping her."
            },
            {
                "progress": 60,
                "logText": "She told me her story, with how she used to live in the city, but was persecuted for her beliefs. According to her, the persecution was totally unjustified since she does no harm to people."
            },
            {
                "progress": 61,
                "logText": "To take revenge on the city of Remgard, she managed to lure some people into her cabin and turn them into rats."
            },
            {
                "progress": 70,
                "logText": "For helping her with the tasks that she could not perform herself, Algangror gave me her enchanted necklace, 'Marrowtaint'.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 100,
                "logText": "I have decided not to help Algangror with her task.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaverin",
        "name": "Old friends?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I met Kaverin in Remgard, that apparently is an old acquaintance of Unzel, who lives outside of Fallhaven."
            },
            {
                "progress": 20,
                "logText": "Kaverin wants me to deliver a message to Unzel."
            },
            {
                "progress": 21,
                "logText": "I have declined to help Kaverin.",
                "finishesQuest": 1
            },
            {
                "progress": 22,
                "logText": "I have agreed to deliver the message."
            },
            {
                "progress": 25,
                "logText": "Kaverin has given me the message that he wants me to deliver to Unzel."
            },
            {
                "progress": 30,
                "logText": "I have delivered the message to Unzel. I should return to Kaverin in Remgard."
            },
            {
                "progress": 40,
                "logText": "Kaverin thanked me for delivering the message to Unzel.",
                "rewardExperience": 10000
            },
            {
                "progress": 45,
                "logText": "In return, Kaverin gave me an old map that he had acquired. Apparently, it leads to Vacor's old hideout."
            },
            {
                "progress": 60,
                "logText": "Kaverin was furious over the fact that I killed Unzel, and that I helped Vacor. He started attacking me. I should return to Vacor once Kaverin is dead."
            },
            {
                "progress": 70,
                "logText": "Kaverin was carrying a sealed message. Vacor immediately recognized the seal, and seemed very interested in it."
            },
            {
                "progress": 75,
                "logText": "I have given Vacor the message that Kaverin was carrying. In return, Vacor gave me an old map, leading to his old hideout.",
                "rewardExperience": 10000
            },
            {
                "progress": 90,
                "logText": "I should try to find Vacor's old hideout, on the road to the west of the former prison of Flagstone, southwest of Fallhaven."
            },
            {
                "progress": 100,
                "logText": "I have found Vacor's old hideout.",
                "finishesQuest": 1
            }
        ]
    }
]
