[
    {
        "id": "toszylae",
        "name": "An involuntary carrier",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "On the road between Loneford and Brimhaven, I found a dried up lake-bed with a major cavern below. Deep inside the cavern, I met Ulirfendor - a priest of the Shadow from Brimhaven. Ulirfendor is trying to translate the inscriptions on a shrine of Kazaul, and has determined that it speaks of the 'Dark protector', but he is unsure what that refers to. Whatever it means, he is determined that it must be stopped."
            },
            {
                "progress": 11,
                "logText": "Ulirfendor needs help with figuring out what some of the missing parts on the shrine says. The inscription reads 'Kulauil hamar urum Kazaul'te', but the next parts have been completely eroded from the rock."
            },
            {
                "progress": 15,
                "logText": "I have agreed to help Ulirfendor find out what the missing parts of the inscription might be. Ulirfendor believes the shrine speaks of a powerful creature that lives deeper inside the dungeon. Maybe that could provide some clue as to what the missing parts are."
            },
            {
                "progress": 20,
                "logText": "Deep inside the dungeon, I encountered a radiant guardian, guarding some other being. The guardian uttered the phrases 'Kulauil hamar urum Kazaul'te. Kazaul hamat urul'. This must be what Ulirfendor was looking for. I should return to him at once."
            },
            {
                "progress": 21,
                "logText": "I tried to attack the guardian, but was unable to even reach it. Some powerful force held me back. Maybe Ulirfendor knows more."
            },
            {
                "progress": 30,
                "logText": "Ulirfendor was very pleased to hear that I uncovered the missing parts of the inscription.",
                "rewardExperience": 2000
            },
            {
                "progress": 32,
                "logText": "He also told me the continuation of the inscription, but did not know what it means. I should go back to the guardian and speak the words that Ulirfendor told me."
            },
            {
                "progress": 42,
                "logText": "I have spoken the words to the guardian.",
                "rewardExperience": 5000
            },
            {
                "progress": 45,
                "logText": "The guardian gave off a chilling laughter, and started attacking me."
            },
            {
                "progress": 50,
                "logText": "I defeated the guardian and reached the lich 'Toszylae'. The lich managed to infect me with something. I must kill the lich and return to Ulirfendor."
            },
            {
                "progress": 60,
                "logText": "Ulirfendor told me that he had managed to translate the parts of the inscription that I told the guardian. Apparently, what I told the guardian roughly means 'My body for Kazaul'. Ulirfendor was very concerned about what this means for me, and was very regretful that he had made me speak the words."
            },
            {
                "progress": 70,
                "logText": "Ulirfendor was very happy to hear that I managed to defeat the lich. With the lich defeated, the people in the surrounding areas should be safe now.",
                "rewardExperience": 20000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "darkprotector",
        "name": "The dark protector",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I have found a strange looking helmet from the lich 'Toszylae' that I defeated. I should go ask Ulirfendor if he knows anything about it."
            },
            {
                "progress": 15,
                "logText": "Ulirfendor in the same dungeon thinks this artifact is what the shrine speaks of, and that it will bring misery to the surroundings of whoever carries it. He wants me to help him destroy it immediately."
            },
            {
                "progress": 26,
                "logText": "To destroy the artifact, I would need give the helmet and the heart of the lich to Ulirfendor."
            },
            {
                "progress": 30,
                "logText": "I have given the helmet to Ulirfendor."
            },
            {
                "progress": 31,
                "logText": "I have given the heart of the lich to Ulirfendor."
            },
            {
                "progress": 35,
                "logText": "Ulirfendor has destroyed the artifact. The people of the surrounding towns are safe from whatever misery the helmet would have brought."
            },
            {
                "progress": 40,
                "logText": "For helping with both the lich and the helmet, Ulirfendor has given me the dark blessing of the Shadow.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 41,
                "logText": "For helping with both the lich and the helmet, Ulirfendor wanted to give me the dark blessing of the Shadow, but I declined.",
                "rewardExperience": 35000,
                "finishesQuest": 1
            },
            {
                "progress": 50,
                "logText": "I have decided to keep the helmet for myself. Who knows what power I could gain from it."
            },
            {
                "progress": 51,
                "logText": "Ulirfendor attacked me for keeping the helmet."
            },
            {
                "progress": 55,
                "logText": "I found a book by the shrine where Ulirfendor was. The book talks of a ritual that would restore the helmet to its true power. I should complete the ritual by the shrine if I want to use the helmet."
            },
            {
                "progress": 60,
                "logText": "I have started the Kazaul ritual."
            },
            {
                "progress": 65,
                "logText": "I have placed the helmet in front of the Kazaul shrine."
            },
            {
                "progress": 66,
                "logText": "I have placed the lich's heart in front of the Kazaul shrine."
            },
            {
                "progress": 70,
                "logText": "The ritual is complete, and I have restored the power of the helmet to its former glory.",
                "rewardExperience": 5000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "maggots",
        "name": "I have it in me",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Deep inside a cavern, I encountered a lich of Kazaul. Somehow the lich managed to infect me with things that crawl around in my stomach! I must find some way to get rid of these things inside of me. I should go talk to Ulirfendor, or seek help in one of the chapels."
            },
            {
                "progress": 20,
                "logText": "Ulirfendor tells me that he read something long ago about rotworms that feed upon living tissue. They can have what he called 'unusual' effects on whoever carries them, and their eggs can slowly kill a person from the inside. I should seek help immediately, before it is too late."
            },
            {
                "progress": 21,
                "logText": "Ulirfendor says that one of the priests of the Shadow should be able help me. I should go visit Talion at the chapel in Loneford at once."
            },
            {
                "progress": 30,
                "logText": "Talion in Loneford told me that in order to be cured of my affliction, I will need to bring four parts to him. The parts that I will need are five bones, two pieces of animal hair, one Irdegh poison gland and one empty vial. Bones and fur can probably be found on some animal in the wilderness, and the poison gland can be found on one of the Irdeghs that have been spotted to the east."
            },
            {
                "progress": 40,
                "logText": "I have brought the five bones to Talion."
            },
            {
                "progress": 41,
                "logText": "I have brought the two pieces of animal hair to Talion."
            },
            {
                "progress": 42,
                "logText": "I have brought one Irdegh poison gland to Talion."
            },
            {
                "progress": 43,
                "logText": "I have brought an empty vial to Talion."
            },
            {
                "progress": 45,
                "logText": "I have now brought all pieces that Talion needs in order to cure me of these things."
            },
            {
                "progress": 50,
                "logText": "Talion has cured me of the Kazaul rotworms. I managed to get one of the rotworms into an empty vial, and Talion told me that it would be very valuable. I cannot imagine for what.",
                "rewardExperience": 30000
            },
            {
                "progress": 51,
                "logText": "Because of my former affliction, Talion has agreed to help me by placing blessings of the Shadow upon me whenever I wish, for a fee.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "sisterfight",
        "name": "A difference in opinion",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I heard a story about two squabbling sisters in Remgard, Elwel and Elwyl. Apparently they have kept people awake at night with the way they are shouting at each other. I should go visit them in their house on the southern shore of the city of Remgard."
            },
            {
                "progress": 20,
                "logText": "I have talked to Elwyl, one of the Elwille sisters in Remgard. She is furious at her sister for not agreeing on even the most simple of facts. Apparently, they have had their disagreements with each other for several years."
            },
            {
                "progress": 21,
                "logText": "Elwel will not speak to me."
            },
            {
                "progress": 30,
                "logText": "One matter that the sisters disagree on currently is the color of a certain potion that the town potion-maker Hjaldar used to make. Elwyl says that the potion of accuracy focus that Hjaldar used to make was a blue potion, but Elwel insists that the potion had a green substance."
            },
            {
                "progress": 31,
                "logText": "Elwyl wants me to get a potion of accuracy focus from Hjaldar here in Remgard so that she can finally prove to Elwel that she is wrong."
            },
            {
                "progress": 40,
                "logText": "I have talked to Hjaldar in Remgard. Hjaldar no longer makes potions since his supply of Lyson marrow extract has gone dry."
            },
            {
                "progress": 41,
                "logText": "Apparently, Hjaldar's old friend Mazeg would surely have some Lyson marrow extract to sell. Unfortunately, he does not know where Mazeg currently lives. He only knows that Mazeg traveled far to the west last time they met."
            },
            {
                "progress": 45,
                "logText": "I should find Mazeg and get some Lyson marrow extract so that Hjaldar can start making potions again."
            },
            {
                "progress": 50,
                "logText": "I have talked to Mazeg in the Blackwater mountain settlement. Since I helped the people of the Blackwater mountain before, he is willing to sell me a vial of Lyson marrow extract for only 400 gold."
            },
            {
                "progress": 51,
                "logText": "I have talked to Mazeg in the Blackwater mountain settlement. He is willing to sell me Lyson marrow extract for 800 gold."
            },
            {
                "progress": 55,
                "logText": "I have bought some Lyson marrow extract from Mazeg. I should return to Remgard and give it to Hjaldar."
            },
            {
                "progress": 60,
                "logText": "Hjaldar thanked me for bringing him the marrow extract.",
                "rewardExperience": 15000
            },
            {
                "progress": 61,
                "logText": "Hjaldar can now create potions again, and is willing to trade with me. He even gave me some of the first potions that he made. I should go visit the Elwille sisters here in Remgard again, and show them a potion of accuracy focus."
            },
            {
                "progress": 70,
                "logText": "I have given a potion of accuracy focus to Elwyl."
            },
            {
                "progress": 71,
                "logText": "Unfortunately, it did not cause their squabbling to diminish. On the contrary, they seem to be even more angry at each other now, since both of them had the color wrong.",
                "rewardExperience": 9000,
                "finishesQuest": 1
            }
        ]
    }
]
