[
    {
        "id": "erinith",
        "name": "Deep wound",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Just northeast of Crossglen village, I met Erinith that has set up camp. Apparently, he was attacked during the night and lost a book."
            },
            {
                "progress": 20,
                "logText": "I have agreed to help Erinith find his book. He told me he threw it among some trees to the north of his camp."
            },
            {
                "progress": 21,
                "logText": "I have agreed to help Erinith find his book in return for 200 gold. He told me he threw it among some trees to the north of his camp."
            },
            {
                "progress": 30,
                "logText": "I have returned the book to Erinith.",
                "rewardExperience": 500
            },
            {
                "progress": 31,
                "logText": "He also needs help with his wound that doesn't seem to be healing. Either I should bring him one potion of major health, or four regular potions of health."
            },
            {
                "progress": 40,
                "logText": "I gave Erinith a bonemeal potion to heal his wound. He was a bit scared to use it since they are prohibited by Lord Geomyr."
            },
            {
                "progress": 41,
                "logText": "I gave Erinith a potion of a major health to heal his wound."
            },
            {
                "progress": 42,
                "logText": "I gave Erinith four regular potions of health to heal his wound."
            },
            {
                "progress": 50,
                "logText": "The wound healed completely and Erinith thanked me for all the help.",
                "rewardExperience": 700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "hadracor",
        "name": "Devastated land",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "On the road to Carn Tower, west of the crossroads guardhouse, I met a group of woodcutters led by Hadracor. Hadracor wants me to help him get revenge on some wasps that were attacking them while they were cutting down the forest. To help them get revenge, I should look for giant wasps near their encampment and bring him at least five giant wasp wings."
            },
            {
                "progress": 20,
                "logText": "I have brought five giant wasp wings to Hadracor."
            },
            {
                "progress": 21,
                "logText": "I have brought six giant wasp wings to Hadracor. For helping him, he gave me a pair of gloves."
            },
            {
                "progress": 30,
                "logText": "Hadracor thanked me for helping him and the other woodcutters get revenge on the wasps. In return, he offered me to trade for some of his items.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "tinlyn",
        "name": "Lost sheep",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "On the road to Feygard, near the Feygard bridge, I met a shepherd named Tinlyn. Tinlyn told me that four of his sheep have wandered away and that he won't dare leave the remaining sheep to go look for them."
            },
            {
                "progress": 15,
                "logText": "I have agreed to help Tinlyn find his four lost sheep."
            },
            {
                "progress": 20,
                "logText": "I have found one of Tinlyn's lost sheep."
            },
            {
                "progress": 21,
                "logText": "I have found one of Tinlyn's lost sheep."
            },
            {
                "progress": 22,
                "logText": "I have found one of Tinlyn's lost sheep."
            },
            {
                "progress": 23,
                "logText": "I have found one of Tinlyn's lost sheep."
            },
            {
                "progress": 25,
                "logText": "I have found all four of Tinlyn's lost sheep."
            },
            {
                "progress": 30,
                "logText": "Tinlyn thanked me for finding his lost sheep.",
                "rewardExperience": 300,
                "finishesQuest": 1
            },
            {
                "progress": 31,
                "logText": "Tinlyn thanked me for finding his lost sheep, but he had no reward to give me.",
                "rewardExperience": 500,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "I have attacked at least one of Tinlyn's lost sheep and is therefore unable to return them all to Tinlyn.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "benbyr",
        "name": "Cheap cuts",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I have met Benbyr outside the Crossroads guardhouse. He wants to get revenge on an old 'business partner' of his - Tinlyn. Benbyr wants me to kill all Tinlyn's sheep."
            },
            {
                "progress": 20,
                "logText": "I have agreed to help Benbyr find Tinlyn's sheep and kill all eight of them. I should go look for them in the fields northwest of the crossroads guardhouse."
            },
            {
                "progress": 21,
                "logText": "I have started attacking the sheep. I should return to Benbyr once I have killed all eight of them."
            },
            {
                "progress": 30,
                "logText": "Benbyr was thrilled to hear that all of Tinlyn's sheep are dead.",
                "rewardExperience": 900,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "I declined to help Benbyr kill the sheep.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "rogorn",
        "name": "The path is clear to me",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Minarra up in the tower at the Crossroads guardhouse has seen a band of rogues heading west from the guardhouse, towards Carn Tower. Minarra was sure they matched the description of some men whose heads have a bounty on them from the Feygard patrol. If these are the men that Minarra thinks, they are supposedly led by particularly ruthless savage named Rogorn."
            },
            {
                "progress": 20,
                "logText": "I am helping Minarra find the band of rogues. I should travel the road west from the Crossroads guardhouse towards Carn Tower and look for them. They have supposedly stolen three pieces of a valuable painting and are wanted dead for their crimes."
            },
            {
                "progress": 21,
                "logText": "Minarra also tells me that I should not trust anything I hear from them. In particular, anything from Rogorn should be viewed with great suspicion."
            },
            {
                "progress": 30,
                "logText": "I have found the band of rogues on the road west towards Carn Tower, led by Rogorn."
            },
            {
                "progress": 35,
                "logText": "Rogorn tells me that they are wrongly accused of murder and theft in Feygard, while they themselves have never even been to Feygard."
            },
            {
                "progress": 40,
                "logText": "I have decided to attack Rogorn and his band of rogues. I should return to Minarra with the three pieces of the painting once they are dead."
            },
            {
                "progress": 45,
                "logText": "I have decided not to attack Rogorn and his band of rogues, but instead report back to Minarra that she must have mistaken the men she saw for someone else."
            },
            {
                "progress": 50,
                "logText": "Minarra thanked me for dealing with the thieves, and told me that my services to Feygard will be appreciated."
            },
            {
                "progress": 55,
                "logText": "After telling Minarra that she must have mistaken the men for someone else, she seemed a bit suspicious, but thanked me for helping her look into the matter."
            },
            {
                "progress": 60,
                "logText": "I have helped Minarra with her task.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "feygard_shipment",
        "name": "Feygard errands",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I met Gandoren, the guard captain at the Crossroads guardhouse. He told me about some trouble up in Loneford, that have forced the guards to be even more alert than usual. Because of this, they can't do their regular errands themselves but need help with some basic things."
            },
            {
                "progress": 20,
                "logText": "Gandoren wants me to help him transport a shipment of 10 iron swords to another guard post to the south."
            },
            {
                "progress": 21,
                "logText": "I have agreed to help Gandoren transport the shipment, as a service for Feygard."
            },
            {
                "progress": 22,
                "logText": "I have grudgingly agreed to help Gandoren transport the shipment."
            },
            {
                "progress": 25,
                "logText": "I should deliver the shipment to the Feygard patrol captain stationed in the Foaming Flask tavern."
            },
            {
                "progress": 26,
                "logText": "Gandoren tells me that Ailshara has expressed some interest in the Feygard shipments, and urges me to stay away from her."
            },
            {
                "progress": 30,
                "logText": "Ailshara is indeed interested in the shipment, and wants me to help Nor City with the supplies instead."
            },
            {
                "progress": 35,
                "logText": "If I want to help Ailshara and Nor City, I should deliver the shipment to the smith in Vilegard instead."
            },
            {
                "progress": 50,
                "logText": "I have delivered the shipment to the Feygard patrol captain in the Foaming Flask tavern. I should go tell Gandoren in the Crossroads guardhouse that the shipment is delivered."
            },
            {
                "progress": 55,
                "logText": "I have delivered the shipment to the smith in Vilegard."
            },
            {
                "progress": 56,
                "logText": "The Vilegard smith gave me a shipment of degraded items that I should deliver to the Feygard patrol captain in the Foaming Flask tavern instead of the normal ones."
            },
            {
                "progress": 60,
                "logText": "I have delivered the shipment of degraded items to the Feygard patrol captain in the Foaming Flask tavern. I should go tell Gandoren in the Crossroads guardhouse that the shipment is delivered."
            },
            {
                "progress": 80,
                "logText": "Gandoren thanked me for helping him deliver the shipment.",
                "rewardExperience": 500,
                "finishesQuest": 1
            },
            {
                "progress": 81,
                "logText": "Gandoren thanked me for helping him deliver the shipment. He never suspected anything. I should also report back to Ailshara."
            },
            {
                "progress": 82,
                "logText": "I have reported back to Ailshara.",
                "rewardExperience": 500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "loneford",
        "name": "Flows through the veins",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "I heard a story about Loneford. Apparently, a lot of people have become ill there recently, and some have even died. The cause is still unknown."
            },
            {
                "progress": 11,
                "logText": "I should investigate what could have caused the people of Loneford to become ill. To gather clues, I should ask the citizens of Loneford and the surrounding areas about what they think is the cause."
            },
            {
                "progress": 21,
                "logText": "The guards in the Crossroads guardhouse are certain that the illness in Loneford is caused by some sabotage done by the priests or people from Nor City."
            },
            {
                "progress": 22,
                "logText": "Some villagers in Loneford believe that the illness is caused by the guards from Feygard, in some scheme to make the people suffer even more than they already have."
            },
            {
                "progress": 23,
                "logText": "Talion, the chapel priest in Loneford, thinks that the illness is the work of the Shadow, as punishment for Loneford's lack of devotion to the Shadow."
            },
            {
                "progress": 24,
                "logText": "Taevinn in Loneford is certain that Sienn in the southeast barn has something to do with the illness. Apparently, Sienn keeps a pet around that has approached Taevinn in a threatening manner several times."
            },
            {
                "progress": 25,
                "logText": "I should go see Landa in the Loneford tavern. Rumor has it that he saw something that he doesn't dare tell anyone."
            },
            {
                "progress": 30,
                "logText": "Landa confused me with someone else at first. He apparently saw a boy doing something around the town well during the night before the illness started. He was scared to talk to me at first since he thought I looked like the boy he had seen. Could it have been Andor that he saw?"
            },
            {
                "progress": 31,
                "logText": "Also, the night after he saw the boy at the well, he saw Buceth taking samples of the water in the well. Strangely enough, Buceth has not gotten ill like the others in the village."
            },
            {
                "progress": 35,
                "logText": "I should go question Buceth at the Loneford chapel about what he was doing at the well, and about whether he knows anything about Andor."
            },
            {
                "progress": 41,
                "logText": "I have bribed Buceth into talking to me."
            },
            {
                "progress": 42,
                "logText": "I have told Buceth that I am ready to follow the Shadow."
            },
            {
                "progress": 45,
                "logText": "Buceth tells me that he is assigned by the priests in Nor City to make sure the Shadow casts its glow over Loneford. Apparently, the priests had sent a boy to do some business in Loneford, and Buceth was tasked with gathering some samples from the water well."
            },
            {
                "progress": 50,
                "logText": "I have attacked Buceth. I should bring any evidence that Buceth has on him to Kuldan, the guard captain in the longhouse in Loneford."
            },
            {
                "progress": 54,
                "logText": "I have given the vial that Buceth had on him to Kuldan, the guard captain in Loneford."
            },
            {
                "progress": 55,
                "logText": "Kuldan thanked me for solving the mystery of the illness in Loneford. They will start bringing in water with help from Feygard instead of drinking from the well from now on. Kuldan also told me to visit the castle steward in Feygard if I want to help further.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "I have promised to keep Buceth's story a secret. If Andor was indeed here, he must have had a good reason for doing what he did. Buceth also told me to visit the chapel custodian in Nor City if I want to learn more about the Shadow.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            }
        ]
    }
]
