[
  {
    "id": "charwood1",
    "name": "Destined for great things",
    "showInLog": 1,
    "stages": [
      {
        "logText": "I heard a rumor that some mining town in the Charwood forest, northwest of the Foaming Flask tavern, have had some troubles recently. I should try to find the Charwood cabin and find out what has happened.",
        "progress": 10
      },
      {
        "logText": "I heard someone mentioning that the mining town of Charwood heights have had some troubles recently. I should search for the Charwood cabin in the forest northwest of the Foaming Flask tavern.",
        "progress": 11
      },
      {
        "logText": "I have found the Charwood cabin in the forest northwest of the Foaming Flask tavern.",
        "progress": 19
      },
      {
        "logText": "Maevalia in the Charwood cabin told me a story about how their mining settlement was attacked by some monsters, forcing them to flee down the mountain. They are still missing several of their friends and relatives from the Charwood heights, either killed or captured by the monsters.",
        "progress": 20
      },
      {
        "logText": "In particular, Maevalia mentions four people that are greatly missed; their former leader Morenavia, their weapons trainer Falothen, the healer Ayell and their armorer Fayvara.",
        "progress": 21
      },
      {
        "logText": "I have agreed to help the people of Charwood find their missing people.",
        "progress": 30
      },
      {
        "logText": "The guard outside the Charwood cabin allowed me to enter the hills ahead. I should keep to the east and then head north.",
        "progress": 35
      },
      {
        "logText": "I encountered one of the monsters that Maevalia spoke of. The monster spoke of someone or something called 'The Thukuzun'.",
        "progress": 40
      },
      {
        "logText": "I have found Falothen, the weapons trainer of the Charwood heights, and freed him of the restraints that held him. He will try to make his way back to the Charwood cabin himself.",
        "progress": 41
      },
      {
        "logText": "I have found some skeletal remains, containing a ring with the insignia 'Morenavia'. This must be the former leader of the Charwood hills.",
        "progress": 42
      },
      {
        "logText": "I have found the armorer Fayvara, and freed her of the restraints that held her. She will try to make her way back to the Charwood cabin herself.",
        "progress": 43
      },
      {
        "logText": "I have found some skeletal remains, containing a ring with the insignia 'Ayell'. This must be the remains of the Charwood hills healer that Maevalia mentioned.",
        "progress": 44
      },
      {
        "logText": "Maevalia thanked me for finding out what happened to the four people that she told me about, but was really sad to hear about the fate of Morenavia and Ayell. Both the weapons trainer Falothen and the armorer Fayvara made it back to the Charwood cabin safely.",
        "progress": 50
      },
      {
        "logText": "She told me that both Falothen and Fayvara are anxious to see me, in the basement of the Charwood cabin. I should go see them at once.",
        "progress": 60
      },
      {
        "logText": "Falothen was happy to see me again, and in return offered to train me in better handling of one weapon type. He can teach me better handling of one- or two handed swords, daggers, blunt weapons, axes, or unarmed combat. I'll have to chose my preference and let him know.",
        "progress": 65
      },
      {
        "logText": "Falothen has taught me how to better handle one handed swords.",
        "progress": 70
      },
      {
        "logText": "Falothen has taught me how to better handle two handed swords.",
        "progress": 71
      },
      {
        "logText": "Falothen has taught me how to better handle daggers.",
        "progress": 72
      },
      {
        "logText": "Falothen has taught me how to better handle blunt weapons.",
        "progress": 73
      },
      {
        "logText": "Falothen has taught me how to better handle axes.",
        "progress": 74
      },
      {
        "logText": "Falothen has taught me how to be better at fighting unarmed, without weapons.",
        "progress": 75
      },
      {
        "logText": "Falothen offered me the chance to learn about the other weapon types, but to teach me, he needs 5000 gold and two Oegyth crystals for each skill that I want to get better at.",
        "progress": 80
      },
      {
        "logText": "Fayvara thanked me for rescuing her, and in return offered to train me in better handling of one type of armor. She can teach me better handling of shields, light armor, heavy armor or or unarmored combat. I'll have to chose my preference and let her know.",
        "progress": 90
      },
      {
        "logText": "Fayvara has taught me how to better handle shields.",
        "progress": 91
      },
      {
        "logText": "Fayvara has taught me how to better handle light armor.",
        "progress": 92
      },
      {
        "logText": "Fayvara has taught me how to better handle heavy armor.",
        "progress": 93
      },
      {
        "logText": "Fayvara has taught me how to better fighting unarmored, without wearing any armor.",
        "progress": 94
      },
      {
        "logText": "Fayvara offered me the chance to learn about the other armor types, but to teach me, she needs 6000 gold and two Oegyth crystals for each skill that I want to get better at.",
        "progress": 100
      },
      {
        "logText": "I have been taught one weapon type skill and one armor type skill from Falothen and Fayvara. I should go see Maevalia again.",
        "progress": 110
      },
      {
        "logText": "Maevalia thanked me for helping the people of Charwood.",
        "progress": 115,
        "finishesQuest": 1,
        "rewardExperience": 3000
      }
    ]
  },
  {
    "id": "charwood2",
    "name": "Trial by fire",
    "showInLog": 1,
    "stages": [
      {
        "logText": "I've heard a story that the whole reason for the Charwood hills being invaded by the monsters in the first place was that something had been awoken deep in the Charwood mine. The people in the Charwood cabin say that the miners uncovered some sort of marking on the ground in a cave, with strange noises coming from below it. When they finally broke through the ground around the markings, all the troubles started. I should talk to Maevalia again.",
        "progress": 10
      },
      {
        "logText": "I've promised Maevalia to investigate the deeper parts of the Charwood mine. I should be on the lookout for the dangerous monsters that inhabit the mine.",
        "progress": 15
      },
      {
        "logText": "I've reached the part of the mine that was broken into. The air around here seems to get hotter as I get deeper into the mine.",
        "progress": 20
      },
      {
        "logText": "Among the fires in the lower parts of the mine, I've encountered some type of dragon-like creature. I guess this is the source of all the chaos in the mine. I should attempt to kill it and then venture back to Maevalia to tell her about it once I'm victorious.",
        "progress": 30
      },
      {
        "logText": "I have presented one of the bones from the corpse of the Thukuzun to Maevalia.",
        "progress": 40
      },
      {
        "logText": "Maevalia was happy to hear that I killed the source of the monster invasion.",
        "progress": 50,
        "finishesQuest": 1,
        "rewardExperience": 7000
      }
    ]
  }
]