[
    {
        "id": "sign_wild3_grave",
        "message": "Na cruz, se lê: Descanse em paz, meu amigo."
    },
    {
        "id": "sign_wild6_stump",
        "message": "Você percebe que o toco da árvore é parcialmente oco, e parece um esconderijo excelente. Está vazio agora."
    },
    {
        "id": "sign_snakecave3_grave",
        "message": "O terreno ao redor da sepultura está cheio de pequenos furos, provavelmente causados por algo que deslizou no caminho para o seu ninho lá adiante. A cruz tem algo escrito nela, mas você não consegue entender o que diz"
    },
    {
        "id": "sign_fallhaven_ne_grave1",
        "message": "Aqui jaz Kargir o comerciante."
    },
    {
        "id": "sign_fallhaven_ne_grave2",
        "message": "(A pedra está coberta com uma fina camada de musgo. A escrita na pedra corroeu e está completamente ilegível)"
    },
    {
        "id": "sign_fallhaven_ne_grave3",
        "message": "Descanse com a Sombra, Berth-perna-única. Ela viveu uma vida plena, mas no final ela não conseguia suportar mais a doença que se abateu sobre ela."
    },
    {
        "id": "sign_fallhaven_ne_grave4",
        "message": "Os restos de Kigrim estão aqui, depois que ele foi morto por lobos, ao sul de Fallhaven"
    },
    {
        "id": "sign_fallhaven_ne_grave5",
        "message": "Gimlont, o corpulento, está aqui. Que possamos finalmente ficar livres de suas mãos engorduaradas que faziam parte de todos os nossos negócios."
    },
    {
        "id": "sign_fallhaven_ne_grave6",
        "message": "Aqui jaz Terdar, o ferreiro. Que ele esteja sempre abraçado pelo conforto da Sombra."
    },
    {
        "id": "sign_fallhaven_ne_grave7",
        "message": "Aqui jaz O'llath, elogiado por seus concidadãos de Fallhaven por seus deliciosos bolos."
    },
    {
        "id": "sign_fallhaven_ne_grave8",
        "message": "Sidari, o lenhador, está aqui. Nós todos dissemos-lhe para ter cuidado com o machado dele, mas ele nunca nos escutou."
    },
    {
        "id": "sign_fallhaven_ne_grave9",
        "message": "Tyngose, ​​o nobre, está aqui. Que seu legado nunca seja esquecido."
    },
    {
        "id": "sign_catacombs1_grave1",
        "message": "Aqui jaz os restos do cavalo de Sir Eneryth, o Shadowsteed."
    },
    {
        "id": "sign_catacombs1_grave2",
        "message": "Aqui jaz Sir Eneryth, da casa de Gellir. Filho de Sir Anarogas, e irmão mais velho de Sir Karthanir."
    },
    {
        "id": "sign_catacombs1_grave3",
        "message": "Aqui jaz Sir Karthanir da casa de Gellir. Filho de Sir Anarogas, e irmão mais novo de Sir Eneryth."
    },
    {
        "id": "sign_catacombs1_grave4",
        "message": "Aqui jaz Lady Gelythus da casa de Gellir. Esposa de Sir Eneryth, da casa de Gellir."
    },
    {
        "id": "sign_catacombs2_grave1",
        "message": "Aqui jaz ta'Draiden, servo da Sombra na capela de Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave2",
        "message": "Aqui jaz ta'Tembas servo, da Sombra na capela de Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave3",
        "message": "Aqui jaz Elodam, servo do Senhor Eneryth, da casa de Gellir."
    },
    {
        "id": "sign_catacombs2_grave4",
        "message": "Aqui jaz os restos mortais de Tragdas-caolho, empregado de Sir Eneryth da casa Gellir."
    },
    {
        "id": "sign_catacombs2_grave5",
        "message": "Aqui jaz o gentil Lerythal. Que ela descanse com a Sombra4358"
    },
    {
        "id": "sign_catacombs2_grave6",
        "message": "Here lies Kragnis the second, steward of the chapel of Fallhaven."
    },
    {
        "id": "sign_catacombs2_grave7",
        "message": "The writing on the grave reads: Rest with the Shadow, my dearest."
    },
    {
        "id": "sign_catacombs2_papers1",
        "message": "(No chão é o que se parece com algumas páginas arrancadas de um livro)"
    },
    {
        "id": "sign_catacombs2_papers2",
        "message": "(Você encontra alguns papéis amassados ​​no chão, contendo notas rabiscadas sobre as belas artes da cerâmica. Você decide deixá-los onde está)"
    },
    {
        "id": "sign_catacombs3_grave1",
        "message": "(O túmulo lê:. Aqui jaz Sir Anarogas da casa Gellir, filho de Gellir, o bravo)"
    },
    {
        "id": "sign_catacombs3_grave2",
        "message": "(O fedor que vem do túmulo é insuportável. Algo deve ter perturbado o túmulo recentemente)"
    },
    {
        "id": "sign_catacombs4_grave1",
        "message": "(Na cruz, lê-se:. Ta'Dreg está aqui, conselheiro da sombra do rei Luthor)"
    },
    {
        "id": "sign_catacombs4_grave2",
        "message": "(O túmulo lê:.. Rei Luthor, nosso salvador e líder. O túmulo também está adornado com o selo dourado da casa de Luthor)"
    },
    {
        "id": "sign_hh3_papers",
        "message": "Situado sob a estátua, você encontra alguns papéis com desenhos do que parecem esqueletos. Os desenhos parecem que foram feitos por uma criança, e você começa a se perguntar como eles poderiam ter acabado em um lugar como este. "
    },
    {
        "id": "sign_hh3_grave",
        "message": "(Alguém escreveu as palavras 'Descanso' e 'Sombra' na cruz, com o que parece ser sangue seco)"
    },
    {
        "id": "sign_bwm30_grave",
        "message": "(Na cruz lê-se: Descanse com a Sombra, minha querida)"
    },
    {
        "id": "sign_bwm33_grave",
        "message": "(A lápide foi escrita em um idioma que você não entende)"
    },
    {
        "id": "sign_bwm52_grave1",
        "message": "(Na cruz, lê-se:.. Aqui jaz Magnir, o comerciante. Outra vítima desses animais)"
    },
    {
        "id": "sign_bwm52_grave2",
        "message": "(O túmulo parece que foi recentemente escavado)"
    },
    {
        "id": "sign_bwm52_grave3",
        "message": "(A cruz diz: Aqui jaz Torkurt, servo leal do acampamento das Águas Negras)"
    },
    {
        "id": "sign_bwm52_grave4",
        "message": "(Na cruz, lê-se:.. Aqui jaz o'Rani, o guerreiro mais feroz deste lado da montanha. Que ele descanse em paz)"
    },
    {
        "id": "sign_bwm52_grave5",
        "message": "(Na cruz, lê-se:.. Viajante Sem nome encontrado no penhasco do lado, morto por um desses animais)"
    },
    {
        "id": "sign_bwm52_grave7",
        "message": "(Na cruz, lê-se:. Aqui jaz Trombul, o famoso fabricante de porções)"
    },
    {
        "id": "sign_bwm52_grave6",
        "message": "(Na cruz, lê-se:. Aqui jaz os restos de Antagnart, amado por ninguém, mas lembrado por todos)"
    },
    {
        "id": "sign_bwm52_papers1",
        "message": "(No chão está o que se parece com algumas páginas arrancadas de um livro)"
    },
    {
        "id": "sign_bwm52_papers2",
        "message": "(Você encontra um desenho primitivo de um dos dragões brancos, mas você decide não mantê-lo, uma vez que deve pertencer a alguém)"
    },
    {
        "id": "sign_pwcave1_grave",
        "message": "(A cruz mostra lotes de pequenos recortes, como se alguém batesse repetidamente com um objeto afiado. Você mal consegue ler as palavras:... Descanse com a sombra, meu amigo, eu vou vingar-lhe dessas bestas)"
    },
    {
        "id": "sign_pwcave2a_grave",
        "message": "(A cruz contém símbolos que você não pode entender)"
    },
    {
        "id": "sign_pwcave4_grave1",
        "message": "(A cruz contém símbolos que você não pode entender. Parece que alguém começou a cavar esta cova recentemente, mas parou na metade.)"
    },
    {
        "id": "sign_pwcave4_grave2",
        "message": "(A cruz contém símbolos que você não pode compreender e um desenho rude do que você acha que parece com uma besta Izthiel.)"
    },
    {
        "id": "sign_pwcave4_grave3",
        "message": "(A cruz contém símbolos que você não pode compreender e um desenho rude do que você acha que parece com um sapo.)"
    },
    {
        "id": "sign_pwcave4_grave4",
        "message": "(A cruz contém símbolos que você não pode compreender, mas você reconhece a palavra'Iqhan')"
    },
    {
        "id": "sign_pwcave4_grave5",
        "message": "(A cruz contém símbolos que você não pode compreender e um desenho rude do que você acha que parece com uma espada.)"
    },
    {
        "id": "sign_pwcave4_grave6",
        "message": "(A cruz contém símbolos que você não pode compreender  e um desenho rude que não parece com nada que você já tenha visto antes.)"
    },
    {
        "id": "sign_pwcave4_grave7",
        "message": "(A cruz contém símbolos que você não pode compreender e um desenho elaborado de uma caveira)"
    },
    {
        "id": "sign_waterway14_hole",
        "message": "(você para para observar um buraco na parede perto do chão, grande o suficiente para caber algo dentro. O terreno aqui mostra marcas recentes de sapato, o que poderia indicar que o buraco na parede é um esconderijo de algum tipo. No entanto, parece estar vazio agora)"
    },
    {
        "id": "sign_waterway11e_grave",
        "message": "(Na cruz, lê-se:.. Aqui jaz Telban, um querido amigo de muitos, e um inimigo temido por aqueles que não saldavam suas dívidas)"
    },
    {
        "id": "sign_mountaincave0_grave",
        "message": "(Na cruz, lê-se:.. Tengil, o necessitado, está aqui, depois de ter sucumbido ao mais desagradável dos venenos. Descanse com a sombra, meu amigo)"
    },
    {
        "id": "sign_mountainlake1_grave",
        "message": "(O solo ao redor da sepultura parece que foi parcialmente desenterrado por animais. Eles não parecem ter chegado a lugar algum ainda)"
    },
    {
        "id": "sign_waytobrim3_grave1",
        "message": "Aqui jaz os restos de Ilirathos, mãe de dois."
    },
    {
        "id": "sign_waytobrim3_grave2",
        "message": "Ke'roos está aqui. Ninguém o conhecia na vida, pois sempre foi muito reservado, mas todos nós somos-lhe gratos pelos presentes generosos que ele deixou em Brimhaven."
    },
    {
        "id": "sign_waytobrim3_grave3",
        "message": "Aqui jaz Lawellyn, o fraco."
    },
    {
        "id": "sign_waytolake2_grave",
        "message": "(A cruz está coberta com uma grossa camada de telhas de aranha. Você quer saber por que alguém iria escolher este lugar como um túmulo para seu descanso)"
    },
    {
        "id": "sign_lh1_grave",
        "message": "(Mesmo que a madeira na cruz pareca ter sido cortada recentemente, você não vê sinais de algo que esteja enterrado aqu.)"
    },
    {
        "id": "sign_lh1_sign",
        "message": "(Na parede, você vê uma placa que diz 'Traga-me o que eu não posso suportar, porque isso me torna mais forte'."
    }
]
