[
    {
        "id": "ambelie_1",
        "message": "O quê? Um plebeu! Fique longe de mim. Eu poderia pegar alguma doença.",
        "replies": [
            {
                "text": "Quem é você?",
                "nextPhraseID": "ambelie_2"
            },
            {
                "text": "O que é que uma mulher nobre como você está fazendo em um lugar como este?",
                "nextPhraseID": "ambelie_5"
            },
            {
                "text": "Eu ficaria feliz em permanecer longe de uma esnobe como você.",
                "nextPhraseID": "X"
            }
        ]
    },
    {
        "id": "ambelie_2",
        "message": "Eu sou Ambelie da casa de Laumwill de Feygard. Tenho certeza que você deve ter ouvido falar de mim e de minha casa.",
        "replies": [
            {
                "text": "Ah sim .. hum .. Casa de Laumwill em Feygard. Claro.",
                "nextPhraseID": "ambelie_3"
            },
            {
                "text": "Eu nunca ouvi falar de você ou de sua casa.",
                "nextPhraseID": "ambelie_4"
            },
            {
                "text": "Onde fica Feygard?",
                "nextPhraseID": "ambelie_3"
            }
        ]
    },
    {
        "id": "ambelie_3",
        "message": "Feygard, a grande cidade da paz. Certamente você deve saber disso. Ao noroeste em nosso grande reino.",
        "replies": [
            {
                "text": "O que é uma mulher nobre como você está fazendo em um lugar como este?",
                "nextPhraseID": "ambelie_5"
            },
            {
                "text": "Não, eu nunca ouvi falar.",
                "nextPhraseID": "ambelie_4"
            }
        ]
    },
    {
        "id": "ambelie_4",
        "message": "Pfft. Isso só prova que tudo o que ouvi de vocês selvagens aqui na terra do sul. Então, uma criatura sem nenhuma educação."
    },
    {
        "id": "ambelie_5",
        "message": "Eu, Ambelie, da casa de Laumwill em Feygard, estou em uma excursão para o sul de Nor City.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "ambelie_6"
            }
        ]
    },
    {
        "id": "ambelie_6",
        "message": "Uma excursão para ver se realmente Nor City é tudo o que eu ouvi falar a respeito. Se ela realmente pode comparar-se ao glamour da grande cidade de Feygard.",
        "replies": [
            {
                "text": "Nor City, onde é isso?",
                "nextPhraseID": "ambelie_7"
            },
            {
                "text": "Se você gosta tanto de Feygard, por que você a deiou?",
                "nextPhraseID": "ambelie_9"
            }
        ]
    },
    {
        "id": "ambelie_7",
        "message": "Você não sabe de Nor City? Vou tomar nota de que os selvagens aqui nunca ouviram falar da cidade.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "ambelie_8"
            }
        ]
    },
    {
        "id": "ambelie_8",
        "message": "Estou começando a ter cada vez mais certeza de que Nor City, nem mesmo em meus piores pesadelos, possa ser comparável à grande cidade de Feygard.",
        "replies": [
            {
                "text": "Boa sorte em sua excursão.",
                "nextPhraseID": "ambelie_10"
            }
        ]
    },
    {
        "id": "ambelie_9",
        "message": "Todos os nobres em Feygard continuam falando sobre a Sombra misteriosa de Nor City. Eu só tenho que ver por mim mesmo.",
        "replies": [
            {
                "text": "Nor City, onde é isso?",
                "nextPhraseID": "ambelie_7"
            },
            {
                "text": "Boa sorte em sua excursão.",
                "nextPhraseID": "ambelie_10"
            }
        ]
    },
    {
        "id": "ambelie_10",
        "message": "Obrigado. Agora, por favor vá embora antes que alguém me vê falando com um plebeu como você.",
        "replies": [
            {
                "text": "Plebeu? Você está tentando me insultar? Tchau.",
                "nextPhraseID": "X"
            },
            {
                "text": "Seja como for, você provavelmente não iria sobreviver até mesmo a uma vespa da floresta.",
                "nextPhraseID": "X"
            }
        ]
    }
]
