[
    {
        "id": "taevinn",
        "message": "Por favor, você tem que nos ajudar!",
        "replies": [
            {
                "text": "Você sabe alguma coisa sobre a doença?",
                "nextPhraseID": "taevinn_1",
                "requires": {
                    "progress": "loneford:11"
                }
            },
            {
                "text": "O que há de errado?",
                "nextPhraseID": "loneford_farmer0_1"
            }
        ]
    },
    {
        "id": "taevinn_1",
        "message": "Eu vou te dizer o que eu sei. Tentamos seguir a lei por aqui. Sem regras e leis, como nós seríamos diferentes dos selvagens que vagueiam as terras do sul?",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_2"
            }
        ]
    },
    {
        "id": "taevinn_2",
        "message": "Mas mesmo se nós aqui em Loneford mantivermo-nos tão calmo quanto possível, há sempre alguém que tem desejo de causar dano.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_3"
            }
        ]
    },
    {
        "id": "taevinn_3",
        "message": "Você já viu? Que Sienn tolo. Ele e seu 'animal de estimação' estão sempre tentando causar algum problema. Nós não podemos ter isso aqui na nossa amigável aldeia. Especialmente em tempos como estes, quando estamos tentando mostrar o nosso lado bom para os guardas magníficos de Feygard que estão aqui.",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_4"
            }
        ]
    },
    {
        "id": "taevinn_4",
        "message": "Você sabe que eu tentei falar com ele várias vezes sobre seu chamado 'bichinho'? Eu realmente não consegui entender o que ele estava tentando me dizer, mas essa coisa sua quase tentou me matar, ele o fez!",
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "taevinn_5"
            }
        ]
    },
    {
        "id": "taevinn_5",
        "message": "Eu digo a você, existe um mal em torno dele e daquilo que ele mantém em torno de si. Tenho certeza de que eles estão aprontando alguma coisa. Eles provavelmente causaram essa doença, de alguma forma. Talvez possa-se pegar algo contagiante daquela coisa de que ele mantém seu redor.",
        "rewards": [
            {
                "rewardType": 0,
                "rewardID": "loneford",
                "value": 24
            }
        ],
        "replies": [
            {
                "text": "N",
                "nextPhraseID": "loneford_ill_c_1"
            }
        ]
    }
]
