[
    {
        "id": "erinith",
        "name": "Ferida profunda",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "À nordeste da aldeia Crossglen, conheci Erinith que estava acampando. Aparentemente, ele foi atacado durante a noite e perdeu um livro."
            },
            {
                "progress": 20,
                "logText": "Eu concordei em ajudar Erinith a encontrar seu livro. Ele me disse que o jogou entre algumas árvores a norte de seu acampamento."
            },
            {
                "progress": 21,
                "logText": "Eu concordei em ajudar Erinith encontrar seu livro em troca de 200 moedas de ouro. Ele me disse que o jogou entre algumas árvores para o norte de seu acampamento."
            },
            {
                "progress": 30,
                "logText": "eu voltei com o livro para Erinith.",
                "rewardExperience": 2000
            },
            {
                "progress": 31,
                "logText": "Ele também precisa de ajuda com a sua ferida que não parece quere curar. Ou eu devo trazê-lo uma poção maior de saúde, ou quatro poções regulares de saúde."
            },
            {
                "progress": 40,
                "logText": "Eu dei Erinith uma poção de farinha de ossos para curar a ferida. Ele ficou com medo de usá-la, uma vez que são proibidas pelo Lorde Geomyr."
            },
            {
                "progress": 41,
                "logText": "Eu dei Erinith uma poção maior de saúde para curar a ferida."
            },
            {
                "progress": 42,
                "logText": "Eu dei Erinith quatro poções regulares de saúde para curar a ferida."
            },
            {
                "progress": 50,
                "logText": "O ferimento cicatrizou completamente e Erinith me agradeceu por toda a ajuda.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "hadracor",
        "name": "Terra Devastada",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na estrada para Carn Tower, oeste da guarita encruzilhada, eu conheci um grupo de lenhadores liderados por Hadracor. Hadracor quer ajuda para se vingar de algumas vespas que os atacavam enquanto eles estavam derrubando a floresta. Para ajudá-los a se vingar, eu devo procurar as vespas gigantes perto de seu acampamento e trazer pelo menos cinco asas de vespas gigantes."
            },
            {
                "progress": 20,
                "logText": "Eu trouxe cinco asas de vespas gigantes para Hadracor."
            },
            {
                "progress": 21,
                "logText": "Eu trouxe seis asas de vespas gigantes para Hadracor. Pela ajuda, ele deu-me um par de luvas."
            },
            {
                "progress": 30,
                "logText": "Hadracor agradeceu-me por ajudar a ele e aos outros lenhadores a se vingar das vespas. Em troca, ele ofereceu-me trocar comigo alguns de seus itens.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "tinlyn",
        "name": "Lost ovelhas",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na estrada para Feygard, perto da ponte Feygard, eu conheci um pastor chamado Tinlyn. Tinlyn me disse que quatro de suas ovelhas se desviaram e que ele não vai ousar deixar o restante ovelhas para procurar eles."
            },
            {
                "progress": 15,
                "logText": "Eu concordei em ajudar a encontrar o seu Tinlyn quatro ovelhas perdidas."
            },
            {
                "progress": 20,
                "logText": "Eu encontrei uma das ovelhas perdidas da Tinlyn."
            },
            {
                "progress": 21,
                "logText": "Eu encontrei uma das ovelhas perdidas da Tinlyn."
            },
            {
                "progress": 22,
                "logText": "Eu encontrei uma das ovelhas perdidas da Tinlyn."
            },
            {
                "progress": 23,
                "logText": "Eu encontrei uma das ovelhas perdidas da Tinlyn."
            },
            {
                "progress": 25,
                "logText": "Eu encontrei todas as quatro ovelhas perdidas da Tinlyn."
            },
            {
                "progress": 30,
                "logText": "Tinlyn agradeceu-me para encontrar as ovelhas perdidas.",
                "rewardExperience": 3500,
                "finishesQuest": 1
            },
            {
                "progress": 31,
                "logText": "Tinlyn agradeceu-me para encontrar as ovelhas perdidas, mas ele não tinha nenhuma recompensa para me dar.",
                "rewardExperience": 2000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Eu ataquei pelo menos uma das ovelhas perdidas de Tinlyn. Portanto, sou incapaz de devolvêr todas elas para Tinlyn.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "benbyr",
        "name": "Violência gratuita",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu conheci Benbyr no lado de fora da guarita de Crossroads. Ele quer se vingar de um antigo 'parceiro de negócios' seu - Tinlyn. Benbyr quer que eu mate todas as ovelhas de Tinlyn."
            },
            {
                "progress": 20,
                "logText": "Eu concordei em ajudar Benbyr, encontrando todas as ovelhas de Tinlyn e matando todas as oito. Eu devo procurá-las nos campos a noroeste da guarita de Crossroads."
            },
            {
                "progress": 21,
                "logText": "Eu comecei a atacar as ovelhas. Eu devo voltar para Benbyr quando terminar de matar todas os oito."
            },
            {
                "progress": 30,
                "logText": "Benbyr ficou radiante ao saber que todas as ovelhas de Tinlyn estão mortas.",
                "rewardExperience": 5200,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Eu não quis ajudar Benbyr matando ovelhas.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "rogorn",
        "name": "O caminho é claro para mim",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Minarra na torre na guarita de Crossroads viu um bando de malandros indo a oeste da guarita se dirigindo para Carn Tower. Minarra tem certeza de que correspondem à descrição de alguns homens cujas cabeças foram colocadas a prêmio pela patrulha de Feygard. Se estes são os homens que Minarra pensa, eles são supostamente liderados pelo selvagem e particularmente cruel Rogorn."
            },
            {
                "progress": 20,
                "logText": "Eu estou ajudando Minarra a encontrar o bando de malandros. Eu devo viajar pela estrada a oeste da guarita de Crossroads em direção a Carn Tower e procurar por eles. Eles supostamente roubaram três pedaços de uma pintura valiosa e são procurados vivos ou mortos por seus crimes."
            },
            {
                "progress": 21,
                "logText": "Minarra também me diz que eu não posso confiar em qualquer coisa que eu ouça deles. Em particular, qualquer coisa vinda de Rogorn deve ser vista com grande desconfiança."
            },
            {
                "progress": 30,
                "logText": "Eu encontrei os bandidos na estrada nm direção oeste de Carn Tower, liderados por Rogorn."
            },
            {
                "progress": 35,
                "logText": "Rogorn me diz que eles foram injustamente acusados de assassinato e de roubo em Feygard, quando eles mesmos nunca tinham sequer estado Feygard."
            },
            {
                "progress": 40,
                "logText": "eu decidi atacar Rogorn e seu bando de malandros. Eu devo voltar para Minarra com as três partes da pintura, uma vez que eles estejam mortos."
            },
            {
                "progress": 45,
                "logText": "Eu decidi não atacar Rogorn e seu bando de bandidos, mas sim informar a Minarra que ela deve ter confundido os homens que ele viu com alguma outra pessoa."
            },
            {
                "progress": 50,
                "logText": "Minarra agradeceu-me para lidar com os ladrões, e disse-me que os meus serviços para Feygard serão apreciados."
            },
            {
                "progress": 55,
                "logText": "Depois de contar Minarra que ele deve ter confundido os homens com outra pessoa, ela pareceu um pouco desconfiado, mas me agradeceu por ajudá-lo a resolver esse assunto."
            },
            {
                "progress": 60,
                "logText": "Eu ajudei Minarra com sua tarefa.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "feygard_shipment",
        "name": "Recados de Feygard",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "eu conheci Gandoren, o capitão de guarda na guarita de Crossroads. Ele me contou sobre alguns problemas em Loneford, que forçaram os guardas a estarem ainda mais alerta do que o usual. Devido a isso, eles não podem fazer trocar mensagens regularmente entre si, precisando de ajuda com algumas tarefas básicas."
            },
            {
                "progress": 20,
                "logText": "Gandoren quer que eu o ajude a transportar um carregamento de 10 espadas de ferro para outro posto da guarda ao sul."
            },
            {
                "progress": 21,
                "logText": "Eu concordei em ajudar Gandoren a transportar o carregamento, como um serviço para Feygard."
            },
            {
                "progress": 22,
                "logText": "Meio à contragosto concordei em ajudar Gandoren a transportar o carregamento."
            },
            {
                "progress": 25,
                "logText": "Eu devo entregar a remessa para o capitão patrulha Feygard, hospedado na taberna Floaming Flask."
            },
            {
                "progress": 26,
                "logText": "Gandoren me disse que Ailshara manifestou algum interesse nos transportes de Feygard, e pediu-me para ficar longe dela."
            },
            {
                "progress": 30,
                "logText": "Ailshara está realmente interessada no transporte, e quer que eu ajude, ao invés, Nor City com suprimentos."
            },
            {
                "progress": 35,
                "logText": "Se eu quero ajudar Ailshara e Nor City, eu devo entregar a remessa para o ferreiro em Vilegard."
            },
            {
                "progress": 50,
                "logText": "Eu entreguei a remessa para o capitão da patrulha de Feygard na taberna Foaming Flask. Eu devo ir contar a Gandoren na guarita Crossroads que a remessa for entregue."
            },
            {
                "progress": 55,
                "logText": "Eu entreguei o carregamento para o ferreiro em Vilegard."
            },
            {
                "progress": 56,
                "logText": "O ferreiro Vilegard me deu um carregamento de itens degradados que eu devo entregar ao capitão da patrulha Feygard na taberna Foaming Flask em vez dos normais."
            },
            {
                "progress": 60,
                "logText": "Eu entreguei o embarque de itens degradados ao capitão da patrulha de Feygard na taberna Foaming Flask. Eu devo ir contar Gandoren na guarita Crossroads que a remessa foi entregue."
            },
            {
                "progress": 80,
                "logText": "Gandoren me agradeceu por ajudá-lo entregar a remessa.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            },
            {
                "progress": 81,
                "logText": "Gandoren me agradeceu por ajudá-lo entregar a remessa. Ele não suspeitou de nada. Preciso também  informar a Ailshara."
            },
            {
                "progress": 82,
                "logText": "Relatei sobre a remessa à Ailshara.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "loneford",
        "name": "Flui através das veias",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu ouvi uma história sobre Loneford. Aparentemente, muitas pessoas ficaram doentes por lá recentemente, e alguns têm até mesmo morrido. A causa ainda é desconhecida."
            },
            {
                "progress": 11,
                "logText": "Eu devo investigar o que poderia ter causado a doença no povo de Loneford. Para coletar pistas, eu devo perguntar aos cidadãos de Loneford e nas regiões circunvizinhas sobre o que eles acham que é a causa."
            },
            {
                "progress": 21,
                "logText": "Os guardas na guarita de Crossroads estão certos de que a doença em Loneford é causada por alguma sabotagem feito pelos sacerdotes ou pessoas de Nor City."
            },
            {
                "progress": 22,
                "logText": "Alguns moradores em Loneford acreditam que a doença seja causada pelos guardas de Feygard, em algum esquema para fazer o povo sofrer ainda mais do que eles já têm."
            },
            {
                "progress": 23,
                "logText": "Talião, o sacerdote capela em Loneford, acha que a doença é trabalho da Sombra, como punição pela falta Loneford de devoção para a Sombra."
            },
            {
                "progress": 24,
                "logText": "Taevinn em Loneford é certo que Sienn no celeiro sudeste tem algo a ver com a doença. Aparentemente, Sienn mantém pertod e si um animal de estimação que abordou Taevinn de uma maneira ameaçadora várias vezes."
            },
            {
                "progress": 25,
                "logText": "Eu devo ir ver Landa na taberna de Loneford. Há rumores de que ela viu algo que não se atreve a contar para ninguém."
            },
            {
                "progress": 30,
                "logText": "Landa, inicialmente, confundiu-me com outra pessoa. Ela, aparentemente, viu um menino fazendo alguma coisa perto cidade bem durante a noite antes que a doença come cassasse. Ela estava com medo de falar para mim na primeira vez, pois ela pensou que eu parecia como menino que tinha visto. Poderia ter sido Andor que ela viu?"
            },
            {
                "progress": 31,
                "logText": "Além disso, na noite seguinte à em que ela viu o menino no poço, viu Buceth recolher amostras de água no poço. Estranhamente, Buceth não ficou doente como os outros na aldeia."
            },
            {
                "progress": 35,
                "logText": "Eu devo ir perguntar a Buceth, na capela de Loneford, sobre o que ele estava fazendo por lá, e se ele sabe alguma coisa a respeito de Andor."
            },
            {
                "progress": 41,
                "logText": "Eu subornei Buceth a falar comigo."
            },
            {
                "progress": 42,
                "logText": "Eu disse a Buceth que estou pronto para seguir a Sombra."
            },
            {
                "progress": 45,
                "logText": "Buceth me diz que ele foi designado pelos sacerdotes de Nor City para garantir que a Sombra lance seu brilho sobre Loneford. Aparentemente, os sacerdotes enviaram um menino para fazer alguns negócios em Loneford, e Buceth foi encarregado de recolher algumas amostras da água do poço."
            },
            {
                "progress": 50,
                "logText": "Eu ataquei Buceth. Eu devo trazer qualquer evidência de que Buceth tenha com ele para Kuldan, o capitão da guarda que está na casa comprida, em Loneford."
            },
            {
                "progress": 54,
                "logText": "Eu dei o frasco que Buceth tinha com ele para Kuldan, o capitão da guarda em Loneford."
            },
            {
                "progress": 55,
                "logText": "Kuldan agradeceu-me para resolver o mistério da doença em Loneford. Eles vão começar a trazer em água, juntamente com auxílio de Feygard para que não seja mais necessário beber água do poço à partir de agora. Kuldan também me disse para procurar o taifeiro do castelo de Feygard se eu precisar de ajuda.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Eu prometi para manter a história de Buceth em segredo. Se Andor era de fato aqui, ele deve ter tido um bom motivo para fazer o que fez. Buceth também me disse para visitar o guardião da capela na cidade nem se eu quiser saber mais sobre a Sombra.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            }
        ]
    }
]
