[
    {
        "id": "toszylae",
        "name": "Uma carregador involuntário",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na estrada entre Loneford e Brimhaven, eu encontrei o leito seco de um antigo lago com uma grande caverna embaixo. Lá no fundo da caverna, eu conheci Ulirfendor - um sacerdote da Sombra de Brimhaven. Ulirfendor está tentando traduzir as inscrições em um santuário de Kazaul, e comentou que ela fala do 'Protetor Negro', mas ele não tem certeza do que se refere. O que quer que seja, ele está determinado que isso deve ser interrompido."
            },
            {
                "progress": 11,
                "logText": "Ulirfendor precisa de ajuda para descobrir algumas das peças que faltam na inscrição do santuário. Está escrito: 'Kulauil hamar Urum Kazaul'te', mas o restante encontra-se completamente corroído na rocha."
            },
            {
                "progress": 15,
                "logText": "Eu concordei em ajudar Ulirfendor a descobrir as partes que faltam na inscrição. Ulirfendor acredita que o santuário fala de uma poderosa criatura que vive mais profundamente dentro do calabouço. Talvez isso poderia fornecer alguma pista sobre o que está nas partes faltantes."
            },
            {
                "progress": 20,
                "logText": "Bem no fundo da masmorra, eu encontrei um guardião radiante, guardando algum outro ser. O guardião proferiu  a frase 'Kulauil hamar Urum Kazaul'te. Kazaul hamat urul'. Isto deve ser o que Ulirfendor estava procurando. Eu devo voltar a ele agora."
            },
            {
                "progress": 21,
                "logText": "Eu tentei atacar o guardião, mas fui incapaz de chegar até ele. Alguma força poderosa me segurou. Talvez Ulirfendor saiba mais."
            },
            {
                "progress": 30,
                "logText": "Ulirfendor ficou muito satisfeito ao ouvir que eu descobri as partes faltantes na inscrição.",
                "rewardExperience": 2000
            },
            {
                "progress": 32,
                "logText": "Ele também me disse o resto da inscrição, mas não sei o que significa. Eu devo voltar para o guardião e proferir as palavras que Ulirfendor me disse."
            },
            {
                "progress": 42,
                "logText": "Proferi as palavras para o guardião.",
                "rewardExperience": 5000
            },
            {
                "progress": 45,
                "logText": "O guardião deu um largo e frio sorriso, e começou a me atacar."
            },
            {
                "progress": 50,
                "logText": "Derrotei o guardião e fui junto ao linch 'Toszylae'. O lich conseguiu infectar-me com alguma coisa. Devo matar o lich e voltar para Ulirfendor."
            },
            {
                "progress": 60,
                "logText": "Ulirfendor disse-me que ele tinha conseguido traduzir as partes da inscrição que o guardião me disse. Aparentemente, o que o guardião me disse significa aproximadamente 'Meu corpo para Kazaul'. Ulirfendor estava muito preocupado com o que isso significa para mim, e ficou muito perturbado ao dizer-me tais palavras."
            },
            {
                "progress": 70,
                "logText": "Ulirfendor estava muito feliz em saber que eu consegui derrotar o lich. Com o lich derrotado, as pessoas nas áreas circundantes devem estar seguras agora.",
                "rewardExperience": 20000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "darkprotector",
        "name": "O Protetor Negro",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu encontrei um capacete de aparência estranha que tomei de 'Toszylae' o lich ao derrotá-lo. Eu devo perguntar a Ulirfendor se ele sabe alguma coisa sobre isso."
            },
            {
                "progress": 15,
                "logText": "Ulirfendor, na mesma masmorra, acha que este artefato é o mesmo citado no santuário, e que vai trazer miséria nos arredores de quem o carrega. Ele quer que eu o ajude a destruí-lo imediatamente."
            },
            {
                "progress": 26,
                "logText": "Para destruir o artefato, eu preciso dar o capacete e o coração do lich para Ulirfendor."
            },
            {
                "progress": 30,
                "logText": "Eu dei o capacete para Ulirfendor."
            },
            {
                "progress": 31,
                "logText": "Eu dei o coração do lich para Ulirfendor."
            },
            {
                "progress": 35,
                "logText": "Ulirfendor destruiu o artefato. As pessoas das cidades vizinhas estão a salvo de qualquer miséria o capacete teria trazido."
            },
            {
                "progress": 40,
                "logText": "Pela ajuda, tanto com o linch quanto com o capacete, Ulirfendor me deu a bênção escura da sombra.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 41,
                "logText": "Pela ajuda, tanto com o linch quanto com o capacete, Ulirfendor queria me dar a bênção escura da sombra, mas eu recusei.",
                "rewardExperience": 35000,
                "finishesQuest": 1
            },
            {
                "progress": 50,
                "logText": "Eu decidi manter o capacete comigo. Quem sabe o poder que eu poderia ganhar com isso."
            },
            {
                "progress": 51,
                "logText": "Ulirfendor atacou-me por manter o capacete."
            },
            {
                "progress": 55,
                "logText": "Eu encontrei um livro dentro do santuário onde Ulirfendor estava. O livro fala de um ritual que irá restaurar ao capacete para o seu verdadeiro poder. Eu devo completar o ritual do santuário, se eu quiser usar o capacete."
            },
            {
                "progress": 60,
                "logText": "Eu comecei o ritual Kazaul."
            },
            {
                "progress": 65,
                "logText": "Eu coloquei o capacete na frente do santuário de Kazaul."
            },
            {
                "progress": 66,
                "logText": "Eu coloquei o coração do lich na frente do santuário de Kazaul."
            },
            {
                "progress": 70,
                "logText": "O ritual está completo, e eu restaurei o poder do capacete para sua antiga glória.",
                "rewardExperience": 5000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "maggots",
        "name": "Eu tenho algo dentro de mim",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na parte mais profunda de uma caverna, eu encontrei um lich de Kazaul. De alguma forma, o lich conseguiu infectar-me com as coisas que rastejam dentro de minha barriga! Eu preciso encontrar alguma maneira de se livrar dessas coisas dentro de mim. Eu devo ir falar com Ulirfendor, ou buscar ajuda em uma das capelas."
            },
            {
                "progress": 20,
                "logText": "Ulirfendor me dise que ele leu algo sobre vermes da podridão, que se alimentam de tecidos vivos. Eles causar o que ele chamou de efeitos 'incomuns' em quem os transporta, e seus ovos pode matar lentamente uma pessoa de dentro prá fora. Eu devo procurar ajuda imediatamente, antes que seja tarde demais."
            },
            {
                "progress": 21,
                "logText": "Ulirfendor dise-me que um dos sacerdotes da Sombra deve ser capaz de me ajudar. Eu devo ir visitar Talião na capela em Loneford enquanto há tempo."
            },
            {
                "progress": 30,
                "logText": "Talião, em Loneford, disse-me que, para ser curado da minha doença, eu vou precisar lhe trazer quatro coisas. O que é necessário são cinco ossos, dois pedaços de pêlo, uma glândula de veneno Irdegh e um frasco vazio. Ossos e pele provavelmente podem ser encontrados em algum animal no deserto, e a glândula de veneno pode ser encontrada em um dos Irdeghs que foram vistos a leste."
            },
            {
                "progress": 40,
                "logText": "Eu trouxe os cinco ossos para Talião."
            },
            {
                "progress": 41,
                "logText": "eu trouxe os dois pedaços de pelo para Talião."
            },
            {
                "progress": 42,
                "logText": "Eu trouxe uma glândula de veneno Irdegh para Talião."
            },
            {
                "progress": 43,
                "logText": "Eu trouxe um frasco vazio para Talião."
            },
            {
                "progress": 45,
                "logText": "Eu já trouxe todas as peças que Talião precisa, a fim de curar-me destas coisas."
            },
            {
                "progress": 50,
                "logText": "Talião me curou-me dos vermes da podridão de Kazaul. Eu consegui colocar um dos vermes da podridão em um frasco vazio, e Talião disse-me que isso seria muito valioso. Eu não posso imaginar por quê.",
                "rewardExperience": 30000
            },
            {
                "progress": 51,
                "logText": "Por causa da minha antiga doença, Talião concordou em me ajudar, colocando bênçãos da Sombra em mim, sempre que eu quiser, por uma certa quantia.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "sisterfight",
        "name": "Uma diferença de opinião",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu ouvi uma história sobre duas irmãs briguentas em Remgard, Elwel e Elwyl. Aparentemente, elas têm mantido as pessoas acordadas durante a noite com a maneira como eles gritam umas com as outras. Eu devo ir visitá-las em sua casa na costa sul da cidade de Remgard."
            },
            {
                "progress": 20,
                "logText": "Eu conversei com Elwyl, uma das irmãs Elwille em Remgard. Ela está furiosa com a irmã por que ela não concorda mesmo com o mais simples dos fatos. Aparentemente, elas têm suas divergências uma com a outra ao longo de vários anos."
            },
            {
                "progress": 21,
                "logText": "Elwel não vai falar comigo."
            },
            {
                "progress": 30,
                "logText": "Uma questão que as irmãs discordam sobre atualmente é a cor de uma certa poção que o fabricante de porções da cidade Hjaldar costumava fazer. Elwyl diz que a poção de foco precisão que Hjaldar fazia era uma poção azul, mas Elwel insiste que a poção tinha uma coloração esverdeada."
            },
            {
                "progress": 31,
                "logText": "Elwyl quer que eu pegue uma poção de foco de precisão com Hjaldar, aqui em Remgard, para que ela possa finalmente mostrar a Elwel que ela está errada."
            },
            {
                "progress": 40,
                "logText": "Eu conversei com Hjaldar em Remgard. Hjaldar já não faz poções desde o seu fornecimento de extrato de medula de Lyson acabou."
            },
            {
                "progress": 41,
                "logText": "Aparentemente, Mazeg, um velho amigo de Hjaldar, certamente tem algum extrato de medula de Lyson para vender. Infelizmente, ele não sabe onde Mazeg vive atualmente. Ele só sabe que Mazeg viajou muito para o oeste, desde seu último encontro."
            },
            {
                "progress": 45,
                "logText": "Eu devo encontrar Mazeg e obter algum extrato de medula de Lyson para que Hjaldar possa começar a fazer poções novamente."
            },
            {
                "progress": 50,
                "logText": "Eu conversei com Mazeg no assentamento Montanha das Águas Negras. Ele está disposto a vender-me o extrato de medula Lyson por 800 moedas de ouro."
            },
            {
                "progress": 51,
                "logText": "Eu conversei com Mazeg no assentamento Montanha das Águas Negras. Como eu havia ajudado anteriormente as pessoas da Montanha das Águas Negras, ele está disposto a vender-me um frasco de extrato de medula de Lyson por apenas 400 moedas de ouro."
            },
            {
                "progress": 55,
                "logText": "Eu comprei de Marzeg o extrato de medula de Lyson. Eu devo voltar para Remgard e dar a Hjaldar."
            },
            {
                "progress": 60,
                "logText": "Hjaldar me agradeceu por trazê-lo o extrato de medula.",
                "rewardExperience": 15000
            },
            {
                "progress": 61,
                "logText": "Hjaldar agora pode criar poções de novo, e está disposto a vender-me. Ele até me deu algumas das primeiras poções que ele fez. Eu devo ir visitar as irmãs Elwille aqui em Remgard novamente, e mostrar-lhes uma poção de foco precisão."
            },
            {
                "progress": 70,
                "logText": "Eu dei uma poção de foco precisão para Elwyl."
            },
            {
                "progress": 71,
                "logText": "Infelizmente, não conseguir fazer a briga diminuir. Pelo contrário, elas parecem estar com mais raiva uma da outra agora, já que âmbas erraram a cor.",
                "rewardExperience": 9000,
                "finishesQuest": 1
            }
        ]
    }
]
