[
    {
        "id": "farrik",
        "name": "Visita noturna",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Farrik na corja de ladrões de Fallhaven contou-me sobre um plano para ajudar um colega de crimes a fugir da prisão Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Farrik na corja de ladrões de Fallhaven deu-me detalhes do plano, e eu aceitei a tarefa de ajudá-lo. O capitão da guarda, aparentemente, tem um problema com a bebida. O plano é que eu lhe dê uma dose de hidromel preparada pelo cozinheiro da corja dos ladrões que vai colocaro capitão da guarda para dormir na prisão. Pode ser necessário subornar o capitão da guarda.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "Peguei o hidromel preparado junto ao cozinheiro da corja dos ladrões.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Eu disse Farrik que eu não concordo totalmente com o seu plano. Eu poderia dizer o capitão da guarda sobre seu plano sombrio.",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "Eu dei o hidromel preparado para o capitão da guarda.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Eu disse ao capitão da guarda do plano que os ladrões têm para libertar o seu amigo.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "O capitão da guarda quer que eu diga os ladrões que a segurança será reduzida nessa noite. Poderíamos ser capazes de capturar alguns dos ladrões.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Consegui subornar o capitão da guarda a beber o hidromel preparado. Ele deve estar apagado durante a noite, permitindo que os ladrões para libertem seu amigo.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Farrik recompensou-me para ajudar a corja dos ladrões.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "Eu disse Farrik que a segurança será reduzido essa noite.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "O capitão da guarda agradeceu-me por ajudar seu plano para pegar os ladrões. Ele disse que também vai contar outros guardas que eu o ajudei.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "Uma porção perdida",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu devo encontrar um fabricante de poção chamado Lodar. Umar da corja dos ladrões de Fallhaven disse-me que eu que vou precisar de saber as palavras certas para passar por um guardião, a fim de alcançar o esconderijo de Lodar.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "Umar disse-me que eu devo ir ver alguém chamado Ogam em Vilegard. Ogam pode fornecer-me as palavras certas para alcançar o esconderijo de Lodar.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Eu visitei Ogam no sudoeste de Vilegard. Ele estava falando algo que pareciam enigmas. Eu mal pude conseguir alguns detalhes quando eu perguntei sobre refúgio de Lodar. 'A meio caminho entre a sombra e a luz. Formações rochosas.' E as palavras 'Brilho da Sombra' estavam entre as coisas que ele disse. Eu não sei o que isso quer dizer.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "vilegard",
        "name": "Confiando em um estrangeiro",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "O povo de Vilegard é muito desconfiado de estranhos. Disseram-me para ir ver Jolnor na capela de Vilegard se eu quiser ganhar a confiança deles.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Eu conversei com Jolnor na capela de Vilegard. Ele sugere que eu ajude três pessoas influentes, a fim de ganhar a confiança das pessoas em Vilegard. Eu devo ajudar Kaori, Wrye e o próprio Jolnor em Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Eu ajudei as três pessoas em Vilegard que Jolnor sugeriu. Agora o povo de Vilegard deve confiar mais em mim.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Recados de Kaori",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Jolnor da capela de Vilegard quer que eu fale com Kaori no norte de Vilegard, para ver se ela quer alguma ajuda.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Kaori no norte Vilegard quer que eu traga para ela 10 poções de farinha de osso.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Eu trouxe 10 porções de farinha de ossos para Kaori.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Causa incerta",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor da capela de Vilegard quer que eu fale com Wrye no norte de Vilegard. Ela aparentemente perdeu o filho recentemente.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Wrye no norte Vilegard me diz que seu filho Rincel desapareceu. Ela acha que ele morreu ou se encontra gravemente ferido.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Wrye me diz que ela acha que a guarda real de Feygard está envolvida em seu desaparecimento, e que ele foi recrutado pela guarda.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Wrye quer que eu vá em busca de pistas sobre o paradeiro de seu filho.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "Eu devo olhar na taverna de Vilegard e na taverna Foaming Flask, ao norte de Vilegard.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "Eu escutei que um menino esteve na taberna Foaming Flask tempos atrás. Aparentemente, ele deixou a taverna, dirigindo-se a algum lugar no oeste.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "Ao noroeste de Vilegard, eu encontrei um homem que tinha visto Rincel combater alguns monstros. Rincel aparentemente deixou Vilegard por sua própria vontade para conhecer a cidade de Feygard. Eu devo contar a Wrye no norte Vilegard o que aconteceu com seu filho.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Eu disse Wrye a verdade sobre o desaparecimento do filho dela.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Espiões em Foaming Flask",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor da capela de Vilegard contou-me sobre um guarda postado no lado de fora da taverna Foaming Flask. Ele acha que é um espião para a guarda real de Feygard. Ele quer que eu faça o guarda desaparecer, da forma que eu julgar melhor. A taberna fica ao norte de Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Eu convenci o guarda na porta da taberna Foaming Flask a sair após o fim de seu turno.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "Eu comecei uma briga com o guarda fora da taverna Foaming Flask. Eu devo levar o anel do guarda da guarda real de Feygard para Jolnor uma vez que ele esteja morto para mostrar Jolnor que ele desapareceu.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Eu disse Jolnor que o guarda se foi.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
