[
    {
        "id": "andor",
        "name": "Busca por Andor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Meu pai Mikhail diz que Andor não foi para casa desde ontem. Eu devo ir procurá-lo na aldeia.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Leonid diz-me que ele viu Andor falando Gruil. Eu devo ir perguntar Gruil se ele sabe mais.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Gruil quer que eu traga uma glândula de veneno. Então, ele talvez fale mais. Ele me diz que apenas algumas cobras venenosas tem tal glândula",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Gruil diz que Andor estava procurando alguém chamado Umar. Eu devo ir perguntar a seu amigo Gaela em Fallhaven para o leste",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Eu conversei com Gaela em Fallhaven. Ele me diz para ir ver Bucus e perguntar sobre a corja dos ladrões",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Bucus permitiu-me entrar no portal da casa abandonada em Fallhaven. Eu devo ir falar com Umar",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Umar da corja dos ladrões de Fallhaven reconheceu-me, mas deve ter me confundido com Andor. Aparentemente, Andor foi até lá para vê-lo",
                "finishesQuest": 0
            },
            {
                "progress": 55,
                "logText": "Umar disse-me que Andor foi ver um fabricante de poção chamada Lodar. Eu devo procurar seu esconderijo",
                "finishesQuest": 0
            },
            {
                "progress": 61,
                "logText": "Eu ouvi uma história em Loneford, onde parece que Andor esteve Loneford, e que ele pode ter algo a ver com a doença que as pessoas estão sofrendo de lá. Eu não tenho certeza se ele realmente era Andor. Se fosse Andor, por que ele teria feito o povo de Loneford doente?",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_bread",
        "name": "Pão para o Café da manhã",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Eu trouxe o pão para Mikhail.",
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail quer que eu vá comprar um pão de Mara na prefeitura.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_rats",
        "name": "Ratazanas!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Eu matei as duas ratazanas do nosso jardim.",
                "rewardExperience": 20,
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail quer que eu vá procurar por ratazanas no nosso jardim. Eu devo matar as ratazanas no nosso jardim e voltar para Mikhail. Se eu me machucar, eu posso voltar para a cama e descansar para recuperar minha saúde.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "leta",
        "name": "Marido sumido",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leta em Crossglen quer que eu procure por seu marido Oromir.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Eu descobri Oromir em Crossglen, escondendo-se de sua esposa Leta.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Eu disse Leta que Oromir está escondido na aldeia Crossglen.",
                "rewardExperience": 50,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "odair",
        "name": "Infestação de ratazanas",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Odair quer que eu limpe a caverna de abastecimento em Crossglen de ratazanas. Em particular, eu devo matar a ratazana grande e voltar para Odair.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ajudei Odair a exterminar as ratazanas da caverna de abastecimento em Crossglen.",
                "rewardExperience": 300,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bonemeal",
        "name": "Substâncias proibidas",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leonid na prefeitura de Crossglen disse-me que houve um distúrbio na vila há algumas semanas. Aparentemente, o Lorde Geomyr proibiu todo o uso de farinha de ossos como substância de cura\n\nTharal, o sacerdote da vila deve saber mais.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Tharal não quer falar sobre farinha de ossos. Eu poderia ser capaz de persuadi-lo, trazendo-lhe 5 asas de insetos.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Tharal me diz que farinha de ossos é uma substância de cura muito potente, e é muito ruim que não seja mais permitida. Eu devo ir ver Thoronir em Fallhaven se eu quiser saber mais. Devo dizer-lhe a senha 'Brilho da Sombra'.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Conversei com Thoronir em Fallhaven. Ele pode ser capaz de misturar-me uma poção de ossos se eu trazê-lo cinco ossos de esqueleto. Deve haver alguns esqueletos em uma casa abandonada ao norte de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Eu trouxe os ossos para Thoronir. Ele agora é capaz de fornecer-me porções de farinha de ossos\nEu devo ter cuidado ao usá-los, porém, visto que Lorde Geomyr proibiu seu uso.",
                "rewardExperience": 900,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jan",
        "name": "Amigos em queda",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jan me conta sua história, onde ele e seus dois amigos e Gandir Irogotu, entraram em um buraco para escavar um tesouro escondido, mas eles começaram a brigar e Irogotu matou Gandir em sua raiva \nEu devo trazer de volta Gandir o anel de Irogotu, e ver Jan quando o tiver.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Irogotu está morto. Eu trouxe a Jano anel de Gandir, and vingança sobre seu amigo.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bucus",
        "name": "Chave de Luthor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bucus em Fallhaven pode saber algo sobre Andor. Ele quer que eu traga-lhe a chave de Luthor das catacumbas da igreja de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "As catacumbas igreja Fallhaven estão fechadas. Athamyr é o único tanto com permissão e bravura para entrar neles. Eu pretendo ir vê-lo em sua casa ao sudoeste da igreja.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Athamyr quer que eu traga um pouco de carne cozida, então talvez ele vai falar mais.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Eu trouxe um pouco de carne cozida para Athamyr.",
                "rewardExperience": 700,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Athamyr me deu permissão para entrar nas catacumbas abaixo da igreja Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Eu trouxe Bucus a chave de Luthor.",
                "rewardExperience": 2150,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "fallhavendrunk",
        "name": "Estória de bêbado",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Um bêbado fora da taverna de Fallhaven começou a me contar sua história, mas quer que lhe traga algum hidromel. Apesar disso, eu não sei se a sua história vai levar a algum lugar.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "O bêbado disse-me que ele costumava viajar com Unnmir. Eu devo ir falar com Unnmir.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "calomyran",
        "name": "Segredos de Calomyran",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Um velho parado no meio de Fallhaven perdeu seu livro 'Segredos de Calomyran'. Ele pediu para eu procurar o livro. Talvez esteja na casa de Arcir ao sul?",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Encontrei uma página rasgada de um livro chamado 'Segredos de Calomyran' com o nome 'Larcal' escrito nele.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Eu retornei o livro de volta ao velho.",
                "rewardExperience": 600,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "nocmar",
        "name": "Tesouros perdidos",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Unnmir me disse que ele costumava ser um aventureiro, e me deu uma dica para ir ver Nocmar. Sua casa é a sudoeste da taverna de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Nocmar me dise que ele costumava ser um ferreiro. Mas o Lorde Geomyr proibiu o uso do Aço do Coração. Assim, ele não pode forjar mais suas armas\nSe eu puder encontrar uma Pedra do Coração e trazê-la para Nocmar, ele deve ser capaz de forjar com o Aço do Coração novamente.",
                "finishesQuest": 0
            },
            {
                "progress": 200,
                "logText": "Eu trouxe uma heartstone para Nocmar. Ele deve ter itens heartsteel disponíveis agora.",
                "rewardExperience": 1200,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "flagstone",
        "name": "Segredos antigos",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu conheci um sentinela do lado de fora de uma fortaleza chamada Flagstone. O guarda disse-me que Flagstone costumava ser um campo de prisioneiros para os trabalhadores fugitivos do Monte Galmore. Recentemente, tem havido um aumento de monstros saindo de Flagstone. Eu devo investigar a origem dos monstros mortos-vivos. O guarda disse-me para voltar a ele se eu precisar de ajuda.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Encontrei um tunel escavado em baixo de Flagstone que parece levar a uma caverna mais larga. A caverna é guardada por um demônio que não permite nenhuma aproximação. Talvez o sentinela fora de Flagstone saiba mais.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "O sentinela dise que o antigo diretor tinha um colar que ele sempre usava. O colar tem provavelmente as palavras necessárias para abordar o demônio. Eu devo mostrar para o guarda de decifrar qualquer mensagem sobre o colar, uma vez que eu o encontre.",
                "finishesQuest": 0
            },
            {
                "progress": 31,
                "logText": "Encontrei o antigo diretor de Flagstone no nível superior. Eu devo voltar para o guarda agora.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Aprendi as palavras necessárias para abordar o demônio no subsolo de de Flagstone: 'A Sombra da luz do dia'.",
                "rewardExperience": 1600,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Nas profundezas de Flagstrone, encontrei a fonte da infestação mortos-vivos: uma criatura nascida do sofrimento dos ex-prisioneiros de Flagstone.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Encontrei um prisioneiro, Narael, vivo nas profundezas Laje. Narael era uma vez um cidadão de Nor City. Ele está fraco demais para andar por si mesmo, mas se eu puder encontrar sua esposa em Nor City, eu provavelmente serei recompensado.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "vacor",
        "name": "Partes perdidas",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Um mago chamado Vacor no sudoeste Fallhaven vem tentando lançar um feitiço de ruptura.\nAparentemente, tem algo errado com ele, pois ele aparenta estar muito obsecado com seu feitiço. Está relacionado a ele ganhar um certo poder com isso.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Vacor quer que eu traga as quatro peças do feitiço que ele alega ter sido roubado dele. Os quatro bandidos deve estar em algum lugar ao sul de Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Eu trouxe as quatro peças do feitiço de ruptura para Vacor.",
                "rewardExperience": 1200,
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Vacor conta-me que seu ex-aprendiz Unzel tinha começado a questionar Vacor. Vacor agora quer que eu mate Unzel. Eu devo ser capaz de encontrá-lo no sudeste, fora dos limites de Fallhaven. Eu devo trazer o anel de Vacor qundo o matar.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Unzel dá-me a opção de ficar ao lado dele ou de Vacor.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Eu escolhi o lado de Unzel. Eu devo ir para sudoeste Fallhaven falar com Vacor sobre Unzel e a Sombra.",
                "finishesQuest": 0
            },
            {
                "progress": 53,
                "logText": "Começei uma luta com Unzel. Eu devo trazer seu anel a Vacor uma vez que ele esteja morto.",
                "finishesQuest": 0
            },
            {
                "progress": 54,
                "logText": "Começei uma luta com Vacor. Eu devo trazer seu anel a Unzel uma vez que ele esteja morto.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Eu matei Unzel e disse Vacor sobre a escritura.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            },
            {
                "progress": 61,
                "logText": "Eu matei Vacor e disse Unzel sobre a escritura.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            }
        ]
    }
]
