[
    {
        "id": "bwm_agent",
        "name": "O agente e a besta",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Eu conheci um homem em busca de ajuda para a sua colonia, a 'Montanha das Águas Negras'. Supostamente, sua colônia está sendo atacada por monstros e bandidos, e eles precisam de ajuda do exterior."
            },
            {
                "progress": 5,
                "logText": "Concordei em ajudar o homem e a Montanha das Águas negras a lidar com o problema."
            },
            {
                "progress": 10,
                "logText": "O homem disse-me para encontrá-lo do outro lado da mina que desabou. Ele vai rastejar através da mina e eu vou descer para a mina escura abandonada."
            },
            {
                "progress": 20,
                "logText": "Caminhei pela mina escura abandonada, e encontrei o homem no outro lado. Ele parecia muito ansioso, dizendo-me para ir direto para o leste, uma vez que eu saísse da mina. Eu devo encontrar o homem na base da montanha ao leste."
            },
            {
                "progress": 25,
                "logText": "Eu ouvi uma história sobre Prim e colônia da Montanha das Águas Negras estarem lutando uns contra os outros."
            },
            {
                "progress": 30,
                "logText": "Devo seguir o caminho ao longo da montanha até alcançar a colônia da Montanha das Águas Negras."
            },
            {
                "progress": 40,
                "logText": "Encontrei novamente o homem no meu caminho para a Montanha das Águas Negras. Devo seguir em frente até a montanha."
            },
            {
                "progress": 50,
                "logText": "Eu subi até as partes cobertas de neve da Montanha das Águas Negras. O homem disse-me para avançar na montanha. Aparentemente, a colônia da Montanha das Águas Negras está próximo."
            },
            {
                "progress": 60,
                "logText": "Alcancei a colônia da Montanha das Águas Negras. Eu devo encontrar e conversar com seu mestre batalha, Harlenn."
            },
            {
                "progress": 65,
                "logText": "Falei com Harlenn da colônia da Montanha das Águas Negras. Aparentemente, o assentamento está sob ataque de uma série de monstros, os dragões Aulaeth e dragões brancos. Mais que isso, eles estão sendo atacados pelo povo de Prim."
            },
            {
                "progress": 66,
                "logText": "Harlenn acha que as pessoas de Prim estão por trás dos ataques de monstro de alguma forma."
            },
            {
                "progress": 70,
                "logText": "Harlenn quer que eu deixe uma mensagem para Guthbered de Prim: Ou as pessoas de Prim param seus ataques à colônia da Montanha das Águas Negras, ou eles terão guerra. Eu devo falar com Guthbered em Prim."
            },
            {
                "progress": 80,
                "logText": "Guthbered nega que o povo de Prim tenha relação com os ataques de monstros no povoamento de Montanha das Águas Negras. Eu devo falar com Harlenn"
            },
            {
                "progress": 90,
                "logText": "Harlenn tem certeza de que o povo de Prim está por trás dos ataques de alguma forma."
            },
            {
                "progress": 95,
                "logText": "Harlenn quer que retorne a Prim e procure por sinais de que eles estão se preparando para um ataque à colônia. Eu devo procurar pistas ao redor de onde está Guthbered."
            },
            {
                "progress": 100,
                "logText": "Eu encontrei alguns planos em Prim para recrutar mercenários e atacar a colônia da Montanha das Águas Negras. Eu devo falar com Harlenn imediatamente."
            },
            {
                "progress": 110,
                "logText": "Harlenn agradeceu-me por investigar os planos de ataque.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Por conta dos planos para ataques à colônia da Montanha das Águas Negras, Harlenn quer que eu mate Guthbered em Prim."
            },
            {
                "progress": 130,
                "logText": "Eu iniciei a luta com com Guthbered."
            },
            {
                "progress": 131,
                "logText": "Eu disse Guthbered que foi enviado para matá-lo, mas eu iria deixá-lo viver. Ele agradeceu-me profundamente, e deixou Prim.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "Eu disse que Harlenn Guthbered se foi."
            },
            {
                "progress": 150,
                "logText": "Harlenn agradeceu-me pela ajuda prestada. Felizmente, os ataques contra a colônia da Montanha de Águas Negras devem parar agora.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "Ganhei a confiança da colônia da Montanha de Águas Negras. Todos os serviços devem estar disponíveis para eu usar.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Eu decidi não ajudar a colônia da Montanha de Águas Negras.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Desde que eu estou ajudando Prim, Harlenn não quer mais falar comigo.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Bem Descansado",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu conversei com o cozinheiro em Prim, na base da Montanha das Águas Negras. Há um quarto na pousada para alugar, mas está atualmente alugado para Arghest. Eu devo falar com Arghest para ver se ele ainda quer continuar alugando o quarto. O cozinheiro disse-me que o encontrarei a sudoeste de Prim."
            },
            {
                "progress": 20,
                "logText": "Eu conversei com Arghest sobre o quarto na pousada. Ele ainda está interessado em mantê-lo como uma opção para descanso. Mas ele me disse que provavelmente poderia ser persuadido a deixar-me usá-lo se eu o compensá-lo suficientemente."
            },
            {
                "progress": 30,
                "logText": "Arghest quer que eu lhe traga 5 garrafas de leite. Eu provavelmente poderei encontrar um pouco de leite em qualquer uma das aldeias maiores."
            },
            {
                "progress": 40,
                "logText": "Eu trouxe o leite para Arghest. Ele concordou em deixar-me usar o quarto na pousada Prim. Eu poderei finalmente descansar agora. Eu devo falar com o cozinheiro da pousada.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "Eu expliquei para o cozinheiro que eu tenho permissão de Arghest por usar o quarto de dormir.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Intenções obscuras",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Próximo à mina parcialmente soterrada, no caminho para a Montanha das Águas Negras, conheci um homem da aldeia de Prim. Ele pediu-me para ajudá-los."
            },
            {
                "progress": 11,
                "logText": "A aldeia de Prim necessita da ajuda de alguém de fora para lidar com ataques de alguns monstros. Eu devo falar com Guthbered em Prim a respeito dessa ajuda."
            },
            {
                "progress": 15,
                "logText": "Guthbered pode ser encontrado na prefeitura de Prim. Eu devo procurar uma casa de pedra ao centro da cidade."
            },
            {
                "progress": 20,
                "logText": "Eu Guthbered contou-me uma história sobre Prim. Prim esteve recentemente sob constante ataque do assentamento da Montanha das Águas Negras."
            },
            {
                "progress": 25,
                "logText": "Guthbered quer que eu vá até o assentamento no topo da Montanha das Águas Negras e perguntar a Harlenn, ministro da guerra, por que (ou se) eles têm convocado os monstros Gornaud contra Prim."
            },
            {
                "progress": 30,
                "logText": "Eu conversei com Harlenn sobre os ataques a Prim. Ele nega que as pessoas do assentamento da Montanha das Águas Negras tenha algo a ver com eles. Eu devo falar com Guthbered de Prim novamente."
            },
            {
                "progress": 40,
                "logText": "Guthbered ainda acredita que as pessoas no assentamento Águas Negras tenham algo a ver com os ataques."
            },
            {
                "progress": 50,
                "logText": "Guthbered quer que eu vá procurar por indícios de que as pessoas do assentamento da Montanha das Águas Negras estejam se preparando para um ataque em grande escala a Prim. Eu devo procurar pistas perto dos aposentos privados de Harlenn, certificanto-me que eu não seja visto."
            },
            {
                "progress": 60,
                "logText": "Eu encontrei alguns papéis em torno de aposentos privados do Harlenn delineando um plano para atacar Prim. Eu devo falar com Guthbered imediatamente."
            },
            {
                "progress": 70,
                "logText": "Guthbered me agradeceu por ajudá-lo a encontrar evidências dos planos para um ataque.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "A fim de por fim aos ataques à Prim, Guthbered quer que eu mate Harlenn no assentamento da Montanha das Águas Negras."
            },
            {
                "progress": 90,
                "logText": "Eu comecei uma briga com Harlenn."
            },
            {
                "progress": 91,
                "logText": "Eu disse que à Harlenn que fui enviado para matá-lo, mas eu vou deixá-lo viver. Ele agradeceu-me profundamente, e deixou o assentamento.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "Eu disse para Guthbered que Harlenn se foi."
            },
            {
                "progress": 100,
                "logText": "Guthbered me agradeceu pela ajuda que dei a Prim. Felizmente, os ataques a Prim devem parar agora. Como agradecimento, Guthbered me deu alguns itens e uma autorização forjada para que eu possa entrar na câmara interna-se no assentamento Montanha das Águas Negras.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "Eu mostrei a autorização forjada para a guarda e deixaram-me passar para a câmara interior."
            },
            {
                "progress": 240,
                "logText": "Agora que ganhei a confiança de Prim, todos os serviços devem estar disponíveis para eu usar.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Eu decidi não ajudar o povo do Prim.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Desde que eu estou ajudando o assentamento da Montanha das Águas Negras, Guthbered não quer mais falar comigo.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Luzes na escuridão",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "Eu consegui caminhar até a câmara interna no assentamento Montanha das Águas Negras e encontrei um grupo de magos liderados por um homem chamado Throdna."
            },
            {
                "progress": 9,
                "logText": "Throdna parece muito interessado em alguém (ou algo assim) chamado Kazaul, e em particular em um ritual realizado em seu nome."
            },
            {
                "progress": 10,
                "logText": "Eu concordei em ajudar Throdna a obter mais informações sobre o ritual, procurando por pedaços do ritual que, aparentemente, estão espalhadas por toda a montanha. Eu devo procurar as partes do ritual Kazaul no caminho de desce montanha a baixo até Prim."
            },
            {
                "progress": 11,
                "logText": "Eu preciso encontrar as duas partes do canto e os três pedaços que descrevem o ritual em si, e voltar ao Throdna uma vez que encontre tudo."
            },
            {
                "progress": 21,
                "logText": "Eu encontrei a primeira metade do canto para o ritual Kazaul."
            },
            {
                "progress": 22,
                "logText": "Eu encontrei a segunda metade do canto para o ritual Kazaul."
            },
            {
                "progress": 25,
                "logText": "Eu encontrei a primeira parte do ritual Kazaul."
            },
            {
                "progress": 26,
                "logText": "Eu encontrei a segunda parte do ritual Kazaul."
            },
            {
                "progress": 27,
                "logText": "Eu encontrei a terceira peça do ritual Kazaul."
            },
            {
                "progress": 30,
                "logText": "Throdna agradeceu-me para encontrar todas as partes do ritual.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna quer que eu ponha um fim o que esteja levando à ascensão de Kazaul que está acontecendo perto da Montanha das Águas Negras. Há um templo na base da montanha que eu devo investigar mais perto."
            },
            {
                "progress": 41,
                "logText": "Eu recebi um frasco de purificador de espírito que Throdna quere que eu aplique no santuário de Kazaul. Eu devo voltar para Throdna quando eu encontrar o santuário e o tiver purificado."
            },
            {
                "progress": 50,
                "logText": "No santuário na base da Montanha das Águas Negras, eu conheci um guardião de Kazaul. Ao recitar os versos do canto ritual, eu fui capaz de fazer o guardião me atacar."
            },
            {
                "progress": 60,
                "logText": "Eu purifiquei o santuário de Kazaul.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "Eu esperava ganhar algum tipo de retorno de Throdna por ajudá-lo a aprender mais sobre o ritual de purificação do santuário. Mas ele parece mais preocupado em divagar sobre Kazaul. Eu não ganho nenhum retorno com as suas divagações.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Sem fraqueza",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Herec, no segundo nível do assentamento da Montanha das Águas Negras está pesquisando sobre os dragões brancos fora do assentamento. Ele quer que eu o traga 5 garras de dragão branco para que ele possa continuar a sua pesquisa. Aparentemente, apenas alguns dos dragões tem essas garras. Vou ter que matar alguns para encontrá-las."
            },
            {
                "progress": 20,
                "logText": "Eu dei as cinco garras de dragões brancos para Herec."
            },
            {
                "progress": 30,
                "logText": "Herec acabou de fazer uma poção de restauração fadiga, que tornará muito útil lutar contra os dragões no futuro.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Acordando da letargia",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur de Prim, na base da Montanha das Águas Negras, pensa que alguma coisa tem perturbado o túmulo de seus pais, a sudoeste de Prim, fora da mina de Elm."
            },
            {
                "progress": 15,
                "logText": "Bjorgur quer que eu vá verificar o túmulo, e certifique-se punhal de sua família ainda esteja seguro no túmulo."
            },
            {
                "progress": 20,
                "logText": "Fulus em Prim está interessado em obter punhal Bjorgur da família que o avô de Bjorgur possuia."
            },
            {
                "progress": 30,
                "logText": "Eu conheci um homem que empunhava uma adaga de aparência estranha nas partes baixas de um túmulo a sudoeste de Prim. Ele deve ter roubado este punhal do túmulo."
            },
            {
                "progress": 40,
                "logText": "Eu coloquei o punhal de volta em seu lugar no túmulo. Estranhamente, os mortos-vivos inquietos parecem muito menos inquietos agora.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur agradeceu-me por minha ajuda. Ele me disse que eu devo também procurar seus parentes em Feygard.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "Eu disse a Fulus que eu ajudei Bjorgur a retornar a adaga família ao seu lugar original."
            },
            {
                "progress": 60,
                "logText": "Eu dei punhal Bjorgur da família para Fulus. Ele me agradeceu por trazê-lo a ele, e me recompensou generosamente.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
