[
    {
        "id": "remgard",
        "name": "Tudo em ordem",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Cheguei na ponte que dá acesso à cidade de Remgard. De acordo com o guarda da ponte, a cidade está fechada para estrangeiros, e ninguém está autorizado a sair. Eles estão investigando alguns desaparecimentos de alguns dos habitantes da cidade."
            },
            {
                "progress": 15,
                "logText": "Eu ofereci minha ajuda para ajudar o povo do Remgard a investigar o que aconteceu com os desaparecidos."
            },
            {
                "progress": 20,
                "logText": "O guarda da ponte, que pediu-me para investigar uma casa abandonada ao leste, ao longo da costa norte do lago. Eu devo ter cuidado com qualquer habitantes que possam estar lá."
            },
            {
                "progress": 30,
                "logText": "Eu relatei ao guarda da ponte que eu conheci Algangror na casa abandonada.",
                "rewardExperience": 3000
            },
            {
                "progress": 31,
                "logText": "Eu relatei ao guarda ponte que a casa abandonada estava vazia.",
                "rewardExperience": 3000
            },
            {
                "progress": 35,
                "logText": "Foi-me concedida a entrada em Remgard. Eu devo visitar Jhaeld, o ancião da cidade, para falar sobre o que o próximo passo devo dar. Jhaeld provavelmente pode ser encontrado na taberna no sudeste."
            },
            {
                "progress": 40,
                "logText": "Jhaeld foi bastante arrogante, mas me disse que eles tiveram alguns problemas com algumas pessoas que desapareceram recentemente. Ele não têm idéia do que pode ter causado isso."
            },
            {
                "progress": 50,
                "logText": "Devo visitar quatro pessoas em Remgard, e perguntar-lhes sobre quaisquer pistas a respeito do que pode ter acontecido com as pessoas desaparecidas."
            },
            {
                "progress": 51,
                "logText": "Primeiro é Norath, cuja esposa, Bethir, desapareceu. Norath pode ser encontrado na casa da fazenda a sudoeste."
            },
            {
                "progress": 52,
                "logText": "Em segundo lugar, eu devo ir falar com os Cavaleiros de Elythom, aqui na taverna."
            },
            {
                "progress": 53,
                "logText": "Em terceiro lugar, eu devo ir falar com a anciã Duaina em sua casa, ao sul."
            },
            {
                "progress": 54,
                "logText": "Por último, eu devo falar com Rothses, o armeiro. Ele mora no lado oeste da cidade."
            },
            {
                "progress": 59,
                "logText": "Eu tentei dizer a Jhaeld sobre Algangror, mas ele me dispensou fazend como se não tivess escutado."
            },
            {
                "progress": 61,
                "logText": "Eu conversei com Norath. Ele e sua esposa brigaram recentemente, mas ele não tem idéia do que pode ter acontecido com ela."
            },
            {
                "progress": 62,
                "logText": "Os Cavaleiros de Elythom na taberna Remgard disseram que um dos seus cavaleiros desapareceu recentemente. Ninguém notou nada quando ele desapareceu, no entanto."
            },
            {
                "progress": 63,
                "logText": "Duaina me viu em suas visões. Eu não entendi tudo o que ela falou, mas as partes que eram claras eram de que eu e Andor somos partes de um grande enredo. Eu me pergunto o que isso significa. Ela não falou de quaisquer pessoas desaparecidas, no entanto, não que eu pudesse entender o que ela fala, de qualquer forma."
            },
            {
                "progress": 64,
                "logText": "Rothses disse-me que Bethir a visitou na noite antes do desaparecimento, para vender alguns equipamentos. Ele não a viu para onde foi depois disso."
            },
            {
                "progress": 70,
                "logText": "Eu já falei com todas as pessoas Jhaeld ordenou que eu conversasse, mas não obteve qualquer informação de nenhum deles sobre o que poderia ter acontecido com as pessoas desaparecidas. Eu devo voltar para Jhaeld e perguntar quais são os próximos passos."
            },
            {
                "progress": 75,
                "logText": "Jhaeld estava realmente chateado que eu não consegui nada de novo com as pessoas às quais ele me enviou para conversar.",
                "rewardExperience": 15000
            },
            {
                "progress": 80,
                "logText": "Se eu ainda quero ajudar Jhaeld e as pessoas de Remgard, eu devo procurar pistas em outros lugares.",
                "finishesQuest": 1
            },
            {
                "progress": 110,
                "logText": "Jhaeld não quer falar comigo. Eu não vou ajudá-lo a descobrir o que aconteceu com as pessoas desaparecidas de Remgard.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "remgard2",
        "name": "O que é que o mau cheiro?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu disse a Jhaeld, o ancião da aldeia em Remgard, a respeito de uma mulher chamada Algangror, que vive na casa abandonada ao leste, ao longo da costa norte do lago próximo a Remgard."
            },
            {
                "progress": 20,
                "logText": "Jhaeld me disse que ele prefere não lidar com ela, já que ele acredita que ela é muito perigosa. Para o bem de seus guardas, ele não irá correr o risco de lutar contra ela, visto que ele está com medo do que poderia acontecer com todos eles."
            },
            {
                "progress": 21,
                "logText": "Se eu quero ajudar Jhaeld e as pessoas de Remgard, eu devo encontrar uma maneira de fazer Algangror desaparecer. Ele também adverte que eu seja extremamente cuidadoso."
            },
            {
                "progress": 30,
                "logText": "Algangror admitiu para mim que foi ela que fez algumas pessoas desaparecem de Remgard. No entanto, ela não quis me dizer o que aconteceu com eles."
            },
            {
                "progress": 35,
                "logText": "Eu comecei a atacar Algangror. Eu devo voltar para Jhaeld com a prova de sua derrota, após sua morte."
            },
            {
                "progress": 40,
                "logText": "Eu disse a Jhaeld que derrotei Algangror."
            },
            {
                "progress": 41,
                "logText": "Jhaeld ficou muito satisfeito ao ouvir a boa notícia. O povo de Remgard agora deve estar seguro, e da cidade pode ser aberta a estrangeiros novamente."
            },
            {
                "progress": 45,
                "logText": "Por ajudar o povo do Remgard a encontrar a causa das pessoas desaparecidas, Jhaeld aconselhou-me a procurar Rothses. Ele pode ser capaz de melhorar um pouco do meu equipamento.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 46,
                "logText": "Ervelyn, o alfaiate Remgard, deu-me um chapéu de penas como agradecimento por ajudar o povo do Remgard a descobrir o que aconteceu com as pessoas desaparecidas."
            }
        ]
    },
    {
        "id": "fiveidols",
        "name": "Os cinco ídolos",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Algangror quer que eu a ajude com uma tarefa. Ela não pode descrever a natureza da tarefa, ou a lógica por trás dela. Se eu ajudá-la, ela prometeu me dar seu colar encantado, que, aparentemente, vale muito."
            },
            {
                "progress": 20,
                "logText": "Eu concordei em ajudar Algangror com sua tarefa."
            },
            {
                "progress": 30,
                "logText": "Algangror quer que eu coloque cinco ídolos perto de cinco pessoas diferentes em Remgard. Os ídolos deve ser colocados perto dos leitos destas cinco pessoas, e devem estar escondidos de modo que eles não possam ser facilmente encontrados."
            },
            {
                "progress": 31,
                "logText": "A primeira pessoa é Jhaeld, o ancião da aldeia, que pode ser encontrado na taverna Remgard."
            },
            {
                "progress": 32,
                "logText": "Em segundo lugar, eu devo colocar um ídolo ao lado da cama de Larni, o agricultor, que vive em uma das cabines do norte em Remgard."
            },
            {
                "progress": 33,
                "logText": "A terceira pessoa é o fabricante de armas Arnal, que vive no noroeste de Remgard."
            },
            {
                "progress": 34,
                "logText": "A quarta é Emerei, que pode ser encontradp a sudeste de Remgard."
            },
            {
                "progress": 35,
                "logText": "A quinta pessoa é Carthe. Carthe vive na costa leste da Remgard, perto da taverna."
            },
            {
                "progress": 37,
                "logText": "Eu não deve contar a ninguém da minha tarefa, ou da colocação dos ídolos."
            },
            {
                "progress": 41,
                "logText": "Eu coloquei um ídolo na cama de Jhaeld."
            },
            {
                "progress": 42,
                "logText": "Eu coloquei um ídolo na cama do fazendeiro Larni."
            },
            {
                "progress": 43,
                "logText": "Eu coloquei um ídolo na cama de Arnal."
            },
            {
                "progress": 44,
                "logText": "Eu coloquei um ídolo na cama de Emerei."
            },
            {
                "progress": 45,
                "logText": "Eu coloquei um ídolo na cama de Carthe."
            },
            {
                "progress": 50,
                "logText": "Todos os ídolos foram colocados nas camas das pessoas que Algangror me disse para visitar. Eu devo voltar a ver Algangror."
            },
            {
                "progress": 51,
                "logText": "Algangror agradeceu-me por ajudá-la."
            },
            {
                "progress": 60,
                "logText": "Ela contou-me sua história, e como ela costumava viver na cidade, mas foi perseguida por suas crenças. Segundo ela, a perseguição foi totalmente injustificada, uma vez que ela não faz mal para as pessoas."
            },
            {
                "progress": 61,
                "logText": "Para vingar-se da cidade de Remgard, ela conseguiu atrair algumas pessoas para sua cabana e transformá-las em ratazanas."
            },
            {
                "progress": 70,
                "logText": "Por ajudá-la com as tarefas que ela não poderia realizar sozinha, Algangror me deu seu colar encantado, 'Marrowtaint'.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 100,
                "logText": "Eu decidi não ajudar Algangror com sua tarefa.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaverin",
        "name": "Velhos amigos?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Eu conheci Kaverin em Remgard, que, aparentemente, é um velho conhecido de Unzel, que vive próximo a Fallhaven."
            },
            {
                "progress": 20,
                "logText": "Kaverin quer que eu entrege uma mensagem para Unzel."
            },
            {
                "progress": 21,
                "logText": "Eu quis ajudar Kaverin.",
                "finishesQuest": 1
            },
            {
                "progress": 22,
                "logText": "Eu concordei em entregar a mensagem."
            },
            {
                "progress": 25,
                "logText": "Kaverin deu-me a mensagem de que ele quer que eu entregue a Unzel."
            },
            {
                "progress": 30,
                "logText": "Eu entreguei a mensagem a Unzel. Eu devo voltar para Kaverin em Remgard."
            },
            {
                "progress": 40,
                "logText": "Kaverin agradeceu-me por entregar a mensagem para Unzel.",
                "rewardExperience": 10000
            },
            {
                "progress": 45,
                "logText": "Em troca, Kaverin me deu um mapa antigo que tinha adquirido. Aparentemente, ele leva para o esconderijo antigo de Vacor."
            },
            {
                "progress": 60,
                "logText": "Kaverin ficou furioso com o fato de que eu matei Unzel, e ajudei Vacor. Ele começou a me atacar. Devo voltar para Vacor vez que Kaverin esteja morto."
            },
            {
                "progress": 70,
                "logText": "Kaverin estava carregando uma mensagem lacrada. Vacor reconheceu imediatamente o selo, e parecia muito interessado nele."
            },
            {
                "progress": 75,
                "logText": "Eu dei a Vacor a mensagem de que Kaverin estava carregando. Em troca, Vacor me deu um mapa antigo, que leva a seu antigo esconderijo.",
                "rewardExperience": 10000
            },
            {
                "progress": 90,
                "logText": "Eu devo tentar encontrar o esconderijo antigo de Vacor, na estrada para o oeste da antiga prisão de Flagstone, a sudoeste de Fallhaven."
            },
            {
                "progress": 100,
                "logText": "Eu encontrei o antigo esconderijo de Vacor.",
                "finishesQuest": 1
            }
        ]
    }
]
