[
    {
        "id": "andor",
        "name": "W poszukiwaniu Andora",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Mój ojciec Mikhail mówił, że Andora nie ma w domu od wczoraj. Powinienem go poszukać we wiosce.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Leonid wspomniał, że widział Andora rozmawiającego z Gruilem. Powinienem zapytać Gruila czy wie coś więcej.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Gruil chcę żebym mu przyniósł gruczoł jadowy. Wtedy może coś z niego wyciągne. Powiedział, że niektóre węże i żmije mają gruczoły jadowe.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Gruil powiedział, że Andor szukał kogoś zwanego Umarem. Powinenem pójść porozmawiać z jego przyjacielem Gaelem w Fallhaven na wschód stąd.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Rozmawiałem z Gaelem in Fallhaven. Mam pogadać z Bucusem i zapytać o gildię złodzieji.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Bucus pozwolił mi wejść do piwnicy opuszczonego domu w Fallhaven. Muszę pogadać z Umarem.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Umar mnie poznał, ale raczej pomylił mnie z bratem. Najwyraźniej Andor przyszedł się z nim zobaczyć.",
                "finishesQuest": 0
            },
            {
                "progress": 55,
                "logText": "Umar zdradził mi, że Andor poszedł do Lodara tworzyciela potków. Muszę znaleźć jego kryjówkę.",
                "finishesQuest": 0
            },
            {
                "progress": 61,
                "logText": "Słyszałem plotkę, w Loneford, według niej Andor był w Loneford i, że mógł mieć coś wspólnego z chorobą przez którą ludzie tu cierpią. Nie jestem do końca przekonany czy, aby na pewno był to Andor. Jeśli to był on, dlaczego pozwolił na to, by ludzie chorowali?",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_bread",
        "name": "Chleb na śniadanie",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Kupiłem chleb dla Mikhaila.",
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail chcę, żebym kupił chleb od Mary w centrum miasta.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_rats",
        "name": "Szczury!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Zabiłem te dwa szczury w ogrodzie.",
                "rewardExperience": 20,
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail chce, żebym sprawdził nasz ogród. Powinienem zabić te szczury i wrócić do Mikhaila. Jeśli zostane ranny, mogę wrócić do domu i odpocząć na łóżku, by odzyskać siły.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "leta",
        "name": "Zagubiony mąż",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leta w Crossglen chcę, abym poszukał Oromira.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Znalazłem Oromira, chował się przed żoną.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Powiedziałem Lecie, że Oromir chowa się przed nią.",
                "rewardExperience": 50,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "odair",
        "name": "Plaga szczurów",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Odair chcę, żebym oczyścił jaskinię z zapasami. Powinienem zabić tego największego szczura i wrócić do Odaira.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Pomogłem Odairowi oczyścić jaskinię ze szczurów we wiosce Crossglen.",
                "rewardExperience": 300,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bonemeal",
        "name": "Zakazana substancja",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leonid w Crossglen powiedział mi, że pare tygodni temu była tu awantura. Lord Geomyr całkowicie zakazał używania napoju uzdrawiającego benomeal.\n\nTharal, miejscowy kapłan może wiedzieć więcej.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Tharal nie chce rozmawiać o bonemeal. Mogę go jednak przekonać jeśli przyniosę mu 5 skrzydeł insektów.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Tharal powiedział, że bonemeal to potężna substancja uzdrawiająca, widać strasznie go rozdrażniło, że jest zakazana. Powinienem pójść zobaczyć się z Thoronirem w Fallhaven jak chce się dowiedzieć więcej. Muszę mu powiedzieć hasło 'Blask Cieni'.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Rozmawiałem z Thoronirem w Fallhaven. Może przyrządzić napój bonemeal jeśli przyniosę mu 5 kości ze szkieletów. Powinienem znaleźć parę szkieletorów w opuszczonym domu na północ od Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Przyniosłem kości Thoronirowi. Teraz będę mógł się u niego zaopatrywać w potki bonemeal.\nMuszę jednak uważać używając ich, odkąd Lord Geomyr wydał dekret są zakazane.",
                "rewardExperience": 900,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jan",
        "name": "Upadły przyjaciel",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jan opowiedział mi historie, dwóch jego przyjaciół Gandir i Irogotu, zaczęło kopać w poszukiwaniu skarbu , ale zaczęli walczyć między sobą i Irogotu w szale zabił Gandira.\nMuszę zwrócić pierścień, który posiada Irogotu, i pogadać z Janem gdy już go odzyskam.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Irogotu nie żyje. Zaniosłem Janowi pierścień Gandira i pomściłem jego przyjaciela.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bucus",
        "name": "Klucz Luthor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bucus z Fallhaven może mieć informacje o Andorze. Chcę, żebym przyniósł klucz Luthor z katakumb pod kościołem w Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Katakumby pod kościołem są zamknięte. Athamyr to jedyna osoba, która może wejść do katakumb i jest na tyle odważna. Muszę się z nim zobaczyć w jego domu na południowy zachód od kościoła.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Athamyr chcę żebym przyniósł mu usmażony stek, wtedy może ze mną porozmawia.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Przyniosłem ten stek dla Athamyra.",
                "rewardExperience": 700,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Athamyr dał mi pozwolenie na wejście do katakumb.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Przyniosłem Bucusowi klucz Luthor.",
                "rewardExperience": 2150,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "fallhavendrunk",
        "name": "Pijacka opowieść",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Pijak zaczął mi opowiadać jakąś historię, ale chcę, żebym mu przyniósł więcej miodu. Nie jestem pewny czy ta historia do czegoś zmierza.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Pijak mówił, że swego czasu podróżował z Unnmirem. Powinienem porozmawiać z Unnmir.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "calomyran",
        "name": "Sekrety Calomyrana",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Staruszek w Fallhaven zgubił księge 'Sekrety Calomyrana'. Powininem jej poszukać. Może w domu Arcira na południu?",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Znalazłem kawałek urwanej strony 'Sekrety Calomyrana' z imieniem 'Larcal' na niej napisanym.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Oddałem staruszkowi księge.",
                "rewardExperience": 600,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "nocmar",
        "name": "Zagubione skarby",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Unnmir powiedział, że kiedyś był podróżnikiem, i dał mi wskazówkę, żeby zobaczyć się z Nocmarem. Jego dom jest na południowy zachód od tawerny w Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Nocmar był kiedyś kowalem. Ale Lord Geomyr zakazał używania serca stali, więc nie może już tworzyć swojej broni.\nJeśli znajde kamienne serce i przyniosę je mu, znów mógłby tworzyć swoją broń.",
                "finishesQuest": 0
            },
            {
                "progress": 200,
                "logText": "Przyniosłem kamienne serce Nocmarowi. Powinien teraz móc tworzyć przedmioty z serca stali.",
                "rewardExperience": 1200,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "flagstone",
        "name": "Starożytne sekrety",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Spotkałem wartownika przed fortecą zwaną Flagstone. Wartownik powiedział mi, że Flagstone było kiedyś więzieniem dla uciekających pracowników na górze Galmore. Coraz częsciej pojawiały się tam nieumarli. Powinienem zbadać źródło pojawiania się tych nieumarłych. Strażnik powiedział, że mogę się do niego zwracać o pomoc.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Znalazłem tunel, kopany pod Flagstone, prowadzący do jakiejś większej jaskini. Jaskini pilnuje jakiś demon do którego nawet nie mogę się zbliżyć. Może ten strażnik wie coś więcej?",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Strażnik wspomniał, że były naczelnik miał naszyjnik, którego nigdy nie zdejmował. Pewnie na tym naszyjniku są słowa dzięki którym mógłbym przejść przez tego demona. Muszę wrócić do tego strażnika, żeby odczytał słowa na tym naszyjniku jak go znajde.",
                "finishesQuest": 0
            },
            {
                "progress": 31,
                "logText": "Znalazłem byłego naczelnika Flagstone na wyższym piętrze. Powinienem był wrócić teraz do tego naczelnika.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Znam już słowa, które pomogą mi przejść przez tego demona pod Flagstone. 'Świt cieni'.",
                "rewardExperience": 1600,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Głęboko pod Flagstone, znalazłem źródło nieumarłych. Kreature stworzoną z cierpienia więźniów Flagstone.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Znalazłem więźnia, Narael, żył głęboko pod Flagstone. Narael był kiedyś mieszkańcem Nor City. Jest zbyt słaby, żeby mógł chodzić o własnych nogach, ale jeśli znajdę jego żonę w Nor City, zostanie mi to wynagrodzone.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "vacor",
        "name": "Brakujące elementy",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Mag zwany Vacor w połudiowo zachodnim Fallhaven próbował rozszczepić jakieś zaklęcie.\nCoś było z nim nie tak, miał obsesję na tym zaklęciu. Jakby coś od niego brało moc.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Vacor chcę, abym przyniósł mu cztery elementy zaklęcia, które jak zapewnia zostały mu ukradzione. Ci czterej bandyci powinni być gdzieś na południe od Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Przyniosłem mu te cztery części zaklęcia.",
                "rewardExperience": 1200,
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Vacor mówił mi o jego byłym uczniu Unzel, który zadawł za dużo pytań. Vacor chce, żebym zabił Unzela. Mogę go znaleźć w południowo zachodnim Fallhaven. Mam mu przynieść jego sygnet, gdy już go zabije.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Unzel dał mi wybór albo pomogę Vacorowi albo jemu.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Wybrałem stronę Unzela. Powinienem pójść na południowy zachód Fallhaven, żeby porozmawiać z Vacorem o Unzelu i Cieniu.",
                "finishesQuest": 0
            },
            {
                "progress": 53,
                "logText": "Zacząłem walczyć z Unzelem. Muszę przynieść sygnet Vacorowi skoro Unzel już jest martwy.",
                "finishesQuest": 0
            },
            {
                "progress": 54,
                "logText": "Zacząłem walczyć z Vacorem. Muszę przynieść sygnet Unzelowi skoro Vacor już jest martwy.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Zabiłem Unzel i powiedziałem Vacorowi o jego czynach.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            },
            {
                "progress": 61,
                "logText": "Zabiłem Vacor i powiedziałem Unzelowi o jego czynach.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            }
        ]
    }
]
