[
    {
        "id": "erinith",
        "name": "Głębokie Rany",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Północny wschód od Crossglen village, poznałem Erinith w jego obozie. Najwyraźniej został zaatakowany zeszłej nocy i stracił księge."
            },
            {
                "progress": 20,
                "logText": "Zgodziłem się pomóc Erinith. Wspomniał, że wyrzucił ją gdzieś w drzewa na północ stąd."
            },
            {
                "progress": 21,
                "logText": "Zgodziłem się pomóc Erinith za 200 złotych monet. Wspomniał, że wyrzucił ją gdzieś w drzewa na północ stąd."
            },
            {
                "progress": 30,
                "logText": "Zwróciłem księge Erinith.",
                "rewardExperience": 2000
            },
            {
                "progress": 31,
                "logText": "Potrzebuje też pomocy z raną, która mu się nie goi. Albo przyniosę mu większą potke zdrowia, lub cztery normalne potki zdrowia."
            },
            {
                "progress": 40,
                "logText": "Dałem Erinith potkę bonemeal. Był lekko przestraszony używając ją odkąd zakazali jej przez Lorda Geomyra."
            },
            {
                "progress": 41,
                "logText": "Dałem Erinith większą potkę, żeby uleczył swoje rany."
            },
            {
                "progress": 42,
                "logText": "Dałem Erinith cztery normalne potki, żeby uleczył swoje rany."
            },
            {
                "progress": 50,
                "logText": "Rany się całkowicie zagoiły i Erinith mi podziękował za pomoc.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "hadracor",
        "name": "Zdewastowane ziemie",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na drodze do wieży Carn, zachód od rozdroży, Spotkałem grupę drwali, którym przewodził Hadracor. Hadracor chcę, żeby mu pomóc się zemścić na osach które atakują drwali, gdy ci chcą ścinać drzewa. Żeby im pomóc w tej zemście, powinienem poszukać olbrzymich os w ich siedlisku i przynieść co najmniej 5 dużych skrzydeł."
            },
            {
                "progress": 20,
                "logText": "Przyniosłem pięć dużych skrzydeł Hadracorowi."
            },
            {
                "progress": 21,
                "logText": "Przyniosłem sześć dużych skrzydeł Hardcorowemu. Za pomoc, dał mi parę rękawiczek."
            },
            {
                "progress": 30,
                "logText": "Hadracor podziękował za pomoc z resztą drwali za zemste na osach. W dowód wdzięczności pozwolił ze sobą handlować.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "tinlyn",
        "name": "Zagubiona owieczka",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "W drodze do Feygard, koło mostku, spotkałem pasterza Tinlyna. Tinlyn powiedział mi, że zagubiły mu się cztery owieczki, ale nie zostawi reszty stada, żeby je poszukać."
            },
            {
                "progress": 15,
                "logText": "I have agreed to help Tinlyn find his four lost sheep."
            },
            {
                "progress": 20,
                "logText": "Znalazłem jedną z zagubionych owiec Tinlyna."
            },
            {
                "progress": 21,
                "logText": "Znalazłem jedną z zagubionych owiec Tinlyna."
            },
            {
                "progress": 22,
                "logText": "Znalazłem jedną z zagubionych owiec Tinlyna."
            },
            {
                "progress": 23,
                "logText": "Znalazłem jedną z zagubionych owiec Tinlyna."
            },
            {
                "progress": 25,
                "logText": "Znalazłem wszystkie cztery owieczki."
            },
            {
                "progress": 30,
                "logText": "Tinlyn podziękował mi za znalezienie owieczek.",
                "rewardExperience": 3500,
                "finishesQuest": 1
            },
            {
                "progress": 31,
                "logText": "Tinlyn podziękował mi za znalezienie owieczek, ale nie ma dla mnie żadnej nagrody.",
                "rewardExperience": 2000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Zaatakowałem przynajmniej jedną z owieczek i nie mogę już oddać mu wszystkich czterech.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "benbyr",
        "name": "Tanie Cięcia",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Spotkałem Benbyra przed strażnicą. Chcę się zemścić na koledze 'partnerze biznesowym' - Tinlyn. Benbyr chcę zabić wszystkie jego owieczki."
            },
            {
                "progress": 20,
                "logText": "Zgodziłem się pomóc Benbyrowi zabić wszystkie jego osiem owieczek. Powinienem ich poszukać na północnym zachodzie stąd."
            },
            {
                "progress": 21,
                "logText": "Zacząłem zarzynać jego owce. Wrócę do Benbyra, gdy zabije wszystkie osiem owiec."
            },
            {
                "progress": 30,
                "logText": "Benbyr był wstrząśnięty słysząc, że wszystkie jego owce są zarżnięte.",
                "rewardExperience": 5200,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Odmówiłem pomocy w zabiciu owiec.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "rogorn",
        "name": "Droga czysta",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Minarra w wieży na rozdrożach Crossroads widziała bandę łotrów zmierzających na zachód. Minarra była pewna, że odpowiadali oni opisowi poszukiwanych za, których wyznaczono nagrody przez Feygardski patrol. Jeśli to są ludzie o których wspominała Minarra, ich liderem jest bezwzględny i dziki bandzior zwany Rogorn."
            },
            {
                "progress": 20,
                "logText": "Pomagam Minarrze znaleźć bandę tych łotrów. Powinienem iść drogą na zachód od tej wieży i poszukać ich. Prawdopodobnie to oni ukradli trzy słynne obrazy i są posądzeni o inne zbrodnie."
            },
            {
                "progress": 21,
                "logText": "Minarra wspomniała także, żeby nie ufać w ani jedno ich słowo. Właściwie wszystko powiedziane przez Rogorna powinno traktować się bardzo podejrzliwie."
            },
            {
                "progress": 30,
                "logText": "Znalazłem bandę bandytów na zachodniej drodze, prowadzoną przez Rogorna."
            },
            {
                "progress": 35,
                "logText": "Rogorn powiedział mi, że jest niesłusznie oskarżony o ukradnięcie obrazów oraz morderstwa, a oni wcale nawet nie byli w Feygardzie."
            },
            {
                "progress": 40,
                "logText": "Zdecydowałem się zaatakować Rogorna i jego bandziorów. Powinienem wrócić do Minarry, gdy już się z nimi rozprawie."
            },
            {
                "progress": 45,
                "logText": "Zdecydowałem się zaatakować Rogornai jego bandziorów, ale zamiast raportować o tym Minnarze powiem jej, że musiała się pomylić, bo to nie był Rogorn."
            },
            {
                "progress": 50,
                "logText": "Minarra podziękowała mi za rozprawienie się z tymi złodziejami i że moje uczynki będą docenione."
            },
            {
                "progress": 55,
                "logText": "Kiedy powiedziałem Minarrze, że musiała go pomylić z kimś innym, stała się nieco podejrzliwa, ale podziękowała za pomoc w tej sprawie."
            },
            {
                "progress": 60,
                "logText": "Pomogłem Minnarze w jej zadaniu.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "feygard_shipment",
        "name": "Sprawy Feygard",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Spotkałem Gandorena, kapitana straży przy strażnicy na rozdrożach. Powiedział mi o problemach w Loneford, przez które jego straże muszą się mieć bardziej na baczności niż zwykle. Przez co nie mogą zająć sie swoimi sprawami, a muszą pełnić służbę."
            },
            {
                "progress": 20,
                "logText": "Gandoren chcę, abym mu pomógł w dostawie 10 żelaznych mieczy do innego posterunku na południu."
            },
            {
                "progress": 21,
                "logText": "Zgodziłem się pomóc Gandorenowi w transporcie dostawy, jako przysługę dla Feygard."
            },
            {
                "progress": 22,
                "logText": "Niechętnie, ale zgodziłem się w transportowaniu dostawy."
            },
            {
                "progress": 25,
                "logText": "Muszę dostarczyć paczkę broni do kapitana patrolu stacjonującego w Spienionym Kuflu."
            },
            {
                "progress": 26,
                "logText": "Gandoren powiedział, że Ailshara wyrażała zainteresowanie dostawą i kazał mi się trzymać od niej z daleka."
            },
            {
                "progress": 30,
                "logText": "Ailshara rzeczywiście się interesuje tą dostawą, i chce, żebym jednak pomógł Nor City."
            },
            {
                "progress": 35,
                "logText": "Jeśli chcę pomóc Ailsharze w Nor City, powinienem dostarczyć towar do kowala w Vilegard."
            },
            {
                "progress": 50,
                "logText": "Dostarczyłem towar kapitanowi w  tawernie we Feygardzie . Powinienem porozmawiać z Gandorenem, że towar został już dostarczony."
            },
            {
                "progress": 55,
                "logText": "Dostarczyłem towar do kowala w Vilegard."
            },
            {
                "progress": 56,
                "logText": "Kowal w Vilegard dał mi w zamian paczkę zużytej broni, którą mam zanieść kapitanowi straży w tawernie w Feygard zamiast tych normalnych."
            },
            {
                "progress": 60,
                "logText": "Zaniosłem zużytą broń do kapitana w tawernie w Feygard. Powinienem powiedzieć Gandorenowi, że dostarczyłem towar na miejsce."
            },
            {
                "progress": 80,
                "logText": "Gandoren podziękował mi za pomoc z dostawą.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            },
            {
                "progress": 81,
                "logText": "Gandoren podziękował mi za pomoc z dostawą. Nawet nie był podejrzliwy. Muszę zameldować o dostarczeniu towaru Ailsharze."
            },
            {
                "progress": 82,
                "logText": "Zameldowałem się u Ailshary.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "loneford",
        "name": "Płynie w żyłach",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Słyszałem historię o Loneford. Większość tamtejszych ludzi jest chora, a niektórzy nawet umarli. Przyczyna jest nadal nieznana."
            },
            {
                "progress": 11,
                "logText": "Muszę przeprowadzić własne śledztwo co jest przyczyną tej dziwnej choroby. Powininenm porozmawiać z mieszkańcami Loneford i okolic, żeby dowiedzieć się więcej o sprawie."
            },
            {
                "progress": 21,
                "logText": "Strażnicy z wartowni są pewni, że choroba w Loneford to sabotaż za który odpowiedzialni są piraci i ludzie z Nor City."
            },
            {
                "progress": 22,
                "logText": "Niektórzy mieszkańcy Loneford wierzą, że to sprawka strażników z Loneford, w niektórych przypadkach ludzie cierpią bardziej niż wcześniej."
            },
            {
                "progress": 23,
                "logText": "Talion, kapłan z Loneford, uważa, że to kara Cienia, za brak wiary w niego."
            },
            {
                "progress": 24,
                "logText": "Taevinn w Loneford jest pewny, że Sienn w południowo wschodniej stodole ma coś wspólnego z tą chorobą. Najwyraźniej Sienn trzyma jakieś stworzenie, które parę razy stawało się niebezpieczne."
            },
            {
                "progress": 25,
                "logText": "Muszę zobaczyć się z Landą w tawernie Loneford. Plotki głoszą, że boi się czegoś powiedzieć."
            },
            {
                "progress": 30,
                "logText": "Landa mylił mnie z kimś początkowo. Widział jakiegoś chłopca niedaleko studni w nocy tuż przed pojawieniem się tej choroby. Bał mi się o tym powiedzieć na początku ponieważ myślał, że ten chłopiec go widział. Czy to mógł być Andor?"
            },
            {
                "progress": 31,
                "logText": "Tej nocy, której ten chłopiec był przy studni, widział także Bucetha pobierającego próbki wody ze studni. Dosyć dziwne, Buceth nie zachorował jak reszta mieszkańców wioski."
            },
            {
                "progress": 35,
                "logText": "Powinienem przesłuchać Bucetha w świątyni Loneford, co takiego robił przy studni i czy cokolwiek wie o Andorze."
            },
            {
                "progress": 41,
                "logText": "Przekupiłem Bucetha do rozmowy."
            },
            {
                "progress": 42,
                "logText": "Powiedziałem Bucethowi, że jestem gotów podążać ścieżką cieni."
            },
            {
                "progress": 45,
                "logText": "Buceth mówił, że jest przysłany przez innych kapłanów z Nor City, by się upewnić, że czary cieni odzyskają blask nad Loneford. Najwyraźniej ci kapłani przysłali też chłopca do jakiejś sprawy w Loneford, Buceth miał za zadanie pobrać próbki wody ze studni."
            },
            {
                "progress": 50,
                "logText": "Zaatakowałem Buceth. Powinienem przynieść jakiś dowód na to, że to sprawka Bucetha do Kuldana, kapitana straży w Loneford."
            },
            {
                "progress": 54,
                "logText": "Oddałem próbki Bucetha Kuldanowi, kapitanowi straży w Loneford."
            },
            {
                "progress": 55,
                "logText": "Kuldan był bardzo wdzięczny za rozwiązanie problemu choroby w Loneford. Zaczną przynosić wodę by pomoć Feygard zamiast pić ją ze studni. Kuldan powiedział, żebym zobaczył się z zarządcą Feygard jeśli chcę jeszcze pomóc.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Obiecałem trzymać historię Bucetha w tajemnicy. Jeśli Andor naprawdę tu był, musiał mieć bardzo ważny powód, że zrobił to co zrobił. Buceth powiedział,żebym porozmawiał z kustoszem w kaplicy Nor City jeśli chcę się nauczyć czegoś o cieniu.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            }
        ]
    }
]
