[
    {
        "id": "bwm_agent",
        "name": "Agent i Bestia",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Spotkałem człowieka szukającego pomocy dla osady, 'Góry Blackwater'. Nagle jego osada została zaatakowana przez potwory i bandytów i potrzebują pomocy z zewnątrz."
            },
            {
                "progress": 5,
                "logText": "Zgodziłem się pomóc temu człowiekowi i Górze Blackwater w rozprawieniu się z ich problemem."
            },
            {
                "progress": 10,
                "logText": "Ten człowiek powiedział, żebym spotkał się z nim po drugiej stronie zawalonej kopalni. On będzie się czołgać szybem, a ja zejdę w dół do ciemnej opuszconej kopalni."
            },
            {
                "progress": 20,
                "logText": "Udało mi się przejść przez tą ciemną opuszczoną kopalnie i spotkać tego człowieka po drugiej stronie. Wydawał się bardzo zaniepokojony, jak mówił mi, że gdy opuszczę kopalnie mam iść prosto na wschód. Powinenem spotkać tego człowieka u podnóży góry na wschodzie."
            },
            {
                "progress": 25,
                "logText": "Usłyszałem opowieść o Prim i Górze Blackwater osadach, które walczą przeciwko sobie."
            },
            {
                "progress": 30,
                "logText": "Powinienem podążać scieżką, która prowadzi do osady Blackwater."
            },
            {
                "progress": 40,
                "logText": "Znów spotkałem tego człowieka w drodze na szczyt. Powinienem kontynuuować moją wędrówkę w górę."
            },
            {
                "progress": 50,
                "logText": "Dotarłem na zaśnieżoną część Góry Blackwater. Ten człowiek znów powiedział, żebym szedł dalej w górę. Osada Blackwater jest już blisko."
            },
            {
                "progress": 60,
                "logText": "Dotarłem do osady Blackwater. Powinienem porozmawiać z ich mistrzem bitewnym, Harlennem."
            },
            {
                "progress": 65,
                "logText": "Rozmawiałem z Harlenn z Blackwater. Pozornie osada jest atakowana przez pewną liczbę potworów, yeti i białe smoki. Na dodatek są atakowani przez ludzi z Prim."
            },
            {
                "progress": 66,
                "logText": "Harlenn, uważa, że ludzie z Prim mają coś wspólnego z tymi atakami."
            },
            {
                "progress": 70,
                "logText": "Harlenn chce, abym przekazał wiadomość Guthberedowi z Prim. Albo oni skończą z atakami na Blackwater, albo my się nimi zajmiemy. Muszę porozmawiać z Guthberedem w Prim."
            },
            {
                "progress": 80,
                "logText": "Guthbered zaprzecze, że on i jego ludzie stoją za atakami na osadę Blackwater. Muszę pogadać z Harlennem"
            },
            {
                "progress": 90,
                "logText": "Harlenn jest pewny, że to oni stoją za atakami."
            },
            {
                "progress": 95,
                "logText": "Harlenn prosi, żebym znalazł jakieś dokumenty na to, jak i kiedy zaatakują ich wioskę. Powinienem poszukać wskazówek koło Guthbereda."
            },
            {
                "progress": 100,
                "logText": "Znalazłem plany o rekrutowaniu najemników i ataki na osadę Blackwater. Muszę natychmiast porozmawiać z Harlennem."
            },
            {
                "progress": 110,
                "logText": "Harlenn podziękował mi za te plany ataku.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Żeby zakończyć ataki na Blackwater, Harlenn chcę dokonać zamachu na Guthbereda."
            },
            {
                "progress": 130,
                "logText": "Zacząłem walczyć z Guthberedem."
            },
            {
                "progress": 131,
                "logText": "Powiedziałem Guthberedowi, że zostałem tu wysłany, żeby go zabić, ale pozwoliłem mu żyć. Był mi wdzięczny i opuścił Prim.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "Powiedziałem Harlennowi że Guthbereda nie ma."
            },
            {
                "progress": 150,
                "logText": "Harlenn podziękował mi za pomoc. Mam nadzieję, że ataki na osadę ustaną.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "Jestem teraz zaufaną osobą w Blackwater i wszyscy powinny być skorzy do sprzedaży przedmiotów.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Zdecydowałem się nie pomagać Blackwater.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Odkąd pomagam Prim, Harlenn nie chce już ze mną rozmawiać.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Dobrze wypoczęty",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Rozmawiałem z kucharką z Prim, u podnóża góry Blackwater. Jest tam pokój do wynajęcia, ale obecnie zajmowany przez Arghesta. Muszę z nim pogadać czy nadal będzie zajmował pokój. Kucharka wskazała mi południowy zachód od Prim."
            },
            {
                "progress": 20,
                "logText": "Rozmawiałem z Arghest o pokoju na zapleczu. Nadal jest nim zainteresowany ma gdzie wygodnie odpoczywać. Ale mógłby z niego zrezygnować jeśli mu to zrekompensuje."
            },
            {
                "progress": 30,
                "logText": "Arghest chcę, żebym przyniósł mu 5 butelek mleka. Prawdopodobnie znajdę mleko w większych wioskach."
            },
            {
                "progress": 40,
                "logText": "Kupiłem mleko dla Arghest. Zgodził się na użyczenie swojego łóżka. Naraszczie będę mógł odpocząć. Powinienem porazmawiać z kucharką.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "Wytłumaczyłem kucharce, że mam zgode od Arghesta na używanie pokoju.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Nieczyste intencje",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Tuż za zawaloną kopalnią, spotkałem człowieka z Prim. Błagał mnie o pomoc."
            },
            {
                "progress": 11,
                "logText": "Wioska Prim potrzebuje pomocy od kogoś z zewnątrz, żeby poradzić sobie z atakami potworów i bandytów. Powinienem porozmawiać z Guthberedem z Prim jeśli chcę im pomóc."
            },
            {
                "progress": 15,
                "logText": "Guthbered jest w ratuszu. To kamienny budynek w centrum miasta."
            },
            {
                "progress": 20,
                "logText": "Rozmawiałem z Guthberedem o Prim. Prim jest regularnie atakowane przez osadę Blackwater."
            },
            {
                "progress": 25,
                "logText": "Guthbered chcę, żebym poszedł na szczyt góry do Blackwater i zapytał ich mistrza bitewnego Harlenna (czy i dlaczego) przywołują golemy przeciwko Prim."
            },
            {
                "progress": 30,
                "logText": "Rozmawiałem z Harlennem o atakach na Prim. Zaprzeczył jakoby osada Blackwater miała cokolwiek z tym wspólnego. Muszę pogadać z Guthberedem w Prim."
            },
            {
                "progress": 40,
                "logText": "Guthbered nadal wierzy, że to oni stoją za atakami."
            },
            {
                "progress": 50,
                "logText": "Guthbered chcę, abym znalazł jakieś dokumenty o planie większego ataku na Prim. Powinienem poszukać tych dokumentów koło Harlenna i jego świty, ale żeby nikt mnie nie przyłapał."
            },
            {
                "progress": 60,
                "logText": "Znalazłem jakieś plany zawierające informacje o większym ataku na Prim. Muszę się rozmówić z Guthberedem niezwłocznie."
            },
            {
                "progress": 70,
                "logText": "Guthbered podziękował mi za pomoc w znalezieniu dowodu o atakach przez Blackwater.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "W celu zaprzestania tych ataków, Guthbered chce, abym zabił Harlenna w Blackwater."
            },
            {
                "progress": 90,
                "logText": "Zacząłem walczyć z Harlennem."
            },
            {
                "progress": 91,
                "logText": "Powiedziałem Harlennowi, że jestem tu po to by go zabić, ale pozwole mu żyć. Był mi bardzo wdzięczny i opuścił osadę.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "Powiedziałem Guthberedowi, że Harlenn nie stanowi już problemu."
            },
            {
                "progress": 100,
                "logText": "Guthbered podziękował mi za pomoc dla Prim. Miejmy nadzieję, że ataki ustąpią. Jako podziękowanie Guthbered dał mi parę przedmiotów i pozwolenie na wejście do świątyni w Blackwater.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "Pokazałem podrobione pozwolenie strażnikowi, który mnie przepuścił."
            },
            {
                "progress": 240,
                "logText": "Jestem teraz osobą zaufaną w Prim i wszystkie usługi powinny być teraz dla mnie odblokowane.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Zdecydowałem się nie pomagać Prim.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Odkąd pomagam Blackwater, Guthberedowi nie chcę już się ze mną gadać.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Światło w tunelu",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "Dostałem się do świątyni w Blackwater i znalazłem grupę magów prowadził ich człowiek o imieniu Throdna."
            },
            {
                "progress": 9,
                "logText": "Throdna wydawał się kimś bardzo zainteresowany (lub czymś) zwanym Kazaul, w szczególności rytułałem z udziałem jego imienia."
            },
            {
                "progress": 10,
                "logText": "Zgodziłem się pomóc Throdna znaleźć więcej informacji o rytuale poprzez znalezienie zagubionych kartek mówiących o szczególe rytuału. Powinienem poszukać tych zagubionych kartek po drodze w dół góry z Blackwater do Prim."
            },
            {
                "progress": 11,
                "logText": "Muszę znaleźć dwie strony śpiewnika i trzy strony opisujące sam rytuał, i wrócić do Throdna kiedy znajde je wszystkie."
            },
            {
                "progress": 21,
                "logText": "Znalazłem pierwszą część śpiewnika rytuału Kazuala."
            },
            {
                "progress": 22,
                "logText": "Znalazłem drugą część śpiewnika rytuału Kazuala."
            },
            {
                "progress": 25,
                "logText": "Znalazłem pierwszą część rytuału Kazuala."
            },
            {
                "progress": 26,
                "logText": "Znalazłem drugą część rytuału Kazuala."
            },
            {
                "progress": 27,
                "logText": "Znalazłem trzecią część rytuału Kazuala."
            },
            {
                "progress": 30,
                "logText": "Throdna podziękował mi za znalezienie wszystkich części.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna chcę położyć kres odradzania się Kazuali które zajęły miejscy u podnóży gór. U podnóża góry jest szczelina, którą należy zbadać."
            },
            {
                "progress": 41,
                "logText": "Dał mi fiolkę oczyszczania ducha, którą Throdna chcę, abym zastosował ją w ich sanktuarium. Powinienem wrócić do Throdna, gdy dotrę i użyje tej fiolki w sanktuarium."
            },
            {
                "progress": 50,
                "logText": "W sanktuarium u podnóży gór, spotkałem Kazuala strażnika. Dzięki recytowaniu rytuału, mogłem zmusić strażnika do zaatakowania mnie."
            },
            {
                "progress": 60,
                "logText": "Oczyściłem sanktuarium ze złych duchów.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "Oczekiwałem na jakąś specjalną nagrodę od Throdna za pomoc z rytuałem i oczyszczenie sanktuarium. Ale on bardziej był zajęty studiowaniem o Kazaulach. Nie mogłem zrozumieć nic sensownego.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Żadnej słabości",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Herec z drugiego piętra w osadzie Blackwater prowadzi badania nad białymi smokami. Chce, bym przyniósł mu 5 pazurów białych smoków, żeby mógł kontynuuować badania. Tylko niektóre smoki mają takie pazury. Będe musiał zabić parę rodzaji, żeby wiedzieć jakie to."
            },
            {
                "progress": 20,
                "logText": "Oddałem 5 pazurów dla Hereca."
            },
            {
                "progress": 30,
                "logText": "Herec skończył robić potke likwidującą zmęczenie, która będzie przydatna przy walce ze smokami w przyszłości.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Wybudzony z drzemki",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur w Prim uważa, że coś zakłóca spokój grobie jego rodziców, na południow zachód od Prim, tuż za kopalnią Elma."
            },
            {
                "progress": 15,
                "logText": "Bjorgur chcę, żebym sprawdził grób, i upewnić się, że jego rodzinny sztylet nadal leży bezpiecznie w grobowcu."
            },
            {
                "progress": 20,
                "logText": "Fulus z Prim zainteresował się wejściem w posiadanie rodzinnego sztyletu Bjorgura."
            },
            {
                "progress": 30,
                "logText": "Spotkałem człowieka, który miał przy sobie dziwnie wyglądający sztylet. Musiał ukraść ten sztylet z grobowca."
            },
            {
                "progress": 40,
                "logText": "Włożyłem sztylet z powrotem do grobowca. Niespokojni nieumarli są teraz bardziej spokojni, dziwnie spokojni.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur podziękował za pomoc. Powiedział, że powinienem poszukać też jego krewnych w Feygard.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "Powiedziałem Fulusowi, że pomogłem Bjorgurowi zwrócić jego sztylet na jego właściwe miejsce."
            },
            {
                "progress": 60,
                "logText": "Oddałem sztylet Fulusowi. Podziękował mi i wynagrodził sowicie.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
