[
    {
        "id": "toszylae",
        "name": "Przewoźnik Mimowoli",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Na drodze między Loneford a Brimhaven, Znalazłem wyschnięte jezioro z wielką jamą. Głęboko w jamie, natknąłem się na Ulirfendora - kapłana cieni z Brimhaven. Ulirfendor próbował przetłumaczyć inskrypcję ze świątyni Kazauli, i stwierdził, że jest tam coś o 'Mrocznym Obrońcy', ale nie jest pewny co to oznacza. Cokolwiek to oznacza, musi być powstrzymane."
            },
            {
                "progress": 11,
                "logText": "Ulirfendor potrzebuję pomocy z brakującymi elementami inskrypcji. Na inskrypcji pisze 'Kulauil hamar urum Kazaul'te', ale następna część jest kompletnie nie czytelna."
            },
            {
                "progress": 15,
                "logText": "Zgodziłem się pomóc Ulirfendorowi znaleźć brakujące części inskrypcji. Ulirfendor wierzy, że inskrypcjia jest o potężnej kreaturze, która żyje głęboko w podziemiach. Może to jest wskazówka gdzie mogą być pozostałe części."
            },
            {
                "progress": 20,
                "logText": "Głęboko w podziemiach, spotkałem promiennego opiekuna, strzeżącego kogoś. Opiekun wypowiedział frazy 'Kulauil hamar urum Kazaul'te. Kazaul hamat urul'. To musi być to czego szukał Ulirfendor. Powinienem wrócić do niego najszybciej jak się da."
            },
            {
                "progress": 21,
                "logText": "Próbowałem zaatakować opiekuna, ale nie mogłem go nawet sięgnąć. Jakaś potężna siła mnie powstrzymywała. Może Ulirfendor wie więcej."
            },
            {
                "progress": 30,
                "logText": "Ulirfendor był bardzo zadowolony, że znalazłem brakujące części inskrypcji.",
                "rewardExperience": 2000
            },
            {
                "progress": 32,
                "logText": "Powiedział mi także jak ona idzie dalej, ale nie wie co oznacza. Powinienem wrócić do opiekuna i powtórzyć słowa Ulirfendora."
            },
            {
                "progress": 42,
                "logText": "Powtórzyłem to opiekunowi.",
                "rewardExperience": 5000
            },
            {
                "progress": 45,
                "logText": "Opiekun zaśmiał się złowieszczo i zaatakował mnie."
            },
            {
                "progress": 50,
                "logText": "Pokonałem opiekuna i udało mi się dotrzeć do licza 'Toszylae'. Licz zdołał mnie czymś zainfekować. Muszę zabić tego licza i wrócić do Ulirfendor."
            },
            {
                "progress": 60,
                "logText": "Ulirfendor powiedział, że udało mu się przetłumaczyć części, które powiedziałem opiekunowi. Najwyraźniej to co powiedziałem brzmiało mniej więcej 'Moje ciało dla Kazaula'. Ulirfendor był bardzo zaniepokojony tym, co to oznacza dla mnie i żałował, że kazał mi powiedzieć te słowa opiekunowi."
            },
            {
                "progress": 70,
                "logText": "Ulirfendor ucieszył się gdy dowiedział, że zabiłem licza. Kiedy licz jest już martwy, ludzie w okolicy powinni być już bezpieczni.",
                "rewardExperience": 20000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "darkprotector",
        "name": "Mroczny Obrońca",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Znalazłem dziwnie wyglądający hełm z licza 'Toszylae' którego pokonałem. Muszę zapytać Ulirfendor czy wie coś więcej."
            },
            {
                "progress": 15,
                "logText": "Ulirfendor myśli że ten artefakt jest tym o czym mówi inskrypcja, i przyniesie nieszczęście wszystkim dookoła ktokolwiek będzie go nosił. Chcę, żebym go natychmiast zniszczył."
            },
            {
                "progress": 26,
                "logText": "Do zniszczenia artefaktu, będe musiał dać hełm i serce licza Ulirfendorowi."
            },
            {
                "progress": 30,
                "logText": "Oddałem hełm Ulirfendorowi."
            },
            {
                "progress": 31,
                "logText": "Oddałem serce licza Ulirfendorowi."
            },
            {
                "progress": 35,
                "logText": "Ulirfendor zniszczył artefakt. Wioski w okolicy powinny być już bezpieczne, przed nieszczęściami jakie ten hełm niósł ze sobą."
            },
            {
                "progress": 40,
                "logText": "Za pomoc z liczem i hełmem, Ulirfendor dał mi mroczne błogosławieństwo cieni.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 41,
                "logText": "Za pomoc z liczem i hełmem, Ulirfendor chciał mi dać mroczne błogosławieństwo cieni, ale odmówiłem.",
                "rewardExperience": 35000,
                "finishesQuest": 1
            },
            {
                "progress": 50,
                "logText": "Zdecydowałem zatrzymać hełm dla siebie. Kto wie jaką moc moge z niego uzyskać."
            },
            {
                "progress": 51,
                "logText": "Ulirfendor zaatakował mnie za zatrzymanie hełmu."
            },
            {
                "progress": 55,
                "logText": "Znalazłem księge obok Ulirfendora. Księga mówi o rytuale, który pozwala hełmowi uzyskać jego prawdziwą moc. Muszę wykonać rytuał w świątyni jeśli chcę używać hełmu."
            },
            {
                "progress": 60,
                "logText": "Zacząłem rytuał Kazauli."
            },
            {
                "progress": 65,
                "logText": "Umieściłem hełm z na przedzie świątyni."
            },
            {
                "progress": 66,
                "logText": "Umieściłem serce licza na przedzie świątyni."
            },
            {
                "progress": 70,
                "logText": "Rytuał zakończony, przywróciłem dawną moc hełmu.",
                "rewardExperience": 5000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "maggots",
        "name": "Mam to w sobie",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Głęboko w jaskini, walczyłem z liczem Kazauli. Jakoś zdołał mnie zainfekować czymś co zaczyna mi pełzać w brzuchu! Muszę znaleźć jakiś sposób na pozbycie się tego czegoś. Muszę porozmawiać z Ulirfendorem, albo poszukać pomocy w którejś ze świątyń na zewnątrz."
            },
            {
                "progress": 20,
                "logText": "Ulirfendor mówił mi, że czytał coś dawno temu o glizdach które żywią się na żywą tkanką. One są jak to nazwał 'niecodziennym' uczuciem dla tego kto ma go w sobie, jego jaja mogą powoli zabijać osobe od wewnątrz. Muszę znaleźć jak najszybciej pomoc zanim będzie za późno."
            },
            {
                "progress": 21,
                "logText": "Ulirfendor mowił, że jeden z kapłanów cieni powinen być w stanie mi pomóc. Powinienem odwiedzić Taliona w świątyni w Loneford natychmiast."
            },
            {
                "progress": 30,
                "logText": "Talion w Loneford powiedział mi, że aby się wyleczyć z mojej niedoli, Muszę znaleźć cztery części. Tymi częściami są pięć kości, dwie sierści zwierzęce, jeden gruczoł jadowy Irdegh i jedna pusta fiolka. Kości i sierść znajdę w dziczy, gruczoł jadowy powienien być w jednym z Irdeghs, które występują na wschodie."
            },
            {
                "progress": 40,
                "logText": "Przyniosłem pięć kości Talionowi."
            },
            {
                "progress": 41,
                "logText": "Przyniosłem zwierzęcą sierść Talionowi."
            },
            {
                "progress": 42,
                "logText": "Przyniosłem gruczoł jadowy Talionowi."
            },
            {
                "progress": 43,
                "logText": "Przyniosłem pustą fiolkę Talionowi."
            },
            {
                "progress": 45,
                "logText": "Przyniosłem już wszystkie potrzebne części Talionowi potrzebne do antidotum."
            },
            {
                "progress": 50,
                "logText": "Talion uleczył mnie z tej glizdy Kazaula. Udało mi się go złapać we fiolkę, Talion mówi, że jest bardzo cenna. Ciekawe po co to komu.",
                "rewardExperience": 30000
            },
            {
                "progress": 51,
                "logText": "Ze względu na moją wcześniejszą przypadłość, Talion zgodził się udzielić mi błogosławieństwa cieni, gdy tylko będe chciał oczywiście za opłatą.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "sisterfight",
        "name": "Różnica zdań",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Słyszałem historię o pewnych kłócących się siostrach w Remgard, Elwel i Elwyl. Najwyraźniej budzą wszystkich w nocy, gdy się na siebie drą. Powinienem odwiedzić ich dom na południowym brzegu miasta Remgard."
            },
            {
                "progress": 20,
                "logText": "Rozmawiałem z Elwylją, jedną z sióstr w Remgard. Jest wściekła na swoją siostrę za zaprzeczaniu nawet najbardziej oczywistym faktom. Wygląda na to, że ich kłótnie trwać mogły nawet parę lat."
            },
            {
                "progress": 21,
                "logText": "Elwel się do mnie nie odzywa."
            },
            {
                "progress": 30,
                "logText": "Nie zgadzają się w jednej sprawie, co do koloru pewnego eliksiru, który Hjaldar zazwyczaj wytwarza. Elwyl twierdzi, że eliksir do poprawy celności, który tworzy Hjaldar jest niebieski, a według Elwel jest to zielona substancja."
            },
            {
                "progress": 31,
                "logText": "Elwyl wants me to get a potion of accuracy focus from Hjaldar here in Remgard so that she can finally prove to Elwel that she is wrong."
            },
            {
                "progress": 40,
                "logText": "Rozmawiałem z Hjaldarem w Remgard. Hjaldar nie tworzy już eliksirów od kiedy zapasy ekstraktu szpiku Lysona się skończyły."
            },
            {
                "progress": 41,
                "logText": "Wygląda na to, że stary przyjaciel Hjaldera, Mazeg na pewno ma jakiś szpik na sprzedaż. Niestety, nie bardzo wie gdzie Mazeg aktualnie mieszka. Wie tylko, że Mazego podróżował daleko na zachód, kiedy się ostatni raz widzieli."
            },
            {
                "progress": 45,
                "logText": "Muszę znaleźć Mazega i zdobyć trochę szpiku Lysona, żeby Hjaldar znów mógł tworzyć eliksiry."
            },
            {
                "progress": 50,
                "logText": "Rozmawiałem z Mazegiem w Blackwater. Odkąd pomogłem ludziom z tej osady, będzie rad sprzedać mi szpik po promocyjnej cenie 400 złota."
            },
            {
                "progress": 51,
                "logText": "Rozmawiałem z Mazegiem w Blackwater. będzie rad sprzedać mi szpik w cenie 800 złota."
            },
            {
                "progress": 55,
                "logText": "Kupiłem szpik od Mazega. Powinienem wrócić i dać szpik Hjaldarowi."
            },
            {
                "progress": 60,
                "logText": "Hjaldar był wdzięczny za przyniesienie szpiku.",
                "rewardExperience": 15000
            },
            {
                "progress": 61,
                "logText": "Hjaldar znów może tworzyć eliksiry, i będzie chciał się z nimi podzielić odpłatnie. Podarował mi nawet parę z jego pierwszych eliksirów. Powinienem odwiedzić siostry Elwille w Remgard, i pokazać im eliksir celności."
            },
            {
                "progress": 70,
                "logText": "Dałem eliksir celności Elwyl."
            },
            {
                "progress": 71,
                "logText": "Niestety, nie pomogło to w zakończeniu ich kłótni. Przeciwinie są teraz na siebie jeszcze bardziej wściekłe , od kiedy się wydało, że obie były w błędzie.",
                "rewardExperience": 9000,
                "finishesQuest": 1
            }
        ]
    }
]
