[
    {
        "id": "remgard",
        "name": "Wszystko w porządku",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Dotarłem do miasta Remgard. Według tego co mówił strażnik mostu, miasto jest zamknięte dla przyjezdnych i nikt nie może go opuścić. Prowadzą śledztwo w sprawie zaginionych ludzi z miasta."
            },
            {
                "progress": 15,
                "logText": "Zaoferowałem swoją pomoc ludziom z Remgard w śledztwie i w rozwikłaniu zagadki co sie stało z tymi ludźmi."
            },
            {
                "progress": 20,
                "logText": "Strażnik na moście poprosił mnie o zbadanie opuszczonego domu na wschód wzdłuż północnego brzegu jeziora. Powinienem uważać na nieproszonych gości, których mogę tam spotkać."
            },
            {
                "progress": 30,
                "logText": "Zdałem raport strażnikowi mostu, że poznałem Algangrora w opuszczonym domu.",
                "rewardExperience": 3000
            },
            {
                "progress": 31,
                "logText": "Zdałem raport strażnikowi mostu, że nikogo nie było w opuszczonym domu.",
                "rewardExperience": 3000
            },
            {
                "progress": 35,
                "logText": "Pozwolono mi wejść do Remgard. Muszę spotkać się z Jhaeldem, ze starszym miasta, aby porozmawiać o naszym kolejnym kroku. Jhaeld możliwe, że będzie w tawernie na południowym-wschodzie."
            },
            {
                "progress": 40,
                "logText": "Jhaeld był dość arogancki, ale powiedział, że od jakiegoś czasu mają ten problem ze znikającymi ludźmi. Nie mają zielonego pojęcia kto lub co za tym stoi."
            },
            {
                "progress": 50,
                "logText": "Muszę porozmawiać z mieszkańcami Remgard, żeby zapytać czy są może jakieś wskazówki na to dlaczego znikają ludzie."
            },
            {
                "progress": 51,
                "logText": "Pierwszym będzie Norath, którego żona Bethir zniknęła. Norath mieszka na farmie na południowym-zachodzie."
            },
            {
                "progress": 52,
                "logText": "Drugimi, z którymi muszę porozmawiać będą rycerze Elythom w miejscowej tawernie."
            },
            {
                "progress": 53,
                "logText": "Trzecią, będzie starsza kobieta Duaina w swoim domu na południu."
            },
            {
                "progress": 54,
                "logText": "Ostatnim, będzie Rothses, płatnerz. Mieszka na zachodzniej części miasta."
            },
            {
                "progress": 59,
                "logText": "Próbowałem powiedzieć Jhaeldowi o Algangror, ale udawał, że mnie nie słyszy."
            },
            {
                "progress": 61,
                "logText": "Rozmawiałem z Norath. On i jego żona się ostatnio pobili, ale on nie ma pojęcia gdzie ona się podziała."
            },
            {
                "progress": 62,
                "logText": "Rycerzom Elythoma w tawernie Remgard ostatnio zaginęła jedna osoba. Nikt nic nie zauważył."
            },
            {
                "progress": 63,
                "logText": "Duaina widziała mnie w swoich wizjach. Nie zrozumiałem wszystkiego co mówiła, ale niektóre zdania były jasne ja i Andor jesteśmy częścią czegoś większego. Ciekawe co to znaczy? Nic nie wspomniała jednak o znikających ludziach, nic przynajmniej tak nie brzmiało."
            },
            {
                "progress": 64,
                "logText": "Rothses powiedział mi, że Bethir odwiedziła go zeszłej nocy, gdy zaginęła, żeby sprzedać mu ekwipunek. Od tamtej pory już jej nie widział."
            },
            {
                "progress": 70,
                "logText": "Rozmawiałem już ze wszystkimi ludźmi z którymi chciał Jhaeld, ale niczego się od nich konkretnego nie dowiedziałem. Powinienem wrócić do Jhaeld i zapytać co planuje dalej."
            },
            {
                "progress": 75,
                "logText": "Jhaeld był wyraźnie zdenerwowany tym, że nie udało mi się dowiedzieć czegokolwiek od tych ludzi.",
                "rewardExperience": 15000
            },
            {
                "progress": 80,
                "logText": "Jeśli nadal chcę pomóc Jhaeld i mieszkańcom Remgard, powininem poszukać wskasówek gdzieś indziej.",
                "finishesQuest": 1
            },
            {
                "progress": 110,
                "logText": "Jhaeld nie chce ze mną rozmawiać. Nie pomogę mu dowiedzieć się co się dzieje z zaginionymi ludzi w Remgard.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "remgard2",
        "name": "Co tak cuchnie?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Powiedziałem Jhaeld, starszemu miasteczka Remgard, o kobiecie Algangror, która żyje w opuszczonym domu na wschodzie przy północnym brzegu Remgard."
            },
            {
                "progress": 20,
                "logText": "Jhaeld powiedział, że nie chce z nią mieć nic wspólnego, myśli, że jest niebezpieczna. W obawie o bezpieczeństwo strażników, nie zwróci się przeciw niej, boi się o to co może się stać im wszystkim."
            },
            {
                "progress": 21,
                "logText": "Jeśli chcę pomóc Jhaeld i mieszkańcom Remgard, Muszę znaleźć sposób, aby Algangror zniknęła. Uprzedził mnie, żebym był niezwykle ostrożny."
            },
            {
                "progress": 30,
                "logText": "Algangror przyznała się, że porwała paru mieszkańców Remgard. Jednak nie powie mi co się z nimi stało."
            },
            {
                "progress": 35,
                "logText": "Zaatakowałem Algangror. Powinienem wrócić do Jhaeld z dowodem na to że pokonałem Algangrorę."
            },
            {
                "progress": 40,
                "logText": "Powiedziałem Jhaeldowi, że zabiłem Algangrorę."
            },
            {
                "progress": 41,
                "logText": "Jhaeld ucieszył się słysząc dobre wieści. Mieszkańcy Remgard powinni być teraz bezpieczni, a miasto znów zostanie otwarte dla przybyszów."
            },
            {
                "progress": 45,
                "logText": "Za pomoc mieszkańcom Remgard w znalezieniu przyczyny znikania ludzi, Jhaeld powiedział, żebym porozmawiał z Rothses. Może będzie w stanie zaoferować lepszy ekwipunek.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 46,
                "logText": "Ervelyn, Remgardzki krawiec, dał mi kapelusz z piórem jako nagrode za uratowanie mieszkańców Remgard przed zaginięciami."
            }
        ]
    },
    {
        "id": "fiveidols",
        "name": "Pięciu idoli",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Algangror chcę, abym pomógł jej w pewnym zadaniu. Nie chciała jednak za dużo powiedzieć i dlaczego chce to zrobić. Jeśli jej pomogę, obiecała mi dać swój zaklęty naszyjnik po wykonaniu zadania, który pewnie jest sporo wart."
            },
            {
                "progress": 20,
                "logText": "Zgodziłem się pomóc Algangrori w jej zadaniu."
            },
            {
                "progress": 30,
                "logText": "Algangror chcę, żebym rozstawił pięć idoli koło pięciu różnych ludzi Remgard. Idole powinny być rozstawione przy łóżkach tak, aby nie było łatwo ich znaleźć."
            },
            {
                "progress": 31,
                "logText": "Pierwszą osobą jest Jhaeld, można go znaleźć w tawernie w Remgard."
            },
            {
                "progress": 32,
                "logText": "Drugą osobą, jest Larni farmer, żyje w północnej chacie w Remgard."
            },
            {
                "progress": 33,
                "logText": "Trzecią osobą jest Arnal kowal, żyje w północno-zachodnim Remgard."
            },
            {
                "progress": 34,
                "logText": "Czwartą jest Emerei, można go spotkać w południoo-wschodnim Remgard."
            },
            {
                "progress": 35,
                "logText": "Piątą osobą jest Carthe. Carthe jest na wschodnim wybrzeżu Remgard, koło tawerny."
            },
            {
                "progress": 37,
                "logText": "Nie mogę powiedzieć nikomu o moim zadaniu, albo miejscu ułożenia idoli."
            },
            {
                "progress": 41,
                "logText": "Podłożyłem idola obok łóżka Jhaelda."
            },
            {
                "progress": 42,
                "logText": "Podłożyłem idola obok łóżka Larni."
            },
            {
                "progress": 43,
                "logText": "Podłożyłem idola obok łóżka Arnal."
            },
            {
                "progress": 44,
                "logText": "Podłożyłem idola obok łóżka Emerei."
            },
            {
                "progress": 45,
                "logText": "Podłożyłem idola obok łóżka Carthe."
            },
            {
                "progress": 50,
                "logText": "Wszystkie idole pochowane u ludzi, których kazała mi odwiedzić Algangrora. Powinienem wrócić do Algangror."
            },
            {
                "progress": 51,
                "logText": "Algangror thanked me for helping her."
            },
            {
                "progress": 60,
                "logText": "Opowiedziała mi jak było za czasów gdy mieszkała w miasteczku, ale była prześladowana za swoje przekonania. Według niej zupełnie niesprawiedliwie, bo nic im nie zrobiła."
            },
            {
                "progress": 61,
                "logText": "Żeby się zemścić na mieszkańcach Remgard, zwabiła paru ludzi do chaty i zmieniła je w szczury."
            },
            {
                "progress": 70,
                "logText": "Za pomoc w zadaniu, którego sama by nie mogła wykonać, Algangror dała mi zaklęty naszyjnik, 'Marrowtaint'.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 100,
                "logText": "Zdecydowałem się jej nie pomagać.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaverin",
        "name": "Starzy znajomi?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Spotkałem Kaverin w Remgard, najwyraźniej starego znajomego Unzela, który żyje w okolicach Fallhaven."
            },
            {
                "progress": 20,
                "logText": "Kaverin chce, żebym dostarczył wiadomość do Unzela."
            },
            {
                "progress": 21,
                "logText": "Odmówiłem Kaverinowi.",
                "finishesQuest": 1
            },
            {
                "progress": 22,
                "logText": "Zgodziłem się dostarczyć wiadomość."
            },
            {
                "progress": 25,
                "logText": "Kaverin dał mi list, który muszę dostarczyć Unzelowi."
            },
            {
                "progress": 30,
                "logText": "Dostarczyłem wiadomość do Unzela. Powinienem wrócić do Kaverin w Remgard."
            },
            {
                "progress": 40,
                "logText": "Kaverin był wdzięczny za transport.",
                "rewardExperience": 10000
            },
            {
                "progress": 45,
                "logText": "W zamian, Kaverin dał mi starą mapę. Najwidoczniej prowadzi ona do kryjówki Vacora."
            },
            {
                "progress": 60,
                "logText": "Kaverin był wściekły faktem że zabiłem Unzela, a pomogłem Vacorowi. Zaatakował mnie. Powinienem wrócić do Vacora, kiedy zabije Kaverina."
            },
            {
                "progress": 70,
                "logText": "Kaverin miał przy sobie zapieczętowaną wiadomość. Vacor natychmiast rozpoznał pieczęć i bardzo się nią zainteresował."
            },
            {
                "progress": 75,
                "logText": "Oddałem Vacorowi wiadomość Kaverina. W zamian, Vacor dał mi starą mapę do jego kryjówki.",
                "rewardExperience": 10000
            },
            {
                "progress": 90,
                "logText": "Powinienem znaleźć kryjówkę Vacora, na drodze na zachód od byłego więzienia Flagstone, południowy zachód Fallhaven."
            },
            {
                "progress": 100,
                "logText": "Znalazłem kryjówkę Vacora.",
                "finishesQuest": 1
            }
        ]
    }
]
