[
    {
        "id": "farrik",
        "name": "Nocna wizyta",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Farrik w gildii złodzieji powiedział mi o planie ucieczki jednego z ich więźniów.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Farrik w gildii złodzieji powiedział mi o szczegółach tego planu i zdecydowałem się mu pomóc. Kapitan straży ma problem z piciem. Plan jest taki, kucharz z gildii złodzieji przyrządzi specjalny miód, który powali z nóg kapitana straży. Możliwe, że będe musiał przekupić kapitana straży.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "Mam specjalny miód dla kapitana straży.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Powiedziałem Farrikowi, że nie do końca zgadzam się z jego planem. Mogę powiedzieć strażom o ich niecnym planie.",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "Dałem specjalny miód kapitanowi strażników.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Powiedziałem kapitanowi o planie uwolnienia ich więźnia przez gildie złodzieji.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Kapitan straży chcę, abym powiedział złodziejom, że dzisiejszej nocy strażników będzie mniej niż zwykle. Może uda nam sie złapać paru z nich.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Udało mi się przekupić kapitana, żeby wypił specjalny miód. Powinien być nie przytomny, aż do rana dzięki czemu będę mógł uwolnić więźnia.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Farrik wynagrodził mnie za pomoc gildii złodzieji.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "Powiedziałem Farrikowi, że strażników dzisiejszej nocy będzie mniej.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Kapitan strażników podziękował mi za wykonanie planu dzięki, któremu złapali złodzieji. Powie dobre słowo o mnie innym strażnikom.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "Zaginiona potka",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Powinienem znaleźć twórcę potków Lodara. Umar z gildii złodzieji powiedział mi, że będe musiał powiedzieć słowa w odpowiedniej kolejności jeśli chce dotrzeć do kryjówki Lodara.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "Umar mówił, że musze znaleźć Ogama w Vilegard. Ogam zna odpowiednie słowa, które pomogą mi dotrzeć do kryjówki Lodara.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Odwiedziłem Ogama w południowo zachodnim Vilegard. Mówił zagadkami. Ledwo wyłapałem jakieś szczegóły, kiedy zapytałem o kryjówkę Lodara. 'Między Cieniem, a Światłością. Skalne otoczenie.' i słowa 'Blask Cieni.' były zdaniami, które wtedy powiedział. Nie mam pojęcia co to znaczy.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "vilegard",
        "name": "Zaufać nieznajomemu",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Mieszkańcy Vilegard są bardzo podejrzliwi do ludzi z zewnątrz. Powiedziano mi, żebym się spotkał z Jolnorem w kaplicy Vilegard, jeśli chcę zyskać zaufanie.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Rozmawiałem z Jolnor w kaplicy Vilegard. Zasugerował, bym pomógł trzem ludziom w tej wiosce, żeby zyskać zaufanie reszty. Muszę pomóc Kaori, Wrye i Jolnorowi w Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Pomogłem wszystkim trzem. Teraz mieszkańcy Vilegard powinni mi ufać nieco bardziej.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Sprawy Kaori",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Jolnor z kaplicy Vilegard chciał, abym porozmawiał z Kaori w północnym Vilegard, żeby sprawdzić czy nie potrzebuje pomocy.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Kaori w północnym Vilegard chcę, żeby jej przynieść 10 potków bonemeal.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Przyniosłem 10 bonemeal dla Kaori.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Przyczyn może być wiele",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor z kaplicy Vilegard chce, abym porozmawiał z Wrye w północnym Vilegard. Jakiś czas tamu straciła syna.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Wrye w północnym Vilegard powiedziała, że jej syn Rincel zaginął. Domyśla się, że nie żyje, bądź jest ciężko ranny.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Wrye uważa, że królewscy strażnicy z Feygard są zamieszani w zaginięcie jej syna, możliwe, że wzięli go do wojska.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Wrye chcę, bym znalazł wskazówki co do tego co się stało z jej synem.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "Powinienem rozejrzeć się w tutejszej tawernie i w tawernie na północ stąd.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "Słyszałem o chłopcu, który jakiś czas temu był w tawernie spieniony kufel. Ale opuścił ją idąc na zachód.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "Na północnym zachodzie od Vilegard znalazłem człowieka, który z kolei znalazł Rincela walczącego z jakimiś potworami. Rincel opuścił Vilegard z własnej woli, żeby zobaczyć miasto Feygard. Muszę wrócić do Wrye w północnym Vilegard i powiedzieć jej co się stało z jej synem.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Powiedziałem Wrye prawdę o zaginięciu jej syna.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Szpiedzy w Spienionym",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor z kaplicy w Vilegard opowiedział o strażnikach przed tawerną spieniony kufel, według niego to królewscy szpiedzy z Feygard. Chcę, aby ten strażnik zniknął, obojętnie jakim sposobem. Ta tawerna jest na północ od Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Udało mi się przekonać strażnika o jego odejściu, gdy skończy się jego zmiana.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "Zacząłem walczyć ze strażnikiem. Powinienem przynieść pierścień królewskiego gwardzisty Jolnorowi, żeby mu udowodnić, że strażnika już nie ma.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Powiedziałem Jolnorowi, że strażnika już nie ma.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
