[
    {
        "id": "andor",
        "name": "Cerca Andor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Mio padre Mikhail dice che Andor non è a casa da ieri. Dovrei andare a cercarlo nel villaggio.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Leonid dice di aver visto Andor parlare con Gruil. Dovrei chiedere informazioni a Gruil.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Gruil vuole una ghiandola di veleno per darmi qualche informazione. Dice che alcuni serpenti velenosi la posseggono.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Gruil dice che Andor era alla ricerca di uno che si chiama Umar. Dovrei andare a chiedere al suo amico Gaela a est di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ho parlato con Gaela a Fallhaven. Mi ha detto di andare a trovare Bucus e chiedergli informazioni circa la gilda dei ladri.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Bucus mi ha permesso di entrare nella botola nella casa abbandonata a Fallhaven. Dovrei andare a parlare con Umar.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Umar della gilda dei ladri di Fallhaven sembrava conoscermi, deve avermi confuso con Andor. A quanto pare, Andor l'ha incontrato.",
                "finishesQuest": 0
            },
            {
                "progress": 55,
                "logText": "Umar mi ha detto che Andor è andato a cercare Lodar, l'alchimista. Dovrei cercare il suo rifugio.",
                "finishesQuest": 0
            },
            {
                "progress": 61,
                "logText": "I heard a story in Loneford, where it seemed like Andor had been in Loneford, and that he might have had something to do with the illness that the people are suffering from there. I am not sure if it actually was Andor. If it was Andor, why would he have made the people of Loneford ill?",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_bread",
        "name": "Pane per la colazione",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Ho portato il pane a Mikhail.",
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail vuole che vada a comprargli del pane da Mara al municipio.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_rats",
        "name": "Topi!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Ho ucciso i due ratti nel nostro giardino.",
                "rewardExperience": 20,
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Mikhail vuole che vada a controllare il nostro giardino per alcuni ratti. Devo uccidere i ratti e tornare da Mikhail. Se mi faccio male, posso tornare a letto e riposare per ripristinare la salute.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "leta",
        "name": "Marito scomparso",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leta del villaggio di Crossglen vuole che cerchi suo marito Oromir.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho trovato Oromir nel villaggio di Crossglen, si stava nascondendo da Leta.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho detto a Leta che Oromir si nasconde nel villaggio di Crossglen.",
                "rewardExperience": 50,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "odair",
        "name": "Infestazione di topi",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Odair mi chiede di pulire la grotta dall'invasione dei ratti. In particolare di uccidere il topo più grosso e poi tornare da lui.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho aiutato Odair ad eliminare i ratti nella grotta-magazzino al villaggio di Crossglen.",
                "rewardExperience": 300,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bonemeal",
        "name": "Sostanze vietate",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Leonid del municipio di Crossglen mi dice che c'era un problema in paese qualche settimana fa. A quanto pare, Lord Geomyr ha vietato qualsiasi uso di farine animali come sostanza di guarigione.\n\nTharal, il sacerdote della città dovrebbe saperne di più.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Tharal non vuole parlare di farina d'ossa. Potrei convincerlo portandogli 5 ali d'insetto.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Tharal dice che la farina d'ossa è molto potente come sostanza guaritrice, ed è abbastanza scocciato dal fatto che sia diventata illegale. Dovrei andare a vedere Thoronir a Fallhaven se voglio saperne di più. Dovrei dirgli la password 'Bagliore dell'Ombra'.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ho parlato con Thoronir a Fallhaven. Egli potrebbe creare una pozione di farina d'ossa se gli porto 5 ossa. Dovrebbero esserci alcuni scheletri in una casa abbandonata a nord di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho portato le ossa a Thoronir. Ora è in grado di preparare la pozione.\nPerò devo fare attenzione ad usarla, Lord Geomyr ne ha vietato l'uso.",
                "rewardExperience": 900,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jan",
        "name": "Amici di Fallen",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jan mi racconta la storia sua, di Gandir e Irogotu. I tre amici hanno scavato una miniera per cercare un tesoro, ma hanno litigato. Irogotu in preda alla rabbia ha ucciso Gandir, rubandogli un anello.\nDovrei prendere l'anello a Irogotu e riportarlo a Jan.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho portato l'anello di Gandir a Jan e vendicato il suo amico. Irogotu è morto.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bucus",
        "name": "Chiave di Luthor",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bucus a Fallhaven potrebbe sapere qualcosa di Andor. Ma vuole la chiave di Luthor che è nelle catacombe sotto la chiesa di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Le catacombe sotto la chiesa di Fallhaven sono chiuse. Athamyr è l'unico che ha sia il permesso che il coraggio di entrarvi. Dovrei andare a trovarlo nella sua casa a sud-ovest della chiesa.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Athamyr vuole un po' di carne cotta, e poi forse mi dirà qualcosa di più.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ho portato la carne cotta ad Athamyr.",
                "rewardExperience": 700,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Athamyr mi ha dato il permesso di entrare nelle catacombe sotto la chiesa Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho portato a Bucus la chiave di Luthor.",
                "rewardExperience": 2150,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "fallhavendrunk",
        "name": "Racconto dell'ubriaco",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un ubriaco fuori dalla taverna di Fallhaven ha iniziato a raccontarmi la sua storia, ma per continuare vuole che io gli porti dell'idromele. Non so se la sua storia porterà a qualcosa.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "L'ubriaco mi ha detto che aveva l'abitudine di viaggiare con Unnmir. Dovrei andare a parlare con Unnmir.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "calomyran",
        "name": "I segreti di Calomyran",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un vecchio di Fallhaven ha perso il suo libro 'Calomyran Secrets'. Dovrei andare a cercarlo. Forse nella casa di Arcir a sud?",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho trovato una pagina strappata da un libro intitolato 'Calomyran Secrets' con il nome di 'Larcal' scritto sopra.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Ho dato il libro al vecchio.",
                "rewardExperience": 600,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "nocmar",
        "name": "Tesori perduti",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Unnmir mi ha detto che era un avventuriero, e mi ha dato il suggerimento di andare a trovare Nocmar. La sua casa è a sud-ovest della taverna di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Nocmar mi dice di essere un fabbro. Ma Lord Geomyr ha vietato l'uso di Acciaio puro, così non può forgiare più le sue armi.\nSe riesco a trovare una Pietra pura e portargliela, dovrebbe essere in grado di forgiare il nuovo Acciaio puro!",
                "finishesQuest": 0
            },
            {
                "progress": 200,
                "logText": "Ho trovato una Pietra pura per Nocmar. Ora avrà degli oggetti di Acciaio puro da vendere.",
                "rewardExperience": 1200,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "flagstone",
        "name": "Antichi segreti",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ho incontrato una guardia all'esterno di una fortezza chiamata Flagstone. La guardia mi ha parlato di Flagstone dicendomi che esso era un campo di prigionia per i lavoratori in fuga dal Monte Galmore. Recentemente c'è stato un aumento di mostri non-morti che fuoriuscivano da Flagstone. Dovrei studiare l'origine dei mostri non-morti. La guardia mi dice di tornare a lui se ho bisogno di aiuto.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho trovato un tunnel scavato sotto Flagstone, che sembra portare a una grotta più grande. La grotta è sorvegliata da un demone a cui non sono nemmeno in grado di avvicinarmi. Forse la guardia fuori Flagstone ne sa di più?",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "La guardia mi dice che l'ex guardiano di Flagstone portava sempre una collana con se. La collana probabilmente contiene le informazioni per avvicinarsi al demone. Dovrei tornare dalla guardia per le informazioni della collana, una volta che l'avrò trovata.",
                "finishesQuest": 0
            },
            {
                "progress": 31,
                "logText": "Ho trovato l'ex guardiano di Flagstone, era al piano superiore.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ho imparato la formula per avvicinarmi al demone. 'Daylight Shadow'.",
                "rewardExperience": 1600,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Nei sotterranei di Flagstone, ho trovato la fonte di creazione dei non morti. Una creatura nata dal dolore degli ex prigionieri.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Ho trovato un prigioniero vivo, Narael, nei sotterranei di Flagstone. Narael una volta era un cittadino di Nor City. E' troppo debole per camminare, ma se riesco a trovare la moglie, in città, verrei ricompensato.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "vacor",
        "name": "Pezzi mancanti",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Un mago chiamato Vacor nel sud-ovest di Fallhaven ha cercato di lanciare un incantesimo di fenditura.\nC'è qualcosa che non va in lui, sembrava molto ossessionato dal suo incantesimo. Sta cercando di ottenere un qualche tipo di forza da esso.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Vacor vuole che io gli porti i quattro pezzi dell'incantesimo che gli è stato rubato. I banditi dovrebbero essere da qualche parte a sud di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ho portato i quattro pezzi dell'incantesimo a Vacor.",
                "rewardExperience": 1200,
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Vacor mi racconta del suo ex apprendista Unzel, che aveva iniziato a mettere in discussione Vacor. Vacor ora vuole uccidere Unzel. Dovrei essere in grado di trovarlo a sud-ovest, fuori di Fallhaven. Dovrei portare il suo anello con sigillo a Vacor una volta che l'ho ucciso.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Unzel mi dà la scelta di schierarmi con lui o con Vacor.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Ho scelto di schierarmi con Unzel. Dovrei andare a sud-ovest di Fallhaven a parlare con Vacor circa Unzel e l'Ombra.",
                "finishesQuest": 0
            },
            {
                "progress": 53,
                "logText": "Ho iniziato a lottare con Unzel. Vorrei portare il suo anello a Vacor una volta ucciso.",
                "finishesQuest": 0
            },
            {
                "progress": 54,
                "logText": "Ho iniziato a lottare con Vacor. Vorrei portare il suo anello a Unzel una volta ucciso.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Ho ucciso Unzel e ho informato Vacor.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            },
            {
                "progress": 61,
                "logText": "Ho ucciso Vacor e ho informato Unzel.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            }
        ]
    }
]
