[
    {
        "id": "bwm_agent",
        "name": "L'agente e la bestia",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Ho incontrato un uomo in cerca di aiuto per il suo insediamento sulla Montagna Blackwater. Sembra che l'insediamento sia attaccato da mostri e banditi, hanno bisogno di un aiuto esterno."
            },
            {
                "progress": 5,
                "logText": "Ho accettato di aiutare l'uomo dellla montagna di Blackwater."
            },
            {
                "progress": 10,
                "logText": "L'uomo mi ha detto di incontrarlo al di là della miniera crollata. Lui striscerà attraverso la miniera crollata e io passerò dalla buia miniera abbandonata."
            },
            {
                "progress": 20,
                "logText": "Ho attraversato la vecchia miniera e ho incontrato nuovamente l'uomo dall'altra parte. Sembrava molto preoccupato e mi ha dietto di andare verso est una volta uscito dalla miniera. Dovrei ritrovare l'uomo ai piedi della montagna."
            },
            {
                "progress": 25,
                "logText": "Ho sentito la storia del conflitto tra Prim e l'insediamento di Blackwater. "
            },
            {
                "progress": 30,
                "logText": "Dovrei seguire il sentiero di montagna per arrivare all'insediamento di Blackwater."
            },
            {
                "progress": 40,
                "logText": "Ho di nuovo ritrovato l'uomo sulla mia strada, mi ha detto di continuare lungo il sentiero per arrivare all'insediamento."
            },
            {
                "progress": 50,
                "logText": "Ho camminato fino alle pendici innevate del monte Blackwater. L'uomo mi ha detto di contunuare a salire la montagna. A quanto pare, l'insediamento è vicino."
            },
            {
                "progress": 60,
                "logText": "Sono dentro l'insediamento. Devo trovare e parlare con il loro maestro d'armi Harlenn."
            },
            {
                "progress": 65,
                "logText": "Ho parlato con Harlenn nell'insediamento di Blackwater. A quanto pare, l'insediamento è sotto attacco da ogni sorta di mostri: dragoni bianchi e Aulaeth. Oltre che da essi, a Blackwater sono attaccati anche dal popolo di Prim."
            },
            {
                "progress": 66,
                "logText": "Harlenn pensa che dietro gli attacchi dei mostri ci sia il popolo di Prim."
            },
            {
                "progress": 70,
                "logText": "Harlenn vuole che porti un messaggio a Guthbered di Prim. Vuole che Prim fermi gli attacchi contro l'insediamento di Blackwater altrimenti saranno costretti a combattere. Dovrei andare a parlare con Guthbered a Prim."
            },
            {
                "progress": 80,
                "logText": "Guthbered dice che Prim non ha nulla a che fare con gli attacchi dei mostri all'insediamento di Blackwater. Dovrei andare a parlare con Harlenn."
            },
            {
                "progress": 90,
                "logText": "Harlenn è sicuro che dietro gli attacchi dei mostri ci sia Prim."
            },
            {
                "progress": 95,
                "logText": "Harlenn vuole che vada a Prim a cercare indizi su un probabile attacco all'insediamento. Dovrei trovare degli indizi vicino a Guthbered."
            },
            {
                "progress": 100,
                "logText": "Ho trovato alcuni progetti a Prim per reclutare mercenari e attaccare l'insediamento di Blackwater. Dovrei andare immediatamente a parlarne con Harlenn."
            },
            {
                "progress": 110,
                "logText": "Harlenn mi ha ringraziato per aver scoperto i piani di attacco.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Per fermare gli attacchi all'insediamento di Blackwater, Harlenn mi ha chiesto di assassinare Guthbered a Prim."
            },
            {
                "progress": 130,
                "logText": "Ho iniziato un combattimento con Guthbered."
            },
            {
                "progress": 131,
                "logText": "Ho detto a Guthbered che avrei dovuto ucciderlo, ma l'ho lasciato vivere. Mi ha ringraziato profondamente e ha lasciato Prim.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "Harlenn mi ha ringraziato per l'aiuto. Speriamo che gli attacchi all'insediamento di Blackwater ora si fermino."
            },
            {
                "progress": 150,
                "logText": "Nell'insediamento di Blackwater ora si fidano di me, adesso dovrei poter comprare in tutti i negozi.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "Ho deciso di non aiutare la gente dell'insediamento di Blackwater.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Dal momento che sto aiutando Prim, Harlenn non vuole più parlare con me.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Dal momento che sto aiutando Prim, Harlenn non vuole più parlare con me.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Ben riposati",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ho parlato con l'oste di Prim, ai piedi della montagna Blackwater. C'è una stanza sul retro disponibile ma attualmente è affittata ad Arghest. Dovrei andare a parlare con Arghest per vedere se lui vuole tenere ancora in affitto la stanza. Il cuoco mi ha indirizzato verso sud-ovest di Prim."
            },
            {
                "progress": 20,
                "logText": "Ho parlato con Arghest per la stanza alla locanda. Vuole tenerla ancora in affitto per poter riposare. Mi ha detto che se riesco a dargli la giusta ricompensa potrebbe farlmela usare."
            },
            {
                "progress": 30,
                "logText": "Arghest mi ha chiesto 5 bottiglie di latte, dice che sicuramente posso trovarne in un villaggio più grande."
            },
            {
                "progress": 40,
                "logText": "Ho portato il latte ad Arghest. Ha accettato di farmi usare la stanza sul retro della locanda a Prim. Ora potrò riposarmi lì. Dovrei andare a parlare con l'oste nella locanda.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "Ho spiegato all'oste che Arghest mi ha dato il permesso di utilizzare la stanza.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Intenzioni offuscate",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Fuori dalla miniera crollata sulla strada per la montagna Blackwater ho incontrato un uomo del villaggio di Prim. Lui mi ha chiesto di aiutarli."
            },
            {
                "progress": 11,
                "logText": "Il paese di Prim ha bisogno aiuto da qualcuno di esterno che sicuramente non abbia nulla a che fare con gli attacchi dei mostri. Dovrei parlare con Guthbered a Prim se voglio aiutarli."
            },
            {
                "progress": 15,
                "logText": "Guthbered di solito sta nella sala principale di Prim. Devo cercare una casa di pietra al centro del paese."
            },
            {
                "progress": 20,
                "logText": "Guthbered mi ha raccontato la storia di Prim, ha detto che da un po' è costantemente sotto attacco da parte dell'insediamento di Blackwater."
            },
            {
                "progress": 25,
                "logText": "Guthbered vuole che vada all'insediamento di Blackwater a chiedere al loro maestro d'armi Harlenn, perché (o se) hanno reclutato i mostri Gornaud contro Prim."
            },
            {
                "progress": 30,
                "logText": "Ho parlato con Harlenn circa gli attacchi a Prim. Egli nega che la gente dell'insediamento di Blackwater abbia nulla a che farci. Dovrei tornare a riferirlo a Guthbered a Prim."
            },
            {
                "progress": 40,
                "logText": "Guthbered continua a credere che l'insediamento di Blackwater sia coinvolto negli attacchi."
            },
            {
                "progress": 50,
                "logText": "Guthbered vuole che vada a cercare indizi sul piano di attacco che l'insediamento di Blackwater sta preparando contro Prim. Dovrei andare a cercare degli indizi vicino agli alloggi privati di Harlenn, assicurandomi di non essere visto."
            },
            {
                "progress": 60,
                "logText": "Ho trovato alcuni giornali negli alloggi privati di Harlenn che illustrano un piano per attaccare Prim. Dovrei andare immediatamente a parlarne con Guthbered."
            },
            {
                "progress": 70,
                "logText": "Guthbered mi ha ringraziato per averlo aiutato a trovare le prove dei piani di un attacco.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "Al fine di far cessare gli attacchi a Prim, Guthbered vuole io uccida Harlenn nell'insediamento di Blackwater."
            },
            {
                "progress": 90,
                "logText": "Ho cominciato un combattimento con Harlenn."
            },
            {
                "progress": 91,
                "logText": "Ho detto ad Harlenn che sono stato inviato per ucciderlo, ma l'ho lasciato vivere. Mi ha profondamente ringraziato ed lasciato l'insediamento.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "Guthbered mi ha ringraziato per l'aiuto che ho dato a Prim. Speriamo che gli attacchi contro Prim ora cessino. Come ringraziamento, Guthbered mi ha dato alcuni oggetti e un permesso falso che può farmi entrare nella camera interna dell'insediamento di Blackwater."
            },
            {
                "progress": 100,
                "logText": "Ho mostrato il permesso falso alla guardia ed ho avuto accesso alla camera interna dell'insediamento.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "Ora a Prim tutti si fidano di me e mi lasciano comprare in tutti negozi."
            },
            {
                "progress": 240,
                "logText": "Ho deciso di non aiutare la gente di Prim.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Dal momento che sto aiutando l'insediamento di Blackwater, Guthbered non vuole più parlare con me.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Dal momento che sto aiutando l'insediamento di Blackwater, Guthbered non vuole più parlare con me.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Luce dell'Ombra",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "Sono andato nella camera interna dell'insediamento di Blackwater e ho trovato un gruppo di maghi guidati da un uomo di nome Throdna."
            },
            {
                "progress": 9,
                "logText": "Throdna sembra molto interessato a qualcuno (o qualcosa) chiamato Kazaul, e in particolare ad un rituale eseguito in suo nome."
            },
            {
                "progress": 10,
                "logText": "Ho accettato di aiutare Throdna a cercare informazioni sul rituale, esistono le istruzioni per il rituale su un foglio strappato sparso per la montagna. Dovrei andare a cercare le parti del rituale di Kazaul sul sentiero di Blackwater che porta a Prim."
            },
            {
                "progress": 11,
                "logText": "Ho bisogno di trovare le due parti del canto e i tre pezzi che descrivono il rituale stesso e tornare da Throdna una volta che li ho trovato tutti."
            },
            {
                "progress": 21,
                "logText": "Ho trovato la prima metà del canto per il rituale di Kazaul."
            },
            {
                "progress": 22,
                "logText": "Ho trovato la seconda metà del canto per il rituale di Kazaul."
            },
            {
                "progress": 25,
                "logText": "Ho trovato il primo pezzo del rituale di Kazaul."
            },
            {
                "progress": 26,
                "logText": "Ho trovato il secondo pezzo del rituale di Kazaul."
            },
            {
                "progress": 27,
                "logText": "Ho trovato il terzo pezzo del rituale di Kazaul."
            },
            {
                "progress": 30,
                "logText": "Throdna mi ha ringraziato per aver trovato tutti i pezzi del rituale.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna vuole che metta fine alla nascita delle uova di Kazaul che è cominciata sul monte Blackwater. C'è un santuario ai piedi del monte, dovrei andare a dargli un'occhiata."
            },
            {
                "progress": 41,
                "logText": "Mi è stata data una fiala di purificazione dello spirito che Throdna vuole applichi al santuario di Kazaul. Dovrei tornare da Throdna quando ho trovato e purificato il santuario."
            },
            {
                "progress": 50,
                "logText": "Nel santuario alla base della Montagna Blackwater ho incontrato il custode di Kazaul. Recitando i versi del canto rituale ho indotto il guardiano ad attaccarmi."
            },
            {
                "progress": 60,
                "logText": "Ho purificato il santuario di Kazaul.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "Mi aspettavo qualche riconoscimento da Throdna per averlo aiutato a conoscere il rituale e aver purificato il santuario. Ma sembrava più occupato a farneticare riguardo Kazaul. Non riuscivo a capire nulla dei suoi vaneggiamenti.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Nessuna debolezza",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Herec al secondo livello dell'insediamento di Blackwater è in cerca di dragoni bianchi. Vuole che gli porti 5 artigli di dragone bianco in modo che possa continuare la sua ricerca. A quanto pare, solo alcuni dei dragoni hanno questi artigli. Dovrò ucciderne alcuni per trovarli."
            },
            {
                "progress": 20,
                "logText": "Ho portato 5 artigli di dragone bianco a Herec."
            },
            {
                "progress": 30,
                "logText": "Herec ha finito di creare una pozione curativa che sarà molto utile in futuro per affrontare i dragoni.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Svegliato dal sonno",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur di Prim alla base del monte Blackwater pensa che qualcosa abbia disturbato la tomba dei suoi genitori a sud-ovest di Prim, appena fuori della miniera di Elm."
            },
            {
                "progress": 15,
                "logText": "Bjorgur vuole che vada a controllare la tomba per assicurarmi che il pugnale della sua famiglia sia ancora al suo posto."
            },
            {
                "progress": 20,
                "logText": "Fulus di Prim vuole avere il pugnale della famiglia di Bjorgur e che suo nonno usò per ottenere potere."
            },
            {
                "progress": 30,
                "logText": "Ho incontrato un uomo che brandiva un pugnale strano nei pressi di una tomba a sud-ovest di Prim. Deve aver rubato il pugnale dalla tomba."
            },
            {
                "progress": 40,
                "logText": "Ho rimesso il pugnale al suo posto nella tomba. I non-morti sembrano stranamente meno inquieti ora.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur mi ha ringraziato per l'assistenza. Mi ha detto che dovrei anche cercare i suoi parenti a Feygard per una ricompensa.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "Ho portato il pugnale della famiglia di Bjorgur a Fulus. Mi ha ringraziato calorosamente e mi ha ricompensato molto bene."
            },
            {
                "progress": 60,
                "logText": "Ho portato il pugnale della famiglia Bjorgur a Fulus. Lui mi ha ringraziato calorosamente e mi ha ricompensato molto bene.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
