[
    {
        "id": "farrik",
        "name": "Visite notturne",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Farrik della gilda dei ladri di Fallhaven mi ha raccontato di un piano per aiutare un loro compagno a fuggire dalla prigione di Fallhaven.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Farrik della gilda dei ladri di Fallhaven mi ha raccontato i dettagli del piano e ho accettato di aiutarlo. Il capitano della guardia ha un problema con l'alcol. Il piano si prefigura così: io dovrei offrire un idromele, preparato appositamente del cuoco della gilda dei ladri, al capitano in modo che lo metta fuori combattimento. Potrebbe essere necessario corrompere il capitano.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "Ho avuto l'idromele preparato dal cuoco della gilda dei ladri.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ho detto a Farrik che non sono molto d'accordo con il loro piano, potrei riferire al capitano della prigione il loro subdolo piano.",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "Ho dato l'idromele *truccato* al capitano della prigione.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ho detto al capitano della prigione del piano che i ladri stanno preparando per liberare il loro amico.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Il capitano mi chiede di raccontare ai ladri che per la sera la prigione sarà meno protetta! Così forse riusciranno a catturare un po' di quei ladri.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Sono riuscito a far bere l'idromele *truccato* al capitano! In questo modo dovrebbe essere fuori gioco durante la notte e i ladri riusciranno a liberare il loro compagno.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Farrik mi ha ricompensato per aver aiutato la gilda dei ladri.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "Ho detto a Farrik che stasera la prigione sarà meno protetta.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Il capitano della prigione mi ha ringraziato per l'aiuto e ha detto che parlera di me a tutte le altre guardie.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "La pozione persa",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Dovrei trovare un alchimista chiamato Lodar. Umar della gilda dei ladri di Fallhaven mi ha detto che devo conoscere la parola d'ordine affinchè il guardiano mi lasci avere accesso al rifugio di Lodar.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "Umar mi ha detto di parlare con Ogam a Vilegard. Ogam mi può dire la parola d'ordine per accedere al rifugio di Lodar.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Sono stato da Ogam a sud-ovest di Vilegard. parlava in modo strano, sembravano indovinelli. Sono riuscito a malapena a capire alcuni indizi parlando del rifugio di Lodar. La frase 'A metà strada tra l'Ombra e la luce. Formazioni rocciose' e le parole 'Bagliore dell'Ombra' erano tra le cose che ha detto. Non sono sicuro del loro significato.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "vilegard",
        "name": "Fidarsi di un forestiero",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "La gente di Vilegard è molto sospettosa verso i forestieri. Mi hanno detto di parlare con Jolnor nella cappella di Vilegard se voglio guadagnarmi la loro fiducia.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho parlato con Jolnor nella cappella di Vilegard. Egli suggerisce di aiutare tre persone importanti per ottenere la fiducia della gente di Vilegard. Dovrei aiutare Kaori, Wrye e Jolnor stesso.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ho aiutato le tre persone di Vilegard, ora tutto il paese si fida di me.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Commissioni per Kaori",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Jolnor della cappella di Vilegrad mi ha consigliato di parlare con Kaori a nord di Vilegard e di aiutarla.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Kaori mi ha chiesto di portarle 10 pozioni di farina d'ossa.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho portato 10 pozioni di farina d'ossa a Kaori.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Causa incerta",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor della cappela di Vilegard mi ha detto di parlare con Wrye a Nord di Vilegard. Suo figlio è da poco sparito nel nulla.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Wrye a Nord di Vilegard mi ha detto che suo figlio Rincel è scomparso, lei pensa che sia morto o ferito gravemente.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Wrye pensa che la guardia reale di Feygard sia coinvolta nella scomparsa di suo figlio e che lo abbiano reclutato.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Wrye vole andare alla ricerca di indizi utili a capire cosa sia successo al figlio.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "Dovrei andare a cercare nella taverna di Vilegard e nella taverna Fiasco Schiumoso a nord di Vilegard.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "Ho sentito parlare di un ragazzo nella taverna del Fiasco Schiumoso. A quanto pare si è diretto a ovest della taverna.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "A nord-ovest di Vilegard ho trovato un uomo che ha visto Rincel combattere contro alcuni mostri. Sembra che Rincel avesse lasciato Vilegard di sua volontà per andare a vedere la città di Feygard. Dovrei raccontare a Wrye a nord di Vilegard quello che è successo al figlio.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Ho detto a Wrye la verità sulla scomparsa del figlio.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Spie nella schiuma",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor della cappella di Vilegard mi ha parlato di una guardia fuori dalla taverna Fiasco Schiumoso, che secondo lui è una spia della guardia reale di Feygard. Vorrebbe che la guardia sparisse, non gli interessa in che modo. La taverna dovrebbe essere appena a nord di Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ho convinto la guardia fuori dalla taverna Fiasco Schiumoso ad andarsene appena finisce il turno.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "Ho iniziato un combattimento con la guardia fuori dalla taverna Fiasco Schiumoso. Dovrei portare il suo anello da guardia reale a Jolnor una volta che l'ho ucciso per dimostrargli che sono riuscito a farlo fuori.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ho detto a Jolnor che la guardia è sparita.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
