[
    {
        "id": "bwm_agent",
        "name": "Der Agent und das Biest",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Ich habe eine Mann auf der Suche nach Hilfe für seine Siedlung 'Blackwater Mountain' getroffen. Anscheinend wird seine Siedlung von Monstern und Banditen angegriffen und die Siedler benötigen dringend Hilfe."
            },
            {
                "progress": 5,
                "logText": "Ich habe zugestimmt, dem Mann und 'Blackwater Mountain' bei der Lösung ihres Problems zu helfen."
            },
            {
                "progress": 10,
                "logText": "Der Mann bat mich, ihn auf der anderen Seite der eingestürzten Mine zu treffen. Er wird durch einen Schacht kriechen und ich soll in die stockdunkle verlassene Mine hinabsteigen."
            },
            {
                "progress": 20,
                "logText": "Ich habe mich durch die finstere Mine gearbeitet und traf den Mann auf der anderen Seite. Er war sehr erpicht darauf mit klarzumachen, dass ich mich geradewegs nach Osten wenden soll, sobald ich die Mine verlassen habe. Ich würde ihn am Fuße der Berge im Osten treffen."
            },
            {
                "progress": 25,
                "logText": "Ich schnappte ein Gerücht auf, nach dem sich Prim und die Siedlung von Blackwater Mountain gegenseitig bekämpfen sollen."
            },
            {
                "progress": 30,
                "logText": "Ich sollte dem Pfad die Berge hinauf zur Blackwater Siedlung folgen."
            },
            {
                "progress": 40,
                "logText": "Ich habe den Mann auf meinem Weg nach Blackwater Mountain wieder getroffen. Er ermutigte mich, dem Pfad weiter zu folgen."
            },
            {
                "progress": 50,
                "logText": "Ich habe die schneebedeckten Region der Blackwater Mountains erreicht. Der Mann sagte mir, das ich noch ein wenig weiter gehen solle. Offenbar ist die Siedlung von Blackwater Mountain nicht mehr weit entfernt."
            },
            {
                "progress": 60,
                "logText": "Ich habe die Siedlung von Blackwater Mountain erreicht. Ich sollte nach ihrem Schwertmeister Harlenn suchen und mit ihm reden."
            },
            {
                "progress": 65,
                "logText": "Ich habe mit Harlenn in der Siedlung von Blackwater Mountain gesprochen. Anscheinend ist die Siedlung häufigen Angriffen durch verschiedene Monster, den Aulaeth und weißen Lindwürmern ausgesetzt. Zusätzlich werden sie auch noch von den Einwohnern von Prim attackiert."
            },
            {
                "progress": 66,
                "logText": "Harlenn denkt, dass die Leute von Prim irgendwie hinter den Angriffen der Monster stecken."
            },
            {
                "progress": 70,
                "logText": "Harlenn hat eine Nachricht für Guthbered aus Prim. Entweder beenden die Leute von Prim ihre Angriffe auf Blackwater Mountain oder Harlenn werde nicht eher ruhen, bis Prim vernichtet ist. Das soll ich Guthbered in Prim ausrichten."
            },
            {
                "progress": 80,
                "logText": "Guthbered meint, dass die Leute von Prim nichts mit den Angriffen der Monster auf Blackwater Mountain zu tun hätten. Das soll ich Harlenn ausrichten."
            },
            {
                "progress": 90,
                "logText": "Harlenn ist sich absolut sicher, dass Prim irgendwie hinter den Angriffen steckt."
            },
            {
                "progress": 95,
                "logText": "Harlenn bat mich, nach Prim zu gehen und nach Hinweisen Ausschau zu halten, ob dort ein Angriff auf seine Siedlung geplant wird. Ich soll vor allem das Umfeld von Guthbered im Auge behalten."
            },
            {
                "progress": 100,
                "logText": "Ich habe Beweise gefunden, dass Prim Söldner für eine Angriff auf Blackwater Mountain rekrutiert hat. Ich sollte das sofort Harlenn berichten."
            },
            {
                "progress": 110,
                "logText": "Harlenn hat sich bei mir bedankt, dass ich ihm von den Angriffsplänen berichtet habe.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Um die Angriffe auf Blackwater Mountain ein für alle Mal zu beenden, möchte Harlenn, dass ich Guthbered in Prim töte."
            },
            {
                "progress": 130,
                "logText": "Ich habe Guthbered angegriffen."
            },
            {
                "progress": 131,
                "logText": "Ich habe Guthbered gesagt, dass ich ihn töten soll. Ich habe ihn aber am Leben gelassen, wofür er mit zutiefst dankbar war und Prim verlassen hat.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "Ich habe Harlenn gesagt, dass Guthbered von uns gegangen ist."
            },
            {
                "progress": 150,
                "logText": "Harlenn hat sich für meine Hilfe bedankt. Nun sollten die Angriffe auf Blackwater Mountain ein Ende haben.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "Ich genieße nun das Vertrauen der Einwohner von Blackwater Mountain und alle Dienstleistungen sollten jetzt für mich verfügbar sein.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Ich habe mich entschieden, den Menschen von Blackwater Mountain nicht zu helfen.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Da ich Prim unterstütze, will Harlenn nicht mehr mit mir reden.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Gut ausgeruht",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe mich mit dem Koch in Prim unterhalten. Er kann ein Hinterzimmer vermieten, es ist aber derzeit von einem Typen namens Arghest angemietet. Ich sollte Arghest finden und feststellen, ob er den Raum noch braucht. Der Koch schickte mich in den Südwesten von Prim."
            },
            {
                "progress": 20,
                "logText": "Ich habe mit Arghest über das Hinterzimmer im Gasthaus geredet. Er möchte das Zimmer gern behalten, falls er sich einmal erholen müsse. Allerdings würde er es mir überlassen, wenn ich ihn ausreichen entschädigen würde."
            },
            {
                "progress": 30,
                "logText": "Arghest möchte 5 Flaschen Milch von mir. Wahrscheinlich kann ich Milch in den größeren Dörfern kaufen."
            },
            {
                "progress": 40,
                "logText": "Ich habe die Milch zu Arghest gebracht. Er hat zugestimmt, dass ich den Raum im Gasthaus übernehmen kann. Damit ich mich dort ausruhen kann, sollte ich vorher mit dem Koch reden.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "Ich habe dem Koch erklärt, dass ich die Erlaubnis von Arghest habe, das Hinterzimmer zu benutzen.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Düstere Absichten",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Gleich nach dem Verlassen der eingestürzten Mine traf ich auf dem Weg nach Blackwater Mountain einen Mann aus dem Dorf Prim. Er flehte mich an, ihm zu helfen."
            },
            {
                "progress": 11,
                "logText": "Prim benötigt Hilfe von außerhalb, um sich gegen die Angriffe einiger Monster wehren zu können. Ich soll mit Guthbered in Prim sprechen, wenn ich den Leuten dort helfen will."
            },
            {
                "progress": 15,
                "logText": "Guthbered soll sich im Gemeinschaftshaus von Prim aufhalten. Ich werde nach einem Steinhaus in der Mitte des Dorfes Ausschau halten."
            },
            {
                "progress": 20,
                "logText": "Ich habe mit Guthbered über die Geschichte mit den Angriffen gesprochen. Prim befindet sich seit kurzem unter ständigem Angriff aus der Siedlung von Blackwater Mountain."
            },
            {
                "progress": 25,
                "logText": "Guthbered möchte, dass ich zur Siedlung in den Bergen von Blackwater gehe und dort Schwertmeister Harlenn frage, warum (oder ob) er die Beschwörung von Gornauds für den Kampf gegen Prim veranlasst hat."
            },
            {
                "progress": 30,
                "logText": "Ich habe mit Harlenn über die Angriffe auf Prim gesprochen. Er sagt, dass seine Leute nichts mit den Angriffen zu tun hätten. Das soll ich Guthbered in Prim ausrichten."
            },
            {
                "progress": 40,
                "logText": "Guthbered glaubt immer noch, dass die Leute aus Blackwater Mountain hinter den Angriffen stecken."
            },
            {
                "progress": 50,
                "logText": "Guthbered möchte, dass ich nach Hinweisen auf eine größere Offensive aus Blackwater Mountain gegen Prim suche. Er würde irgendwo in der Nähe von Harlenn's Privatquartier suchen, natürlich ohne gesehen zu werden."
            },
            {
                "progress": 60,
                "logText": "Ich habe in Harlenn's Privatquartier Dokumente mit Angriffsplänen gegen Prim gefunden. Ich sollte das Guthbered so schnell wie möglich mitteilen."
            },
            {
                "progress": 70,
                "logText": "Guthbered dankte mir für meine Hilfe beim Aufdecken der Angriffspläne aus Blackwater Mountain.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "Um die Angriffe auf Prim ein für alle Mal zu beenden, möchte Guthbered, dass ich Harlenn in Blackwater Mountain töte."
            },
            {
                "progress": 90,
                "logText": "Ich habe Harlenn angegriffen."
            },
            {
                "progress": 91,
                "logText": "Ich habe Harlenn erklärt, dass ich geschickt wurde, ihn zu töten. Ich ließ ihn aber am Leben, wofür er mir zutiefst dankbar war und die Siedlung verlassen hat.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "Ich habe Guthbered gesagt, dass Harlenn von uns gegangen ist."
            },
            {
                "progress": 100,
                "logText": "Guthbered hat sich für meine Hilfe bedankt. Nun sollten die Angriffe auf Prim ein Ende haben. Als Dank erhielt ich außerdem einige Sachen und eine gefälschte Zugangserlaubnis für die inneren Kammern in der Siedlung von Blackwater Mountain.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "Ich habe den Wachen die gefälschte Zugangserlaubnis gezeigt und wurde in die inneren Kammern vorgelassen."
            },
            {
                "progress": 240,
                "logText": "Ich genieße nun das Vertrauen der Einwohner von Prim und alle Dienstleistungen sollten jetzt für mich verfügbar sein.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Ich habe mich entschieden, den Menschen von Prim nicht zu helfen.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "Da ich Blackwater Mountain unterstütze, will Guthbered nicht mehr mit mir reden.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Licht im Dunkel",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "Ich habe die innere Kammer der Siedlung von Blackwater Mountain erreicht und einige Magier angetroffen, die von einem Mann namens Throdna angeführt werden."
            },
            {
                "progress": 9,
                "logText": "Throdna schien sehr interessiert an jemand (oder etwas) mit dem Namen Kazaul, insbesondere an einem Ritual das in dessen Namen ausgeführt wird."
            },
            {
                "progress": 10,
                "logText": "Ich habe Throdna versprochen ihm dabei zu helfen, mehr über das Ritual selbst herauszufinden. Dazu soll ich nach Bruchstücken für das Ritual suchen, welche irgendwo um den Berg herum zu finden sein müssen. Ich sollte nach den Stücken auf dem Bergpfad suchen, der von Blackwater Mountain nach Prim führt."
            },
            {
                "progress": 11,
                "logText": "Ich muss die zwei Teile für den Gesang finden und die drei Teile, die das Ritual selbst beschreiben. Wenn ich alle Teile habe, soll ich zu Throdna zurückkehren."
            },
            {
                "progress": 21,
                "logText": "Ich habe die erste Hälfte des Gesangs für das Ritual von Kazaul."
            },
            {
                "progress": 22,
                "logText": "Ich habe die zweite Hälfte des Gesangs für das Ritual von Kazaul."
            },
            {
                "progress": 25,
                "logText": "Ich habe das erste Teil für das Ritual von Kazaul gefunden."
            },
            {
                "progress": 26,
                "logText": "Ich habe das zweite Teil für das Ritual von Kazaul gefunden."
            },
            {
                "progress": 27,
                "logText": "Ich habe das dritte Teil für das Ritual von Kazaul gefunden."
            },
            {
                "progress": 30,
                "logText": "Throdna dankte mir für das Auffinden aller Teile des Rituals.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Throdna will, dass ich die Kazaul Brutstätte in der Nähe von Blackwater Mountain zerstöre. Es gibt einen Schrein am Fuß des Berges, den ich mir näher ansehen sollte."
            },
            {
                "progress": 41,
                "logText": "Ich habe eine Essenz des reinen Geistes von Throdna erhalten. Ich soll den Inhalt über den Schrein von Kazaul verteilen. Nachdem ich den Schrein gefunden und gereinigt habe, soll ich zu Throdna zurückkehren."
            },
            {
                "progress": 50,
                "logText": "Im Schrein unterhalb von Blackwater Mountain bin ich einem Wächter von Kazaul begegnet. Nachdem ich die Verse des Ritualgesangs angestimmt hatte, griff er mich an."
            },
            {
                "progress": 60,
                "logText": "Ich habe den Schrein von Kazaul gereinigt.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "Ich hatte zumindest eine kleine Anerkennung von Throdna erwartet, nachdem ich ihm behilflich war, mehr über das Ritual herauszufinden und für das Reinigen des Schreins. Er schien jedoch mehr mit den Ausführungen über Kazaul beschäftigt, aus denen ich nicht Verständliches heraushören konnte.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Keine Schwäche",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Auf der zweiten Ebene der Blackwater Mountain Siedlung erforscht Herec die weißen Lindwürmer, die außerhalb der Siedlung leben. Er braucht dafür 5 Krallen von weißen Lindwürmern. Offenbar haben nur einige der Lindwürmer diese Krallen, so dass ich wohl ein wenig jagen muss, um sie zu finden."
            },
            {
                "progress": 20,
                "logText": "Ich habe Herec 5 Krallen von weißen Lindwürmern gebracht."
            },
            {
                "progress": 30,
                "logText": "Herec hat einen Trank für die Wiederherstellung der Ausdauer hergestellt. Dieser wird sehr hilfreich sein, wenn ich wieder einmal gegen die Lindwürmer kämpfen muss.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Aus dem Schlummer erwacht",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Bjorgur aus Prim am Fuße der Berge von Blackwater denkt, dass irgendetwas die Grabruhe seiner Eltern gestört hat. Das Grab liegt südwestlich von Prim, beim Eingang zur Ulmenmine."
            },
            {
                "progress": 15,
                "logText": "Bjorgur hat mich beauftrag, das Grab seiner Eltern zu überprüfen und sicherzustellen, dass der Erbdolch seiner Familie immer noch sicher in der Gruft liegt."
            },
            {
                "progress": 20,
                "logText": "Fulus aus Prim ist daran interessiert, den Dolch aus Bjorgur's Familienbesitz zu bekommen, der früher Bjorgur's Großvater gehörte."
            },
            {
                "progress": 30,
                "logText": "Ich traf einen Mann in den unteren Ebenen einer Gruft südwestlich von Prim. Er trug einen außergewöhnlichen Dolch bei sich. Er muss ihn aus dem Grab geraubt haben."
            },
            {
                "progress": 40,
                "logText": "Ich habe den Dolch an seinen Platz in der Gruft zurückgelegt. Die rastlosen Untoten scheinen nun seltsamerweise ein wenig ruhiger zu sein.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Bjorgur dankte mir für meine Hilfe. Er meinte, ich solle auch seine Verwandten in Feygard besuchen.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "Ich habe Fulus erzählt, dass ich für Bjorgur den Familiendolch wieder an seinen angestammten Platz zurückgebracht habe."
            },
            {
                "progress": 60,
                "logText": "Ich habe Fulus Bjorgur's Familiendolch gegeben. Er dankte mir und belohnte mich entsprechend.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
