[
    {
        "id": "farrik",
        "name": "Nächtlicher Besuch",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Farrik, ein Mitglied der Diebesgilde in Fallhaven, hat mir von einer geplanten Flucht erzählt. Ein Mitglied der Gilde soll aus dem Gefängnis von Fallhaven befreit werden.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Farrik hat mir die Details zu dem Fluchtplan genannt und ich habe die Aufgabe der Gilde zu helfen angenommen. Der Hauptmann der Wache im Gefängnis hat anscheinend ein Alkoholproblem. Dem Plan zufolge soll ich eine präparierte Flasche Met vom Koch der Diebesgilde an ihn übergeben, was ihn mit Sicherheit einige Stunden außer Gefecht setzen wird. Es könnte außerdem notwendig sein, den Hauptmann zu bestechen.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "Ich habe den präparierten Met vom Koch der Diebesgilde erhalten.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ich habe Ferrik gesagt, dass ich nicht in allen Punkten mit seinem Plan einverstanden bin. Ich könnte dem Hauptmann der Wache von ihrem zwielichtigen Plan berichten...",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "Ich habe den präparierten Met an den Hauptmann der Wache übergeben.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Ich habe dem Hauptmann der Wache von Plan der Diebe, ihren Freund zu befreien, erzählt.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Der Hauptmann möchte, dass ich den Dieben erzähle, dass die Wache heute Nacht nur aus einer Notmannschaft besteht. Das sollte dafür sorgen, dass einige Diebe gefangen werden können.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Ich habe den Hauptmann dazu gebracht, den präparierten Met zu trinken. Er sollte heute Nacht außer Gefecht sein, so dass die Diebe ihren Freund befreien können.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Farrik hat mich für meine Hilfe der Diebesgilde gegenüber belohnt.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "Ich habe Ferrik erzählt, dass die Wache heute Nacht nur sehr dünn besetzt sein wird.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Der Hauptmann der Gefängniswache dankte mir für die Hilfe bei der Gefangennahme der Diebe. Er sagte, dass er auch den anderen Wachen davon erzählen würde.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "Ein verlorener Trank",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich soll einen Alchemisten namens Lodar finden. Umar von der Diebesgilde in Fallhaven erzählte mir auch, dass ich auf dem Weg zu Lodar's Versteck einen Wächter passieren müsse, für den ich ein Passwort benötigen würde.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "Umar sagte mir, dass ich das Passwort für Lodar's Versteck bei Ogam in Vilegard in Erfahrung bringen könnte.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ich habe Ogam im Südwesten von Vilegard besucht. Er schien in Rätseln zu sprechen. Ich konnte kaum etwas verstehen, als ich in nach Lodar's Versteck fragte. 'Auf halbem Weg zwischen dem Schatten und dem Licht. Felsformationen.' und 'Das Leuchten des Schattens.' waren einige seiner Worte. Ich habe keine Ahnung, was das bedeuten könnte.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "vilegard",
        "name": "Vertrauen für einen Fremden",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Die Leute von Vilegard sind sehr misstrauisch gegenüber Fremden. Mir wurde gesagt, dass ich mit Jolnor in der Kapelle von Vilegard rede soll, wenn ich das Vertrauen der Bewohner erlangen möchte.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ich habe mit Jolnor in der Kapelle von Vilegard geredet. Er schlägt vor, dass ich drei einflussreichen Menschen helfen solle, um das Vertrauen der Menschen zu gewinnen. Ich soll Kaori, Wrye und Jolnar selbst nach Aufgaben fragen.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ich habe den drei wichtigen Bürgern von Vilegard geholfen, so wie Jolnor mir geraten hat. Nun sollten mir die Leute etwas mehr vertrauen.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Botengang für Kaori",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Jolnor hat mir in der Kapelle von Vilegard den Auftrag gegeben, mit Kaori im Norden von Vilegard zu reden, um sie nach einer Aufgabe zu fragen.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Kaori aus Nord-Vilegard will 10 Knochenmehltränke von mir.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ich habe Kaori die 10 Knochentränke gebracht.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Eine zweifelhafte Angelegenheit",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor aus Vilegard möchte, dass ich mit Wrye im Norden von Vilegard rede. Sie vermisst ihren Sohn scheinbar seit kurzem.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Wrye aus Nord-Vilegard erzählte mir, dass ihr Sohn Rincel vermisst wird. Sie glaubt, dass er entweder tot oder sehr schwer verletzt ist.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Wrye erzählte mir, dass sie die königliche Garde aus Feygard mit dem Verschwinden ihres Sohnes in Verbindung bringt und das diese ihn rekrutiert hätten.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Wrye möchte, dass ich nach Hinweisen suche, die offenbaren, was ihrem Sohn zugestoßen ist.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "Ich sollte in der Taverne von Vilegard und in der Taverne 'Schäumende Flasche' nördlich von Vilegard nach dem Verbleib von Rincel forschen.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "Ich hörte, dass ein Junge vor einiger Zeit in der Taverne 'Schäumende Flasche' war. Offenbar ging er von hier aus nach Westen.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "Nordwestlich von Vilegard bin ich auf einen Mann gestoßen, der Rincel beim Kampf mit Monstern beobachtet hat. Anscheinend verließ Rincel Vilegard freiwillig, um sich die Stadt Feygard anzusehen. Ich sollte seiner Mutter Wrye im Norden von Vilegard berichten, was ihrem Sohn passiert ist.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Ich habe Wrye die Wahrheit über das Verschwinden ihres Sohnes erzählt.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Spione im Schaum",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Jolnor aus Vilegard erzählte mir in der Kapelle von einem Wachposten vor der Taverne 'Schäumende Flasche', von dem er annimmt, dass es sich um einen Spion der königlichen Garde aus Feygard handelt. Er möchte, dass ich irgendwie dafür sorge, dass der Wachposten dort verschwindet. Die Taverne liegt nördlich von Vilegard.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Ich konnte den Wächter vor der Taverne 'Schäumende Flasche' davon überzeugen, dass er nach seiner Schicht den Posten verlässt.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "Ich habe den Wachtposten vor der Taverne 'Schäumende Flasche' angegriffen. Seinen Ring mit dem Wappen der königlichen Garde werde ich Jolnor als Beweis dafür bringen, dass er den Posten für immer verlassen hat.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Ich habe Jolnor berichtet, dass die Wache nicht mehr auf ihrem Posten ist.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
