[
    {
        "id": "remgard",
        "name": "Alles in Ordnung",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe die Brücke erreicht, die nach Remgard führt. Dem Brückenwächter zufolge ist die Stadt für Fremde gesperrt und es darf gegenwärtig auch niemand die Stadt verlassen. Es finden Untersuchungen wegen dem Verschwinden einiger Bewohner statt."
            },
            {
                "progress": 15,
                "logText": "Ich habe angeboten, den Leuten von Remgard bei der Untersuchung im Fall der verschwundenen Bewohner zu helfen."
            },
            {
                "progress": 20,
                "logText": "Der Brückenwächter hat mich gefragt, ob ich das verlassene Haus im Osten am Nordufer des Sees untersuchen könnte. Ich soll vor jeglichen Bewohnern die sich dort aufhalten auf der Hut sein."
            },
            {
                "progress": 30,
                "logText": "Ich habe dem Brückenwächter berichtet, dass ich Algangror in dem verlassenen Haus getroffen habe.",
                "rewardExperience": 3000
            },
            {
                "progress": 31,
                "logText": "Ich habe dem Brückenwächter berichtet, dass außer ein paar Ratten niemand in dem Haus war.",
                "rewardExperience": 3000
            },
            {
                "progress": 35,
                "logText": "Ich habe Zugang zur Stadt Remgard erhalten. Ich sollte bei Jhaeld dem Stadtältesten vorsprechen, um weitere Schritte zu erfahren. Jhaeld könnte sich möglicherweise in der Taverne im Südosten der Stadt aufhalten."
            },
            {
                "progress": 40,
                "logText": "Jhaeld war ziemlich überheblich, aber er hat mir gesagt sie hätten seit einer ganzen Weile ein Problem mit verschwindenden Bewohner. Sie haben keinen Anhaltspunkt was die Ursache dafür sein könnte."
            },
            {
                "progress": 50,
                "logText": "Ich soll 4 Bewohner in Remgard besuchen und sie nach Hinweisen was mit den verschwundenen Bewohnern passiert sein könnte befragen."
            },
            {
                "progress": 51,
                "logText": "Der erste ist Norath, dessen Frau Bethir verschwunden ist. Norath kann im südwestlichsten Bauernhaus gefunden werden."
            },
            {
                "progress": 52,
                "logText": "Als zweites sollte ich mit den Rittern von Elythom hier in der Taverne reden."
            },
            {
                "progress": 53,
                "logText": "Als drittes sollte ich mit der alten Frau Duaina in ihrem Haus im Süden reden."
            },
            {
                "progress": 54,
                "logText": "Als letztes sollte ich mit Rothses dem Rüstungsbauer reden. Er lebt auf der Westseite der Stadt."
            },
            {
                "progress": 59,
                "logText": "Ich habe versucht mit Jhaeld über Algangror zu reden, aber er entließ als ob er mich nicht gehört hätte."
            },
            {
                "progress": 61,
                "logText": "Ich habe mit Norath gesprochen. Er und seine Frau hatten kürzlich einen Streit, aber er hat keine Ahnung was mit ihr passiert sein könnte."
            },
            {
                "progress": 62,
                "logText": "Die Ritter von Elythom in der Remgard Taverne sagen eine der Ritterinnen sei kürzlich verschwunden. Allerdings hatte niemand etwas bemerkt als sie verschwunden war."
            },
            {
                "progress": 63,
                "logText": "Duaina hat mich ih ihrer Vision gesehen. Ich habe nicht alles verstanden was sie gesagt hatte, aber was ich verstanden hatte war, dass ich und Andor teil eines größeren Plans wären. Ich frage mich was das bedeutet? Sie redete nicht über irgendwelche verschwundenen Bewohner, jedenfalls nicht so, dass ich es verstehen konnte."
            },
            {
                "progress": 64,
                "logText": "Rothses hat mir gesagt, dass Bethir ihn in der Nacht vor ihrem Verschwinden besucht hatte, um einige Gegenstände zu verkaufen. Er hatte nicht gesehen, wo sie anschließend hingegangen ist."
            },
            {
                "progress": 70,
                "logText": "Wie Jhaeld es wollte habe ich mit allen Bewohnern gesprochen, aber ich habe von niemanden Informationen bekommen, was mir den verschwundenen Bewohnern passiert sein könnte. Ich sollte zurück zu Jhaeld gehen und ihn nach seinen weiteren Plänen fragen."
            },
            {
                "progress": 75,
                "logText": "Jhaeld war sehr enttäuscht, dass ich von den Bewohnern, mit denen ich sprechen sollte, nichts herausfinden konnte.",
                "rewardExperience": 15000
            },
            {
                "progress": 80,
                "logText": "Wenn ich Jhaeld und den Bewohnern von Remgard immer noch helfen will, sollte ich an anderen Orten nach Hinweisen suchen.",
                "finishesQuest": 1
            },
            {
                "progress": 110,
                "logText": "Jhaeld will nicht mit mir reden. Ich werde ihnen nicht helfen herauszufinden was mit den vermissten Bewohnern aus Remgard passiert ist.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "remgard2",
        "name": "Was ist das für ein Gestank?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe Jhaeld dem Stadtältesten in Remgard über die Frau namens Algangror erzählt. Sie wohnt in dem verlassenen Haus im Osten des Nordstrandes von dem See außerhalb Remgard's."
            },
            {
                "progress": 20,
                "logText": "Jhaeld hat mir gesagt er würde sich lieber nicht mit ihr anlegen, da er glaubt, dass sie sehr gefährlich sei. Den Wachen zuliebe wird er es nicht riskieren gegen sie vorzugehen, da er Angst hat was mit ihnen allen passieren könnte."
            },
            {
                "progress": 21,
                "logText": "Wenn ich Jhaeld und den Bewohnern von Remgard helfen wollte, sollte ich einen Weg finden damit Algangror verschwindet. Er hat mich auch gewarnt äußerst vorsichtig zu sein."
            },
            {
                "progress": 30,
                "logText": "Algangror hat mir gegenüber zugegeben einige Bewohner Remgard's verschwinden zu lassen. Aber sie würde mir nicht erzählen was mit ihnen passiert ist."
            },
            {
                "progress": 35,
                "logText": "Ich habe Algangror angegriffen. Ich sollte mit einem Beweis sie besiegt zu haben zu Jhaeld zurückkehren wenn sie tot ist."
            },
            {
                "progress": 40,
                "logText": "Ich habe Jhaeld erzählt, dass ich Algangror besiegt habe."
            },
            {
                "progress": 41,
                "logText": "Jhaeld war sehr erfreut die guten Neuigkeiten zu hören. Die Bewohner aus Remgard sollten jetzt sicher sein und die Stadt kann nun für Fremde wieder geöffnet werden."
            },
            {
                "progress": 45,
                "logText": "Dafür, dass ich die Ursache für das Verschwinden der Bewohner aus Remgard gefunden habe, sagte Jhaeld mir ich sollte mit Rothses reden. Es könnte ihm möglich sein etwas von meiner Ausrüstung zu verbessern.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 46,
                "logText": "Ervelyn, der Schneider aus Remgard, gab mir einen gefederten Hut als Dank für die Hilfe den Bewohnern Remgard's gegenüber."
            }
        ]
    },
    {
        "id": "fiveidols",
        "name": "Die fünf Figuren",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Algangror will, dass ich ihr bei einer Aufgabe helfe. Sie kann mir weder den Inhalt der Aufgabe beschreiben, noch ihre Beweggründe erklären. Sie hat versprochen mir ihre magische Halskette, die offensichtlich sehr wertvoll ist, zu geben, wenn ich ihr helfe."
            },
            {
                "progress": 20,
                "logText": "Ich habe zugestimmt Algangror mit ihrer Aufgabe zu helfen."
            },
            {
                "progress": 30,
                "logText": "Algangror will, dass ich fünf Figuren bei fünf verschiedenen Bewohnern aus Remgard aufstelle. Die Figuren soll ich jeweils nah am Bett der fünf Bewohner platzieren. Die Figuren müssen gut versteckt werden, damit sie nicht so einfach gefunden werden können."
            },
            {
                "progress": 31,
                "logText": "Der erste Bewohner ist Jhaeld, der Stadtältesten der in der Remgard Tavern gefunden werden kann."
            },
            {
                "progress": 32,
                "logText": "Als zweites soll ich eine Figur beim Bett von Larni dem Bauern platzieren. Er wohnt in einem Haus im Norden von Remgard."
            },
            {
                "progress": 33,
                "logText": "Der dritte Bewohner ist Arnal der Waffenschmied, der im Nordwesten von Remgard lebt."
            },
            {
                "progress": 34,
                "logText": "Der vierte ist Emerei, der im Südosten von Remgard gefunden werden kann."
            },
            {
                "progress": 35,
                "logText": "Der fünfte Bewohner ist Carthe. Carthe lebt am östlichem Strand von Remgard, in der Nähe der Taverne."
            },
            {
                "progress": 37,
                "logText": "Ich darf niemand von meiner Aufgabe oder dem Platzieren der Figuren erzählen."
            },
            {
                "progress": 41,
                "logText": "Ich habe eine Figur bei Jhaeld's Bett platziert."
            },
            {
                "progress": 42,
                "logText": "Ich habe eine Figur bei dem Bett von Larni dem Bauern platziert."
            },
            {
                "progress": 43,
                "logText": "Ich habe eine Figur bei Arnal's Bett platziert."
            },
            {
                "progress": 44,
                "logText": "Ich habe eine Figur bei Emerei's Bett platziert."
            },
            {
                "progress": 45,
                "logText": "Ich habe eine Figur bei Carthe's Bett platziert."
            },
            {
                "progress": 50,
                "logText": "Wie Algangror mir gesagt hat habe ich alle Figuren bei den Betten der fünf Bewohner aufgestellt. Ich sollte zu Algangror zurückkehren."
            },
            {
                "progress": 51,
                "logText": "Algangror dankte mir, dass ich ihr geholfen hatte."
            },
            {
                "progress": 60,
                "logText": "Sie erzählte mir ihre Geschichte, wie sie in der Stadt lebte, aber für ihren Glauben verfolgt wurde. Ihrer Meinung nach war die Verfolgung vollkommen ungerechtfertigt, da sie den Bewohnern kein Schaden zugefügt hatte."
            },
            {
                "progress": 61,
                "logText": "Um sich an der Stadt Remgard zu rächen, hatte sie es geschafft ein paar Bewohner in ihr Haus zu locken und sie in Ratten zu verwandeln."
            },
            {
                "progress": 70,
                "logText": "Für die Hilfe bei der Aufgabe, die sie selbst nicht durchführen konnte, gab mir Algangror ihre magische Halskette, 'Marrow's Verderben'.",
                "rewardExperience": 21000,
                "finishesQuest": 1
            },
            {
                "progress": 100,
                "logText": "Ich habe mich entschieden Algangror bei ihrer Aufgabe nicht zu helfen.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaverin",
        "name": "Alte Freunde?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich traf Kaverin in Remgard, der offenbar ein alter Bekannter von Unzel ist, der außerhalb von Fallhaven lebt."
            },
            {
                "progress": 20,
                "logText": "Kaverin will, dass ich Unzel eine Nachricht überbringe."
            },
            {
                "progress": 21,
                "logText": "Ich habe abgelehnt Kaverin zu helfen.",
                "finishesQuest": 1
            },
            {
                "progress": 22,
                "logText": "Ich habe zugestimmt die Nachricht zu überbringen."
            },
            {
                "progress": 25,
                "logText": "Kaverin hat mir die Nachricht gegeben, die ich Unzel weitergeben soll."
            },
            {
                "progress": 30,
                "logText": "Ich habe Unzel die Nachricht überreicht. Ich sollte zu Kaverin in Remgard zurückkehren."
            },
            {
                "progress": 40,
                "logText": "Kaverin dankte mir für das überbringen der Nachricht an Unzel.",
                "rewardExperience": 10000
            },
            {
                "progress": 45,
                "logText": "Im Gegenzug, gab Kaverin mir eine alte Karte, die in seinen Besitz gelangt war. Offenbar führt sie zu Vacor's altem Versteck."
            },
            {
                "progress": 60,
                "logText": "Kaverin war darüber dass ich Unzel getötet und Vacor geholfen hatte sehr aufgebracht. Er fing an mich zu attakieren. Ich sollte zu Vacor zurückkehren, wenn Kaverin tot ist."
            },
            {
                "progress": 70,
                "logText": "Kaverin trug eine versiegelte Nachricht bei sich. Vacor hatte das Siegel sofort erkannt und schien sehr an der Nachricht interessiert zu sein."
            },
            {
                "progress": 75,
                "logText": "Ich habe Vacor die Nachricht von Kaverin gegeben. Im Gegenzug gab mir Vacor eine alte Karte, die zu seinem alten Versteck führte.",
                "rewardExperience": 10000
            },
            {
                "progress": 90,
                "logText": "Ich sollte versuchen Vacor's altes Versteck auf der Straße westlich des ehemaligen Gefängnisses in Flagstone, südwestlich von Fallhaven zu finden."
            },
            {
                "progress": 100,
                "logText": "Ich habe Vacor's altes Versteck gefunden.",
                "finishesQuest": 1
            }
        ]
    }
]
