[
    {
        "id": "toszylae",
        "name": "Ein unfreiwilliger Botschafter",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Auf der Straße zwischen Loneford und Brimhaven habe ich ein ausgetrocknetes Flussbett mit einer größeren Höhle darunter gefunden. Tief in der Höhle traf ich auf Ulirfendor, einen Priester des Schattens aus Brimhaven. Ulirfendor versucht, die Inschriften auf einem Schrein von Kazaul zu entziffern und hat herausgefunden, dass sie von einem 'Dunklen Beschützer' sprechen. Er weiß allerdings nicht, wer das sein soll. Was auch immer es bedeutet, er hat beschlossen, dass es aufgehalten werden muss."
            },
            {
                "progress": 11,
                "logText": "Ulirfendor braucht Hilfe beim Bestimmen der fehlenden Teile der Inschriften auf dem Schrein. Die Inschrift lautet 'Kulauil hamar urum Kazaul'te', aber die nächsten Teile sind auf dem Felsen nicht mehr lesbar."
            },
            {
                "progress": 15,
                "logText": "Ich habe Ulirfendor meine Hilfe angeboten und werde versuchen herauszufinden, wie die fehlenden Teile der Inschrift lauten. Ulirfendor glaubt, dass der Schrein von einer mächtigen Kreatur spricht, welche tiefer in der Höhle hausen soll. Vielleicht kann ich dort Hinweise über die fehlenden Teile finden."
            },
            {
                "progress": 20,
                "logText": "Tief im inneren der Höhle, bin ich auf einen strahlenden Wächter gestoßen, der irgendeine andere Kreatur beschützt. Er stieß die Worte 'Kulauil hamar urum Kazaul'te. Kazaul hamat urul' hervor. Das müssen die fehlenden Worte sein, nach denen Ulirfendor sucht. Ich sollte sofort zu ihm zurückkehren."
            },
            {
                "progress": 21,
                "logText": "Ich habe versucht, den Wächter anzugreifen, konnte ihm jedoch nicht einmal nahe kommen. Irgendeine starke Macht hielt mich zurück. Vielleicht weiß Ulirfendor mehr."
            },
            {
                "progress": 30,
                "logText": "Ulirfendor war sehr davon angetan, dass ich die fehlenden Teile der Inschrift in Erfahrung bringen konnte.",
                "rewardExperience": 2000
            },
            {
                "progress": 32,
                "logText": "Er erzählte mir auch, wie die Inschrift weiter lautete, wusste jedoch wieder nicht um deren Bedeutung. Ich soll zum Wächter zurückgehen und ihm die Worte von Ulirfendor ausrichten."
            },
            {
                "progress": 42,
                "logText": "Ich habe die Worte vor dem Wächter ausgesprochen.",
                "rewardExperience": 5000
            },
            {
                "progress": 45,
                "logText": "Der Wächter brach in schallendes Lachen aus und griff mich an."
            },
            {
                "progress": 50,
                "logText": "Ich habe den Wächter besiegt und gelangte so zum Lich 'Toszylae'. Er hat es geschafft, mich mit irgendetwas zu infizieren. Ich muss ihn töten und zu Ulirfendor zurückkehren."
            },
            {
                "progress": 60,
                "logText": "Ulirfendor teilte mir mit, dass er es geschafft habe, die Worte zu übersetzen, die ich zu dem Wächter gesagt habe. Frei übersetzt lauteten die Worte 'Mein Körper für Kazaul'. Ulirfendor war sehr betroffen von der Bedeutung der Worte für mich und bedauerte, dass er mich diese Worte sprechen lies."
            },
            {
                "progress": 70,
                "logText": "Ulirfendor war sehr glücklich zu hören, dass ich den Lich besiegen konnte. Das wird die Leute in der Umgebung wieder ruhiger schlafen lassen.",
                "rewardExperience": 20000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "darkprotector",
        "name": "Der dunkle Beschützer",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe nach dem Sieg über den Lich 'Toszylae' einen fremdartigen Helm gefunden. Ich werde Ulirfendor fragen, ob er mir etwas darüber sagen kann."
            },
            {
                "progress": 15,
                "logText": "Ulirfendor denkt, dass dieses Artefakt der Gegenstand ist, von dem die Inschrift auf dem Schrein spricht. Er wird Kummer im Umfeld desjenigen verursachen, der ihn trägt. Er möchte, dass ich ihn sofort zerstöre."
            },
            {
                "progress": 26,
                "logText": "Für die Zerstörung des Helms braucht Ulirfendor den Helm und das Herz des Lichs."
            },
            {
                "progress": 30,
                "logText": "Ich habe Ulirfendor den Helm gegeben."
            },
            {
                "progress": 31,
                "logText": "Ich habe Ulirfendor das Herz des Lichs gegeben."
            },
            {
                "progress": 35,
                "logText": "Ulirfendor hat das Artefakt zerstört. Die Menschen in den umliegenden Gegenden sind nun sicher vor dem Leid, das der Helm über sie gebracht hätte."
            },
            {
                "progress": 40,
                "logText": "Für die Hilfe mit dem Lich und dem Helm hat mir Ulirfendor den dunklen Segen des Schattens zuteil werden lassen.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 41,
                "logText": "Für die Hilfe mit dem Lich und dem Helm wollte mir Ulirfendor den dunklen Segen des Schattens zuteil werden lassen. Ich habe jedoch abgelehnt.",
                "rewardExperience": 35000,
                "finishesQuest": 1
            },
            {
                "progress": 50,
                "logText": "Ich habe beschlossen, den Helm für mich zu behalten. Wer weiß, welche Kräfte er für mich bereit hält."
            },
            {
                "progress": 51,
                "logText": "Ulirfendor hat mich angegriffen, weil ich den Helm behalten habe."
            },
            {
                "progress": 55,
                "logText": "Ich habe ein Buch in der Nähe des Schreins gefunden. Das Buch beschreibt ein Ritual, bei dem die wahre Macht des Helms wiederhergestellt werden kann. Ich sollte es durchführen, wenn ich den Helm tragen will."
            },
            {
                "progress": 60,
                "logText": "Ich habe mit dem Ritual von Kazaul begonnen."
            },
            {
                "progress": 65,
                "logText": "Ich habe den Helm vor dem Schrein von Kazaul platziert."
            },
            {
                "progress": 66,
                "logText": "Ich habe das Herz des Lichs vor dem Schrein von Kazaul platziert."
            },
            {
                "progress": 70,
                "logText": "Das Ritual ist beendet und die Macht und der uralte Ruhm des Helmes wurden wiederhergestellt.",
                "rewardExperience": 5000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "maggots",
        "name": "Es ist in mir!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Tief im inneren einer Höhle bin ich mit einem Lich von Kazaul zusammengestoßen. Irgendwie hat es der Lich geschafft, mich mit etwas zu infizieren, was in meinem Bauch herumkrabbelt! Ich muss das irgendwie los werden. Ich sollte Ulirfendor fragen, oder gleich Hilfe in einer Kirche suchen."
            },
            {
                "progress": 20,
                "logText": "Ulirfendor sagte, dass er einmal etwas über Maden gelesen hätte, die sich von lebendem Gewebe ernähren. Das kann bei mir 'ungewöhnliche' Auswirkungen haben und die Eier der Maden können einen Menschen langsam von innen her töten. Ich sollte so schnell wie möglich Hilfe suchen, bevor es zu spät ist."
            },
            {
                "progress": 21,
                "logText": "Ulirfendor meinte, dass mir ein Priester des Schattens helfen könnte. Ich solle Talion in Loneford sofort aufsuchen."
            },
            {
                "progress": 30,
                "logText": "Der Priester Talion aus Loneford sagte mir, dass er für die Heilung meines Leidens ein paar Sachen benötigt. Zunächst einmal braucht er fünf Knochen und zwei Büschel Tierfell. Außerdem wird noch eine Irdegh-Giftdrüse und ein leeres Fläschchen benötigt. Knochen und Fell sollten sich in der Wildnis leicht finden lassen. Die Giftdrüse sollte einer der Irdeghs liefern können, die östlich von hier gesichtet wurden."
            },
            {
                "progress": 40,
                "logText": "Ich habe fünf Knochen zu Talion gebracht."
            },
            {
                "progress": 41,
                "logText": "Ich habe die zwei Büschel Tierhaar zu Talion gebracht."
            },
            {
                "progress": 42,
                "logText": "Ich habe die Giftdrüse bei Talion abgeliefert."
            },
            {
                "progress": 43,
                "logText": "Ich habe Talion ein leeres Fläschchen gegeben."
            },
            {
                "progress": 45,
                "logText": "Ich habe jetzt alle Zutaten die Talion für meine Heilung braucht besorgt."
            },
            {
                "progress": 50,
                "logText": "Talion hat mich von den Kazaul-Maden geheilt. Ich konnte eine der Maden in einem leeren Fläschchen auffangen. Talion meinte, das wäre sehr wertvoll. Ich kann mir aber nicht vorstellen wofür.",
                "rewardExperience": 30000
            },
            {
                "progress": 51,
                "logText": "Wegen meiner früheren Erkrankung kann ich mich jetzt jederzeit gegen eine geringe Gebühr bei Talion mit dem Segen des Schattens belegen lassen.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "sisterfight",
        "name": "Meinungsverschiedenheiten",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe von zwei zankenden Schwestern aus Remgard gehört: Elwel und Elwyl. Anscheinend halten sie nachts die Leute wach, so laut schreien sie sich gegenseitig an. Ich sollte sie vielleicht einmal in ihrem Haus am Südrand von Remgard besuchen."
            },
            {
                "progress": 20,
                "logText": "Ich habe mit Elwyl, einer der Elwille Schwestern in Remgard, geredet. Sie ist wütend auf ihre Schweser, da sie ihr nicht einmal bei ganz einfachen Fakten zustimmt. Scheinbar haben sie ihre gegenseitigen Meinungsverschiedenheiten seit mehreren Jahren."
            },
            {
                "progress": 21,
                "logText": "Elwel will nicht mit mir reden."
            },
            {
                "progress": 30,
                "logText": "Eine Sache in der die beiden Schwestern aktuell unterschiedlicher Meinung sind ist die Farbe eines bestimmten Trankes, den der Stadtalchemist Hjaldar zubereitet. Elwyl sagt, dass der Trank der Treffsicherheit den Hjaldar macht ein blauer Trank ist, aber Elwel besteht darauf, dass der Trank aus einer grünen Substanz ist."
            },
            {
                "progress": 31,
                "logText": "Elwyl will, dass ich einen Trank der Treffsicherheit von Hjaldar hier in Remgard besorge, so dass sie endgültig beweisen kann, dass Elwel falsch liegt."
            },
            {
                "progress": 40,
                "logText": "Ich habe mit Hjaldar in Remgard gesprochen. Hjaldar kann seine Tränke nicht mehr zubereiten, da ihm sein Vorrat an Lyson Marrowextrakt ausgegangen ist."
            },
            {
                "progress": 41,
                "logText": "Offenbar hätte Hjaldar's alter Freund Mazeg sicher noch etwas Lyson Marrowextrakt zu verkaufen. Unglücklicherweise weiß er nicht wo Mazeg aktuell lebt. Er weiß nur, dass Mazeg bei ihrem letzten Treffen auf der Reise weit nach Westen war."
            },
            {
                "progress": 45,
                "logText": "Ich sollte Mazeg finden um etwas Lyson Marrowextrakt zu bekommen, so dass Hjaldar wieder seine Tränke machen kann."
            },
            {
                "progress": 50,
                "logText": "Ich habe mit Mazeg in der Blackwater Mountain Siedlung gesprochen. Da ich den Leuten aus Blackwater Mountain geholfen habe, würde er mir Lyson Marrowextrakt für nur 400 Goldmünzen verkaufen."
            },
            {
                "progress": 51,
                "logText": "Ich habe mit Mazeg in der Blackwater Mountain Siedlung gesprochen. Er würde mir Lyson Marrowextrakt für 800 Goldmünzen verkaufen."
            },
            {
                "progress": 55,
                "logText": "Ich habe etwas Lyson Marrowextrakt von Mazeg gekauft. Ich sollte nach Remgard zurückkehren und es Hjaldar geben."
            },
            {
                "progress": 60,
                "logText": "Hjaldar dankte mir für das Lyson Marrowextrakt, dass ich ihm gebracht habe.",
                "rewardExperience": 15000
            },
            {
                "progress": 61,
                "logText": "Hjaldar kann jetzt wieder Tränke herstellen, und er würde gern mit mir handeln. Er gab mir sogar ein paar seiner ersten Tränke, die er zubereitet hatte. Ich sollte die Elwille sisters hier in Remgard wieder besuchen und ihnen einen Trank der Treffsicherheit zeigen."
            },
            {
                "progress": 70,
                "logText": "Ich habe Elwyl einen Trank der Treffsicherheit gegeben."
            },
            {
                "progress": 71,
                "logText": "Bedauerlicherweise haben ihre Zankereien nicht aufgehört. Im Gegensatz, sie scheinen noch wütender aufeinander zu sein, da sie bei der Farbe beide falsch lagen.",
                "rewardExperience": 9000,
                "finishesQuest": 1
            }
        ]
    }
]
