[
    {
        "id": "erinith",
        "name": "Tiefe Wunde",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Nordöstlich von Crossglen habe ich Erinith gefunden, der hilflos in den Büschen lag. Offensichtlich wurde er nachts angegriffen und verwundet. Dabei hat er ein wertvolles Buch verloren."
            },
            {
                "progress": 20,
                "logText": "Ich habe Erinith versprochen, das Buch für ihn zu finden. Er meinte, dass er es zwischen ein paar Bäume nördlich von seinem Lager geworfen hätte."
            },
            {
                "progress": 21,
                "logText": "Ich habe mit Erinith vereinbart, für 200 Goldmünzen das Buch für ihn zu finden. Er meinte, dass er es zwischen ein paar Bäume nördlich von seinem Lager geworfen hätte."
            },
            {
                "progress": 30,
                "logText": "Ich habe das Buch zu Erinith zurückgebracht.",
                "rewardExperience": 2000
            },
            {
                "progress": 31,
                "logText": "Erinith braucht auch noch Hilfe mit seiner Verwundung, die einfach nicht verheilt. Ich soll ihm entweder einen großen Heiltrank oder vier normale Heiltränke bringen, das sollte die Wunde schließen."
            },
            {
                "progress": 40,
                "logText": "Ich habe Erinith einen Knochenmehltrank gegeben. Er zögerte ein wenig, weil die Verwendung durch Lord Geomyr verboten ist."
            },
            {
                "progress": 41,
                "logText": "Ich habe Erinith einen großen Heiltrank zur Versorgung seiner Wunde gebracht."
            },
            {
                "progress": 42,
                "logText": "Ich habe Erinith vier normale Heiltränke zur Versorgung seiner Wunde gebracht."
            },
            {
                "progress": 50,
                "logText": "Die Wunde heilte vollständig und Erinith dankte mir herzlich für all die Hilfe.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "hadracor",
        "name": "Verwüstetes Land",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Auf der Straße nach Carn Tower, westlich der Wachstube von Crossroads, bin ich auf einige Holzfäller gestoßen. Ihr Anführer Hadracor möchte, dass ich mich um ein paar Wespen kümmere, die sie immer bei ihren Arbeiten stören. Ich soll nach Riesenwespen in der Nähe des Holzfällerlagers suchen und mindestens 5 Flügel von Riesenwespen als Beweis für meine 'Arbeit' zu Hadracor bringen."
            },
            {
                "progress": 20,
                "logText": "Ich habe Hadracor fünf Riesenwespenflügel gebracht."
            },
            {
                "progress": 21,
                "logText": "Ich habe Hadracor sechs Riesenwespenflügel gebracht. Für die Hilfe gab er mir ein paar Handschuhe."
            },
            {
                "progress": 30,
                "logText": "Hadracor dankte mir für die Hilfe mit den Wespen. Er bot mir einige Waren zum Handeln an.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "tinlyn",
        "name": "Verlorene Schafe",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Auf der Straße nach Feygard, nahe der Brücke von Feygard, traf ich den Schafhirten Tinlyn. Er beklagte, das vier seiner Schafe entwischt seinen, er sich aber nicht traue, die übrigen Tiere bei der Suche nach den Entflohenen unbeaufsichtigt zu lassen."
            },
            {
                "progress": 15,
                "logText": "Ich habe Tinlyn Hilfe bei der Suche nach den vier Schafen versprochen."
            },
            {
                "progress": 20,
                "logText": "Ich habe eines von Tinlyn's verlorenen Schafen gefunden."
            },
            {
                "progress": 21,
                "logText": "Ich habe eines von Tinlyn's verlorenen Schafen gefunden."
            },
            {
                "progress": 22,
                "logText": "Ich habe eines von Tinlyn's verlorenen Schafen gefunden."
            },
            {
                "progress": 23,
                "logText": "Ich habe eines von Tinlyn's verlorenen Schafen gefunden."
            },
            {
                "progress": 25,
                "logText": "Ich habe nun alle vier verlorenen Schafe von Tinlyn gefunden."
            },
            {
                "progress": 30,
                "logText": "Tinlyn dankte mir für die Suche nach seinen Schafen.",
                "rewardExperience": 3500,
                "finishesQuest": 1
            },
            {
                "progress": 31,
                "logText": "Tinlyn dankte mir für die Suche nach seinen Schafen, aber er hatte leider keine Belohnung für mich.",
                "rewardExperience": 2000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Ich habe eines von Tinlyn's Schafen angegriffen. Nun kann ich ihm nicht mehr alle Schafe zurückbringen.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "benbyr",
        "name": "Schlachtung",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich traf Benbyr vor der Wachstube von Crossroads. Er möchte sich an seinem alten 'Geschäftspartner' Tinlyn rächen. Benbyr will, dass ich alle Schafe von Tinlyn abschlachte."
            },
            {
                "progress": 20,
                "logText": "Ich habe versprochen, für Benbyr alle acht Schafe von Tinlyn zu finden und zu töten. Ich soll auf den Feldern nordwestlich von der Wachstube Ausschau nach ihnen halten."
            },
            {
                "progress": 21,
                "logText": "Ich habe mit der Schlachtung begonnen. Wenn ich alle acht Schafe getötet habe, sollte ich zu Benbyr zurückkehren."
            },
            {
                "progress": 30,
                "logText": "Benbyr war begeistert zu hören, dass Tinlyn's Schafe tot sind.",
                "rewardExperience": 5200,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Ich habe es abgelehnt, für Benbyr wehrlose Schafe abzuschlachten.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "rogorn",
        "name": "Der Weg liegt klar vor mir",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Vom Turm der Wachstube von Crossroads aus hat Minarra ein paar Gauner beobachtet, die nach Westen Richtung Carn Tower schlichen. Minarra glaubt, dass es sich bei den Typen um Verbrecher handelt, auf die in Feygard ein Kopfgeld ausgesetzt wurde. Wenn das wahr ist, werden diese Männer von einem besonders rücksichtslosen Rohling namens Rogorn angeführt."
            },
            {
                "progress": 20,
                "logText": "Ich helfe Minarra bei der Suche nach den Schurken. I soll auf der Straße westlich von der Wachstube in Richtung Carn Tower reisen und nach ihnen Ausschau halten. Sie haben angeblich drei Teile eines wertvollen Gemäldes gestohlen und sollen für ihre Verbrechen hingerichtet werden."
            },
            {
                "progress": 21,
                "logText": "Minarra hat mir auch gesagt, dass ich ihnen auf keinen Fall trauen dürfe, egal was sie sagen. Besonders die Worte von Rogorn sollten mit äußerster Skepsis beurteilt werden."
            },
            {
                "progress": 30,
                "logText": "Ich habe die Bande auf der Straße nach Carn Tower aufgespürt und sie wird wie erwartet von Rogorn angeführt."
            },
            {
                "progress": 35,
                "logText": "Rogorn erzählte mir, dass er und seine Leute zu Unrecht wegen Mord und Diebstahl in Feygard beschuldigt werden, den keiner von ihnen war jemals in Feygard gewesen."
            },
            {
                "progress": 40,
                "logText": "Ich habe beschlossen, Rogorn und seine Kumpane anzugreifen. Wenn sie tot sind, werde ich mit den drei Teilen des Gemäldes zu Minarra zurückkehren."
            },
            {
                "progress": 45,
                "logText": "Ich habe beschlossen, Rogorn und seine Kumpane am Leben zu lassen und stattdessen Minarra zu berichten, dass sie sich geirrt haben müsse."
            },
            {
                "progress": 50,
                "logText": "Minarra bedankte sich bei mir für das Ergreifen der Diebe. Sie versprach mir, dass meine Dienste für Feygard gewürdigt werden würden."
            },
            {
                "progress": 55,
                "logText": "Nachdem ich Minarra gesagt habe, dass sie die Männer mit jemand anderem verwechselt habe, schien sie etwas misstrauisch, dankte mir aber für meine Hilfe in der Sache."
            },
            {
                "progress": 60,
                "logText": "Ich habe Minarra bei ihrer Aufgabe unterstützt.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "feygard_shipment",
        "name": "Botengang für Feygard",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe Gandoren, den Hauptmann der Garde in der Wachstube von Crossroads getroffen. Er erzählte mir von einigen Schwierigkeiten in Loneford, welche die Wachleute zu erhöhter Wachsamkeit zwingen. Aus diesem Grund haben sie keine Zeit für ihre gewöhnlichen Botengänge und könnten da ein wenig Hilfe gebrauchen."
            },
            {
                "progress": 20,
                "logText": "Gandoren möchte, dass ich eine Lieferung von 10 Eisenschwerter zu einem Gardeposten im Süden bringe."
            },
            {
                "progress": 21,
                "logText": "Ich habe zugestimmt, die Lieferung für Gandoren zu übernehmen, als Dienst an Feygard."
            },
            {
                "progress": 22,
                "logText": "Ich habe widerwillig zugestimmt, die Lieferung für Gandoren zu übernehmen."
            },
            {
                "progress": 25,
                "logText": "Ich soll die Lieferung zum Hauptmann der Patrouille bringen, die in der Taverne 'Schäumende Flasche' stationiert ist."
            },
            {
                "progress": 26,
                "logText": "Gandoren sagte mir, dass Ailshara Interesse an den Lieferungen von Feygard bekundet hat und drängte mich, Abstand von ihr zu halten."
            },
            {
                "progress": 30,
                "logText": "Ailshara ist in der Tat an der Lieferungen interessiert und möchte, dass ich Nor City mit den Lieferungen helfe."
            },
            {
                "progress": 35,
                "logText": "Wenn ich Ailshara und Nor City helfen möchte, soll ich die Lieferung stattdessen zum Schmied in Vilegard bringen."
            },
            {
                "progress": 50,
                "logText": "Ich habe die Lieferung zum Hauptmann der Patrouille in der Taverne 'Schäumende Flasche' gebracht. Ich sollte Gandoren in der Wachstube von Crossroads mitteilen, das die Lieferung erfolgt ist."
            },
            {
                "progress": 55,
                "logText": "Ich habe die Lieferung beim Schmied in Vilegard abgegeben."
            },
            {
                "progress": 56,
                "logText": "Der Schmied von Vilegard hat mir eine Lieferung von minderwertigen Schwertern mitgegeben, die ich beim Hauptmann der Patrouille in der Taverne 'Schäumende Flasche' statt der normalen Schwerter abliefern kann."
            },
            {
                "progress": 60,
                "logText": "Ich habe die Lieferung mit den minderwertigen Schwertern zum Hauptmann der Patrouille in der Taverne 'Schäumende Flasche' gebracht. Ich sollte Gandoren mitteilen, das die Lieferung erfolgt ist."
            },
            {
                "progress": 80,
                "logText": "Gandoren dankte mir für die Hilfe bei der Lieferung der Waffen.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            },
            {
                "progress": 81,
                "logText": "Gandoren dankte mir für die Hilfe bei der Lieferung der Waffen. Er hat nichts gemerkt. Ich sollte nun auch Ailshara berichten."
            },
            {
                "progress": 82,
                "logText": "Ich habe Ailshara von der Lieferung berichtet.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "loneford",
        "name": "Es fließt durch die Adern",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ich habe eine Geschichte über Loneford gehört. Offenbar wurden dort in der letzten Zeit viele Menschen krank, einige sind sogar gestorben. Die Ursache ist immer noch unbekannt."
            },
            {
                "progress": 11,
                "logText": "Ich sollte herausbekommen, was die Leute aus Loneford krank gemacht haben könnte. Um Hinweise zu sammeln sollte ich die Einwohner von Loneford und der näheren Umgebung nach möglichen Ursachen befragen."
            },
            {
                "progress": 21,
                "logText": "Die Wächter aus der Wachstube von Crossroads sind sich sicher, dass die Krankheit in Loneford durch einen Anschlag der Priester oder durch Leute aus Nor City ausgelöst wurde."
            },
            {
                "progress": 22,
                "logText": "Einige Dorfbewohner aus Loneford glauben, dass die Krankheit durch die Wachen aus Feygard verursacht wurde - als Teil eines Plans, die Leute noch mehr leiden zu lassen."
            },
            {
                "progress": 23,
                "logText": "Talion, der Priester aus Loneford denkt, dass die Krankheit ein Werk des Schattens ist - als Strafe für Loneford's mangelnde Hingabe an den Schatten."
            },
            {
                "progress": 24,
                "logText": "Taevinn aus Loneford ist sicher, dass Sienn in der Scheune im Südosten irgendetwas mit der Krankheit zu tun hat. Offenbar hält Sienn ein Haustier, durch das sich Taevinn schon mehrmals bedroht fühlte."
            },
            {
                "progress": 25,
                "logText": "Ich sollte nach Landa in der Taverne von Loneford sehen. Gerüchten zufolge solle er etwas gesehen haben, das er sich niemandem zu erzählen traut."
            },
            {
                "progress": 30,
                "logText": "Landa verwechselte mich zunächst mit jemandem. Er behauptet, einen kleinen Jungen gesehen zu haben, der in der Nacht, bevor sich die Krankheit ausbreitete um den Dorfbrunnen schlich und irgendetwas machte. Er hatte zuerst Angst mit mir zu sprechen, weil ich dem Jungen den er gesehen hat sehr ähnlich bin. Könnte der Junge, den er gesehen hat, vielleicht Andor gewesen sein?"
            },
            {
                "progress": 31,
                "logText": "Außerdem hat er in der Nacht, als er den Jungen am Brunnen gesehen hatte, Buceth dabei beobachtet, wie dieser Proben des Brunnenwassers genommen hat. Verdächtigerweise ist Buceth auch nicht krank geworden wie die anderen im Dorf."
            },
            {
                "progress": 35,
                "logText": "Ich sollte Buceth in der Kapelle von Loneford aufsuchen und ihn danach fragen, was er am Brunnen gemacht hat. Vielleicht weiß er auch etwas über Andor."
            },
            {
                "progress": 41,
                "logText": "Ich habe Buceth bestochen, damit er mit mir redet."
            },
            {
                "progress": 42,
                "logText": "Ich habe Buceth erzählt, dass ich bereit bin, dem Schatten zu folgen."
            },
            {
                "progress": 45,
                "logText": "Buceth erzählte mir, dass er von den Priestern aus Nor City beauftragt worden war sicherzustellen, dass der Schatten sein Leuchten über Loneford ausbreiten kann. Offenbar haben die Priester einen Jungen geschickt, um etwas in Loneford zu erledigen und Buceth damit beauftragt, einige Wasserproben zu nehmen."
            },
            {
                "progress": 50,
                "logText": "Ich habe Buceth angegriffen. Ich sollte die Beweise von Buceth zu Kuldan, den Hauptmann der Wache im Langhaus von Loneford bringen."
            },
            {
                "progress": 54,
                "logText": "Ich habe das Fläschchen, das Buceth bei sich hatte zu Kuldan, dem Hauptmann der Wache in Loneford gebracht."
            },
            {
                "progress": 55,
                "logText": "Kuldan dankte mir für das Lösen des Rätsels um die mysteriöse Krankheit in Loneford. Sie werden nun Wasser aus Feygard importieren, anstatt es aus dem Brunnen zu schöpfen. Er sagte mir auch, dass ich den Haushofmeister in der Burg von Feygard besuchen soll, wenn ich noch mehr helfen will.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Ich habe Buceth versprochen, sein Geheimnis zu hüten. Wenn Andor wirklich hier war, muss er einen guten Grund dafür gehabt haben. Buceth sagt mir auch, dass ich den Hüter der Kapelle in Nor City besuchen soll, um mehr über den Schatten zu erfahren.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            }
        ]
    }
]
