[
    {
        "id": "erinith",
        "name": "Глубокая рана",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Северо-восточнее Одинокого Креста, я встретил Эринит, разбившего лагерь. Судя по всему, на него напали ночью и он потерял книгу."
            },
            {
                "progress": 20,
                "logText": "Я готов помочь Эринит в поисках книги. По его словам, он потерял  ее в радиусе нескольких деревьев от лагеря, возможно, к северу от своей стоянки."
            },
            {
                "progress": 21,
                "logText": "Я готов помочь Эринит в поисках книги за 200 золотых. По его словам, он потерял  ее в радиусе нескольких деревьев от лагеря, возможно, к северу от своей стоянки."
            },
            {
                "progress": 30,
                "logText": "Я вернул книгу Эринит.",
                "rewardExperience": 2000
            },
            {
                "progress": 31,
                "logText": "Ему также требуется помощь с ранами, которые никак не заживают. Ему нужна большое зелье здоровья или же четыре стандартных."
            },
            {
                "progress": 40,
                "logText": "Я дал Эринит зелье из костной муки для лечения ран. Его слегка напугало использование запрещенного лордом Геомиром зелья."
            },
            {
                "progress": 41,
                "logText": "Я дал Эринит большое зелье здоровья для излечения ран."
            },
            {
                "progress": 42,
                "logText": "Я дал Эринит четыре обычных зелья здоровья для излечения ран."
            },
            {
                "progress": 50,
                "logText": "Раны затянулись и Эринит поблагодарил меня за помощь.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "hadracor",
        "name": "Пустошь",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "По дороге к Башне Плоти, к западу от поста на перекрестке, я встретил группу дровосеков под предводительством Хадракора. Хадракору нужна помощь в отмщении нескольким осам, которые напали на его людей, когда они валили лес. чтобы помочь им отомстить, Мне придется искать больших ос неподалеку от бивака доровосеков и принести Хадракору пять осиных жал. "
            },
            {
                "progress": 20,
                "logText": "Я принес пять гигантских осиных жал Хадракору."
            },
            {
                "progress": 21,
                "logText": "Я принес шесть гигантских осиных жал Хадракору. За помощь он наградил меня парой рукавиц."
            },
            {
                "progress": 30,
                "logText": "Хадракор поблагодарил меня за помощь ему и остальным дровосекам. Также, он пообещал торговать со мной.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "tinlyn",
        "name": "Потерянная овца",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "По дороге в Фейгард, неподалеку от Фейгардского моста, я встретил пастуха по имени Тинлин. Тот пожаловался, что четыре его овцы сбежали и не собираются возвращаться. И он не может отлучиться на их поиски."
            },
            {
                "progress": 15,
                "logText": "Я согласился помочь Тинлину найти четырех овец."
            },
            {
                "progress": 20,
                "logText": "Я нашел одну из потеряных овец."
            },
            {
                "progress": 21,
                "logText": "Я нашел одну из потеряных овец."
            },
            {
                "progress": 22,
                "logText": "Я нашел одну из потеряных овец."
            },
            {
                "progress": 23,
                "logText": "Я нашел одну из потеряных овец."
            },
            {
                "progress": 25,
                "logText": "Я нашел всех потеряных овец."
            },
            {
                "progress": 30,
                "logText": "Тинлин поблагодарил меня за находку.",
                "rewardExperience": 3500,
                "finishesQuest": 1
            },
            {
                "progress": 31,
                "logText": "Тинлин поблагодарил меня за поиски пропавших овец, но ничем не вознаградил.",
                "rewardExperience": 2000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "На меня напала одна из бешеных овец Тинлина и теперь я не смогу вернуть всех четырех ему.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "benbyr",
        "name": "Обкорнали",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Я встретил Бенбира возле Поста на Перекрестке. Он хотел свести счеты со старым 'бизнес-партнером', Тинлином. Бенбир просит убить всех овец Тинлина."
            },
            {
                "progress": 20,
                "logText": "Я согласился помочь Бенбиру найти тинлиновских овец и убить восемь из них. Найти их можно серверо-западнее Поста на Перекрестке."
            },
            {
                "progress": 21,
                "logText": "Я стал бросаться на овец. Я смогу вернуться к Бенбиру, когда убью их восемь."
            },
            {
                "progress": 30,
                "logText": "Бенбир был взволнован известием, что все овцы Тинлина мертвы.",
                "rewardExperience": 5200,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Я отказался помогать убивать овец для Бенбира.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "rogorn",
        "name": "В светлый путь",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Минарра на вершине башни Поста на Перекрестке видела банду разбойников, идущих от поста к Башне Плоти. Минарра уверена, что они похожи по приметам на людей, чьих голов ждет патруль Фейгарда. Если это - те самые люди, то их предводительствует исключительно безжалостный дикарь по имени Рогорн."
            },
            {
                "progress": 20,
                "logText": "Я помогу Минарре найти банду грабителей. Мне просто нужно совершить путешествие по дороге от Поста на Перекрестке до Башни Плоти и искать их. Есть также подозрение, что они украли три части ценной картины и достойны смерти за свои преступления."
            },
            {
                "progress": 21,
                "logText": "Минарра также посоветовала не верить ничему из того, что я от них услышу. А особенно - от Рогорна."
            },
            {
                "progress": 30,
                "logText": "Я нашел банду разбойников на западной дороге, ведущей к Башне Плоти, предводительствуемых Рогорном."
            },
            {
                "progress": 35,
                "logText": "Рогорн рассказал мне, что был облыжно обвинен в убийстве и воровстве в Фейгарде, несмотря на то, что в Фейгарде не бывал."
            },
            {
                "progress": 40,
                "logText": "Я решил напасть на Рогорна и его банду. Я должен вернуться к Минарре с тремя частями ценной живописи, как только они умрут."
            },
            {
                "progress": 45,
                "logText": "Я решил не нападать на Рогорна и его банду разбойников, вместо этого я доложил Минарре что она, должно быть, обозналась."
            },
            {
                "progress": 50,
                "logText": "Минарра поблагодарила меня за разрешение вопроса с ворами и сказала, что моя служба для дела Фейгарда будет оценена по достоинству."
            },
            {
                "progress": 55,
                "logText": "После слов об ошибочности поспешных выводов о людях, Минарра стала подозрительной, но все таки поблагодарила  за поддержку."
            },
            {
                "progress": 60,
                "logText": "Я помог Минарре.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "feygard_shipment",
        "name": "Фейгардские поручения",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Я встретил Гандорена, капитана стражи Поста на Перекрестке. Он рассказал мне о проблеме в Одиноком Броде, заставляющей стражников бдить больше обычного. По этой причине они не в состоянии выполнять часть обязанностей самостоятельно, им необходима помощь в самых обычных делах."
            },
            {
                "progress": 20,
                "logText": "Гандорен попросил меня доставить груз из десяти железных мечей на южный пост."
            },
            {
                "progress": 21,
                "logText": "Я согласился доставить груз ради возможности послужить Фейгарду."
            },
            {
                "progress": 22,
                "logText": "Испытывая некоторое неудовольствие, я все же согласился доставить груз."
            },
            {
                "progress": 25,
                "logText": "Я должен доставить груз капитану фейгардского патруля, остановившемуся в таверне 'Пенная Фляга'."
            },
            {
                "progress": 26,
                "logText": "Гандорен предупредил меня, что в грузе заинтересована некая Айлшара и попросил держаться подальше от нее."
            },
            {
                "progress": 30,
                "logText": "Айлшара  действительно была заинтересована в грузе и предложила вместо патруля оказать помощь Норсити."
            },
            {
                "progress": 35,
                "logText": "Если я захочу помочь Айлшаре, мне следует доставить груз кузнецу в Вильгард."
            },
            {
                "progress": 50,
                "logText": "Я доставил груз капитану патруля в Пенную Флягу. Далее мне следует доложить Гандорену с Поста на Перекрестке, что груз доставлен."
            },
            {
                "progress": 55,
                "logText": "Я доставил груз кузнецу в Вильгард."
            },
            {
                "progress": 56,
                "logText": "Кузнец Вильгарда дал мне кучу металлолома, которую я должен отдать капитану патруля вместо вооружения."
            },
            {
                "progress": 60,
                "logText": "Я доставил металлолом капитану патруля. Я должен доложить Гандорену с Поста на Перекрестке, что груз доставлен."
            },
            {
                "progress": 80,
                "logText": "Гандорен поблагодарил меня за помощь в доставке.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            },
            {
                "progress": 81,
                "logText": "Гандорен поблагодарил меня за доставку груза. он никогда ничего не заподозрит. Мне следует доложиться и Айлшаре."
            },
            {
                "progress": 82,
                "logText": "Я доложил и Айлшаре.",
                "rewardExperience": 4000,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "loneford",
        "name": "Что течет по венам?",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Я услышал историю Одинокого Брода. Внезапно множество жителей заболели и некоторые даже умерли. Причина осталась неизвестной."
            },
            {
                "progress": 11,
                "logText": "Необходимо определить причину заболевания в Одиноком Броде. Для этого стоит опросить местных и окрестных жителей о возможных причинах."
            },
            {
                "progress": 21,
                "logText": "Стража Поста на Перекрестке уверена, что болезнь вызвана действиями священников и жителей Норсити."
            },
            {
                "progress": 22,
                "logText": "Некоторые сельчане Одинокого Брода уверены, что болезнь принесла стража из Фейгарда, дабы заставить людей страдать больше, нежели обычно."
            },
            {
                "progress": 23,
                "logText": "Талион, священник часовни Одинокого Брода, думает, что болезнь - дело рук Тени, наказание за отсутствие набожности."
            },
            {
                "progress": 24,
                "logText": "Таевинн в Одиноком Броде подозревает Сьенна в юго-восточном сарае в причастности к эпидемии. Тем более, что Сьенн держит домашнюю скотину, несмотря на угрозы и протесты Таевинна."
            },
            {
                "progress": 25,
                "logText": "В первую очередь, мне необходимо увидеть Ланду в таверне Одинокого Брода. Ходят слухи, что он видел чтото, что не может доверить никому."
            },
            {
                "progress": 30,
                "logText": "Ланда поначалу спутал меня с кем-то. Он видел маленького мальчика, болтавшегося вокруг города как раз перед началом эпидемии. Поначалу он боялся со мной говорить, поскольку я был на похож на того парня.Быть может, он видел Эндора?"
            },
            {
                "progress": 31,
                "logText": "Ночью, после того, как он увидел мальчика, он также видел Букеза, берущего пробу воды из колодца. Что странно, Букез так и не заболел, в отличии от остальных жителей."
            },
            {
                "progress": 35,
                "logText": "Я должен задать пару вопросов Букезу в часовне о том, что же он делал возле колодца и не знает ли он чего-нибудь об Эндоре."
            },
            {
                "progress": 41,
                "logText": "Я заплатил Букезу за разговор со мной."
            },
            {
                "progress": 42,
                "logText": "Я сказал Букезу, что готов последовать за Тенью."
            },
            {
                "progress": 45,
                "logText": "Букез рассказал, что был послан священниками Норсити убедиться в победном шествии учения Тени в Одиноком Броде. Одновременно, они послали с каким то делом туда же мальчишку, Букезу же дали в нагрузку задание набрать проб воды из колодца."
            },
            {
                "progress": 50,
                "logText": "Я напал на Букеза. Мне нужны доказательства его причастности, чтобы представить их Кулдану, капитану стражи Одинокого Брода."
            },
            {
                "progress": 54,
                "logText": "Я отдал флакон, найденный у Букеза Кулдану."
            },
            {
                "progress": 55,
                "logText": "Кулдан поблагодарил меня за раскрытие тайны эпидемии. Он начал поставку воды из Фейгарда  взамен воды из местного колодца. Кулдан также рекомендовал мне посетить замок Фейгарда, если я захочу помогать в дальнейшем.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            },
            {
                "progress": 60,
                "logText": "Я пообещал хранить историю Букеза в секрете. Если Эндор замешан в ней, он должен был иметь весомую причину. Букез же посоветовал навестить часовню хранителя в Норсити, если я захочу узнать больше о Тени.",
                "rewardExperience": 15000,
                "finishesQuest": 1
            }
        ]
    }
]
