[
    {
        "id": "bwm_agent",
        "name": "Тайный агент и чудовище",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Я встретил человека, ищущего помощи для своей деревни 'Черноводная Гора'. Предположительно, на его деревню нападают чудовища и бандиты и жители нуждаются в помощи извне."
            },
            {
                "progress": 5,
                "logText": "Я готов помочь человеку и 'Черноводной Горе' разобраться с проблемой."
            },
            {
                "progress": 10,
                "logText": "Мы встретимся у заброшеной шахты. Он проползет через ствол шахты, а я спущусь вслед за ним."
            },
            {
                "progress": 20,
                "logText": "Я пробрался через шахту и встретил его с другой стороны.Он был встревожен и  назначил новую встречу возле горы на востоке."
            },
            {
                "progress": 25,
                "logText": "Я услышал историю о Приме и деревне 'Черноводная Гора', бьющихся друг с другом."
            },
            {
                "progress": 30,
                "logText": "Я должен следовать горной тропе на пути к Черноводной деревне."
            },
            {
                "progress": 40,
                "logText": "Я встретил человека снова на моем пути к Черноводной Горе. Мне предстоит прдолжать подниматься на гору."
            },
            {
                "progress": 50,
                "logText": "Я сделал это. Сквозь и через заснеженые склоны Черноводной Горы. Человек говорил, что мне необходимо преодолеть ее. Следовательно, деревня Черноводная Гора почти достигнута. "
            },
            {
                "progress": 60,
                "logText": "Я дошел до поселения возле Черноводной Горы. Осталось поговорить с их атаманов Харленн."
            },
            {
                "progress": 65,
                "logText": "Я поговорил с Харленн в поселении. Судя по всему, оно подвергается атаке множеством монстров, Аулэтом и белыми червями. Но даже это - ничто в сравнении с нападениями людей Прима."
            },
            {
                "progress": 66,
                "logText": "Харленн думает, что жители Прима стоят за атаками чудовищ."
            },
            {
                "progress": 70,
                "logText": "Харленн хочет послать меня с сообщением к Гутберду в Прим.Если примовцы не прекратят атаки на Черноводную, к ним будут приняты меры. Я иду говорить с Гутбердом в Прим."
            },
            {
                "progress": 80,
                "logText": "Гутберд запретил своим людям помогать чудовищам. Я возвращаюсь доложить Харленн."
            },
            {
                "progress": 90,
                "logText": "Харленн уверена, что примовцы все еще помогают монстрам."
            },
            {
                "progress": 95,
                "logText": "Харленн посылает меня в Прим проверить, готовятся ли там к нападению на деревню. Необходимо искать подсказки возле Гутберда."
            },
            {
                "progress": 100,
                "logText": "Я нашел несколько планов про наем солдат и нападение на поселение возле Черноводной. Возвращаюсь немедленно доложить Харленн."
            },
            {
                "progress": 110,
                "logText": "Харленн благодарит меня за разведку.",
                "rewardExperience": 1150
            },
            {
                "progress": 120,
                "logText": "Чтоб прекратить нападения на Черноводную, Харленн заказала мне убийство Гутберда."
            },
            {
                "progress": 130,
                "logText": "Я начал сражаться с Гутбердом."
            },
            {
                "progress": 131,
                "logText": "Я рассказал Гутберду, что послан убить его, но оставлю его в живых. Он горячо поглагодарил меня и покинул Прим.",
                "rewardExperience": 2100
            },
            {
                "progress": 149,
                "logText": "Я доложил Харленн об уходе Гутберда."
            },
            {
                "progress": 150,
                "logText": "Харленн поблагодарила меня за помощь. Хочется надеяться, нападения на деревню возле Черноводной теперь прекратятся.",
                "rewardExperience": 5000
            },
            {
                "progress": 240,
                "logText": "Я теперь доверенное лицо в окрестностях Черноводной Горы и могу пользоваться всем, что мне могут предоставить.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Я не смогу помочь людям поселения у Черноводной Горы.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "С тех пор, как я помогаю Приму, Харленн не разговаривает со мной.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_innquest",
        "name": "Хорошо отдохнувший.",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Я поговорил с поваром в Приме у основания Черноводной Горы. Задняя комната сдается, но занята неким Архестом. Схожу, спрошу у него, не раздумал ли он снимать ее. Повар, к тому же, посоветовал юго-запад Прима."
            },
            {
                "progress": 20,
                "logText": "Архест не желает съезжать из комнаты. Но сказал, что почти убежден в возможности использования мной комнаты за соответствующую плату."
            },
            {
                "progress": 30,
                "logText": "Архест нуждается в пяти бутылках молока. Пожалуй, я смогу отыскать его в окрестных деревнях."
            },
            {
                "progress": 40,
                "logText": "Принес молоко Архесту. Он разрешил пользоваться его комнатой, я могу в ней отдыхать. Следует еще поговорить с гостиничным поваром.",
                "rewardExperience": 500
            },
            {
                "progress": 50,
                "logText": "Я сообщил повару, что Архест разрешил мне пользоваться его комнатой.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "prim_hunt",
        "name": "Туманная цель",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Только по выходу из заброшенной шахты по пути к Черноводной Горе я встретил человека из Прима. Он умолял меня о помощи."
            },
            {
                "progress": 11,
                "logText": "Прим нуждается во внешнем союзнике для отражения атак чудовищ. В связи с этим необходимо переговорить с Гутбердом, если все же я желаю оказать поддержку."
            },
            {
                "progress": 15,
                "logText": "Гутберд находится в ратуше. Мне нужно всего лишь найти каменный дом в центре города."
            },
            {
                "progress": 20,
                "logText": "Мы побеседовали с Гутбердом об истории Прима, который, по его словам, подвергался постоянным нападениям со стороны черноводцев."
            },
            {
                "progress": 25,
                "logText": "Гутберд считает необходимым поговорить с мастером над оружием Черноводной Горы Харленн на тему 'почему (или зачем) они призывают горнодских чудовищ против Прима'."
            },
            {
                "progress": 30,
                "logText": "Я поговорил с Харленн о нападениях на Прим. Она запретила своим людям в Черноводной Горе даже думать о Приме. Я возвращаюсь с докладом к Гутберду."
            },
            {
                "progress": 40,
                "logText": "Гутберд все еще пребывает в уверенности, что люди Черноводной причастны к нападениям."
            },
            {
                "progress": 50,
                "logText": "Гутберд посылает меня найти факты подготовки большого нападения на Прим со стороны Черноводной. Мне следует искать возле штаба Харленн, оставаясь незамеченным."
            },
            {
                "progress": 60,
                "logText": "Возле штаба Харленн я нашел план нападения на Прим. Немедленно возвращаюсь доложить Гутберду."
            },
            {
                "progress": 70,
                "logText": "Гутберд поблагодарил меня на помощь в нахождении доказательств агрессивных намерений соседей.",
                "rewardExperience": 1150
            },
            {
                "progress": 80,
                "logText": "В целях прекращения нападений на Прим, Гутберд заказал мне голову Харленн."
            },
            {
                "progress": 90,
                "logText": "Я начал сражаться с Харленн."
            },
            {
                "progress": 91,
                "logText": "Я сказал Харленн, что послан убить его, но позволю ему жить. Он горячо поблагодарил меня и покинул поселение.",
                "rewardExperience": 2100
            },
            {
                "progress": 99,
                "logText": "Я доложил Гутберду, что Харленн больше нет."
            },
            {
                "progress": 100,
                "logText": "Гутберд поблагодарил меня за помощь Приму. Есть надежда, что нападения на Прим теперь прекратятся. В качестве благодарности он подарил мне кое-какие вещи и обещал радушный прием на будущее, так что я смогу пользоваться гостиницей в поселении Черноводная Гора.",
                "rewardExperience": 5000
            },
            {
                "progress": 140,
                "logText": "Я показал знак 'Радушный прием' охраннику и получил беспрепятственный вход в гостиничную комнату."
            },
            {
                "progress": 240,
                "logText": "Я теперь - доверенное лицо в Приме и могу пользоваться всеми службами.",
                "finishesQuest": 1
            },
            {
                "progress": 250,
                "logText": "Я решил не помогать населению Прима.",
                "finishesQuest": 1
            },
            {
                "progress": 251,
                "logText": "С тех пор, как я работаю в поселении Черноводной Горы, Гутберд не разговаривает со мной.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kazaul",
        "name": "Огни в темноте",
        "showInLog": 1,
        "stages": [
            {
                "progress": 8,
                "logText": "Я проделал путь до гостиничного номера и обнаружил лидера группы магов, человека по имени Тродна."
            },
            {
                "progress": 9,
                "logText": "Тродна очень заинтересовано в ком-то (или в чем-то), именуемом Казаул, и в содержании ритуала, называемого этим именем."
            },
            {
                "progress": 10,
                "logText": "Я готов помочь Тродну найти сведения о ритуале, в частях манускрипта, разбросанного по частям в районе гор. Части ритуала Казаул слудует искать на горной тропе от Черноводной горы к Приму."
            },
            {
                "progress": 11,
                "logText": "Мне необходимо найти две части заклинания и три части, описывающие сам ритуал, и вернуться к Тродну, как только отыщу все."
            },
            {
                "progress": 21,
                "logText": "Я нашел первую половину заклинания Казаульского ритуала."
            },
            {
                "progress": 22,
                "logText": "Я нашел вторую половину заклинания Казаульского ритуала."
            },
            {
                "progress": 25,
                "logText": "Я нашел первую часть описания Казаульского ритуала.."
            },
            {
                "progress": 26,
                "logText": "Я нашел вторую часть описания Казаульского ритуала."
            },
            {
                "progress": 27,
                "logText": "Я нашел третью часть описания Казаульского ритуала."
            },
            {
                "progress": 30,
                "logText": "Тродна поблагодарил меня за найденные осколки древнего знания.",
                "rewardExperience": 3600
            },
            {
                "progress": 40,
                "logText": "Тродна просит меня положить конец размножению Казаулов, имеющему место быть неподалеку от Черноводной Горы. Там должна быть гробница у основания, которую необходимо исследовать."
            },
            {
                "progress": 41,
                "logText": "Мне был выдан пузырек Святой Воды, который необходимо применить в гробнице Казаулов. Мне следует вернуться к Тродну, как только я найду и освящу гробницу."
            },
            {
                "progress": 50,
                "logText": "В гробнице у основания Черноводной Горы я встретил стражника Казаула. Напевом заклинания Казаулов, я смог заставить стражника атаковать меня."
            },
            {
                "progress": 60,
                "logText": "Я освятил гробницу Казаулов.",
                "rewardExperience": 3200
            },
            {
                "progress": 100,
                "logText": "Я увидел несколько форм оценки Тродном моей помощи в изучении ритуала и освящении гробницы. Но он все еще выглядит озабоченным проблемой казаулов. И с этим я ничего не могу поделать.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bwm_wyrms",
        "name": "Нет бессилию!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Херек на втором этаже деревни Черноводная Гора изучает белых змей, обитающих вокруг поселения. По-видимому, некоторые из змей имеют когти. Мне придется поубивать некоторых, чтобы найти их."
            },
            {
                "progress": 20,
                "logText": "Я отдал 5 когтей белых змей Хереку."
            },
            {
                "progress": 30,
                "logText": "Херек закончил изготовление восстановительного зелья, которое очень пригодится в сражениях со змеями в будущем.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bjorgur_grave",
        "name": "Очнувшийся от сна.",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Бьоргур в Приме думает, что кто-то потревожил могилу предков, которая находится юго-западнее Прима, сразу за шахтой."
            },
            {
                "progress": 15,
                "logText": "Бьоргур просит меня проверить гробницу и убедиться, что фамильный кинжал все еще в безопасности в усыпальнице."
            },
            {
                "progress": 20,
                "logText": "Фулус в Приме тоже интересуется кинжалом Бьоргура, которым обладал еще бьоргуровский дед."
            },
            {
                "progress": 30,
                "logText": "Я встретил человека, который держал в руках странно выглядящий кинжал в нижних частях гробницы. Он, должно быть, украл этот кинжал из усыпальницы."
            },
            {
                "progress": 40,
                "logText": "Я положил кинжал на место в усыпальнице. Неупокоенные души теперь менее беспокойны, что достаточно странно.",
                "rewardExperience": 200
            },
            {
                "progress": 50,
                "logText": "Бьоргур поблагодарил меня за помощь. Он сказал мне, что следует также поискать его родственников в Фейгарде.",
                "rewardExperience": 1100,
                "finishesQuest": 1
            },
            {
                "progress": 51,
                "logText": "Я сказал Фулусу, что, помогая Бьоргуру, вернул фамильный клинок на его законное место."
            },
            {
                "progress": 60,
                "logText": "Я отдал кинжал Бьоргура Фулусу. Он поблагодарил меня и вознаградил ... в некоторой степени.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    }
]
