[
    {
        "id": "farrik",
        "name": "Ночной визит",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Фаррик из Гильдии Воров Приюта Падших поведал мне план помощи побегу воров из местной каталажки.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Фаррик из гильдии воров описал мне детали и я согласился помочь ему. У капитана охраны - очевидные проблемы с алкоголем. По плану, я доставляю специальное пойло в тюрьму и даю в виде взятки капитану.",
                "finishesQuest": 0
            },
            {
                "progress": 25,
                "logText": "Я подготовил питье в гильдии воров.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Я говорил Фаррику, что я не совсем согласен. Мне придется рассказать капитану охраны об их сомнительном плане.",
                "finishesQuest": 0
            },
            {
                "progress": 32,
                "logText": "Я облагодетельствовал спецпитьем капитана охраны.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Я сдал капитану охраны воров с их воровским планом освобождения воровских друзей.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Капитан попросил меня сказать ворам, что уровень безопасности будет понижен сегодня ночью. Мы сможем поймать нескольких воров.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Я всучил капитану спецпитье. Его должно свалить с копыт на всю ночь, давая ворам освободить друзей.",
                "finishesQuest": 0
            },
            {
                "progress": 70,
                "logText": "Фаррик наградил меня за помощь воровской гильдии.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            },
            {
                "progress": 80,
                "logText": "Я сообщил Фаррику, что в тюрьме сегодня всю ночь будут хлопать ушами.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Капитан поблагодарил меня за помощь в поимке преступников. Он сказал, что сообщил остальным ведомтсвам охраны, что я - его помощник.",
                "rewardExperience": 1700,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "lodar",
        "name": "Потеряное зелье",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Мне нужно найти травника по имени Лодар.Умар из гильдии воров Приюта Падших считает, что мне необхидимо знать пароль для получения доступа к убежищу Лодара через стражников.",
                "finishesQuest": 0
            },
            {
                "progress": 15,
                "logText": "По мнению Умара, стоило бы повидать некого Огама в Вильгарде. Огам может помочь с составлением правильных слов для доступа к убежищу Лодара.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я заглянул к Огаму на юго-западе Вильгарда. Он говорил загадками. Возможно, я смогу вытянуть из него какие то детали об убежище Лодара. 'Полпути между Тенью и светом. Создания судьбы.' и слова 'Длань Тени.' были среди них. Я не знаю, что они значат.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "vilegard",
        "name": "Доверие и посторонние",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Люди в Вильгарде очень подозрительны к посторонним. Я заподозрил, что мне стоит встретиться с Йолнором в капелле, если я хочу получить их доверие.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я поговорил с Йолнором. Он посоветовал помочь троим людям для повышения моей кармы. И доверия окружающих. Я могу оказать помощь Каори, Врай и, конечно же, Йолнору.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Я помог всем троим по списку, составленному Йолнором. Теперь люди Вильгарда будут доверять мне чуть более.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "kaori",
        "name": "Поручения Каори",
        "showInLog": 1,
        "stages": [
            {
                "progress": 5,
                "logText": "Йолнор в Вильгардской капелле рекомендует поговорить с Каори на севере Вильгарда, вдруг она сможет чем-то помочь.",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "СевероВильгардская Каори хочет 10 доз костной муки.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я принес 10 порций костной муки Каори.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "wrye",
        "name": "Сомнительная причина",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Йолнор в Вильгардской капелле посоветовал перемолвиться с Врай из северного Вильгарда. Она неожиданно вдруг потеряла сына.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "СевероВильгардская Врай рассказала, что ее сын Ринцель потерялся. Она думает, что он умер или же смертельно ранен.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Врай считает, что королевские гвардейцы из Фейгарда замешаны в его исчезновении; возможно, они его завербовали.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Врай просит меня найти причну случившегося с сыном.",
                "finishesQuest": 0
            },
            {
                "progress": 41,
                "logText": "Мне стоит заглянуть в тавернну Вильгарда и в притон 'Пенная Фляга' на севере Вильгарда.",
                "rewardExperience": 200,
                "finishesQuest": 0
            },
            {
                "progress": 42,
                "logText": "Я услышал, что мальчик заглядывал в Пенную Флягу некоторое время назад. Судя по всему, он отправился на запад от притона.",
                "finishesQuest": 0
            },
            {
                "progress": 80,
                "logText": "Северо-западнее Вильгарда я нашел человека, видевшего, как Ринцель бьется с чудовищами. Ринцель, следовательно, покинул Вильгард по своей воле с целью посмотреть на Фейгард. Об этом нужно доложить Врай на севере Вильгарда.",
                "finishesQuest": 0
            },
            {
                "progress": 90,
                "logText": "Я рассказал Врай правду про ее сына.",
                "rewardExperience": 520,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jolnor",
        "name": "Шпионы в пене",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Йолнор из Вильгардской капеллы рассказал мне об охраннике возле Пенной Фляги, он думает, что тот - шпион Фейгардской королевской гвардии. Он просит меня убрать охранника подходящим способом. Таверна находится на севере Вильгарда.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я убедил охранника возле Пенной Фляги уйти после конца смены.",
                "finishesQuest": 0
            },
            {
                "progress": 21,
                "logText": "Я начал сражаться с охранником возле Пенной Фляги. Мне нужно будет посмертно принести его кольцо Йолнору для доказательства его исчезновения.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Я сказал Йолнору, что охранник убрался восвояси.",
                "rewardExperience": 630,
                "finishesQuest": 1
            }
        ]
    }
]
