[
    {
        "id": "andor",
        "name": "Поиски Эндора",
        "showInLog": 1,
        "stages": [
            {
                "progress": 1,
                "logText": "Мой отец, Михаил, говорит, что Эндор не был дома со вчерашнего дня. Я должен поискать его в деревне",
                "finishesQuest": 0
            },
            {
                "progress": 10,
                "logText": "Леонид сказал мне, что он видел Эндора говорящего с Груилем. Я должен пойти спросить Груиля, может он знает больше.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Груиль хочет, чтобы я принес ему ядовитую железу. Тогда он может рассказать больше. Он сказал мне, что некоторые ядовитые змеи имеют такие железы.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Груиль сказал мне, что Эндор искал кого-то называемого Умар. Я должен пойти спросить его друга Гаела в Приюте Падших, на востоке.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Я поговорил с Гаелом в Приюте Падших. Он рассказал что видел Бикуса и спрашивал о гильдии воров.",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Бикус позволил мне пройти в подвал заброшенного дома в Приюте Падших. Я должен поговорить с Умаром.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Умар в Гильдии Воров Приюта Падших узнал меня, но спутал с Эндором. То есть, Эндор виделся с ним.",
                "finishesQuest": 0
            },
            {
                "progress": 55,
                "logText": "Умар сказал мне, что Эндор ушел повидать знахаря по имени Лодар. Мне стоит поискать его убежище.",
                "finishesQuest": 0
            },
            {
                "progress": 61,
                "logText": "Я слышал историю в Одиноком Броде, согласно которой Эндор туда заглядывал и был заподозрен в причастности к болезни, свирепствующей среди населения. Я не уверен, что это действительно был Эндор. Если это был Эндор, почему он заразил жителей?",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_bread",
        "name": "Хлеб для Михаила",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Я должен принести хлеб Михаилу.",
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Михаил просил купить буханку хлеба у Мары в таверне.",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "mikhail_rats",
        "name": "Крысы!",
        "showInLog": 1,
        "stages": [
            {
                "progress": 100,
                "logText": "Убить двух крыс в огороде.",
                "rewardExperience": 20,
                "finishesQuest": 1
            },
            {
                "progress": 10,
                "logText": "Михаил хочет, чтобы я нашел и убил крыс. Потом - могу и вернуться к Михаилу. Будучи раненым, можно отдохнуть в постели для восстановления здоровья",
                "finishesQuest": 0
            }
        ]
    },
    {
        "id": "leta",
        "name": "Пропавший муж",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Лета из деревни Долина Креста хочет, чтобы я поискал ее мужа Оромира.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я нашел Оромира в Долине Креста, он позорно прятался от своей жены Леты.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я выдал Лете Оромира.",
                "rewardExperience": 50,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "odair",
        "name": "Крысиное нашествие",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Одаир хочет, чтобы я очистил пещеру в деревне Долина Креста от крыс. Убив самую большую крысу, я могу вернуться к Одаиру.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я помог Одаиру очистить пещеру от крыс в деревне Долина Креста.",
                "rewardExperience": 300,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bonemeal",
        "name": "Запрещенные вещества",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Леонид в мэрии Долины Креста сказал мне, что несколько недель дней назад в деревне были беспорядки. По-видимому, лорд Геомир запретил любое использование костной муки, как исцеляющего вещества. \n\n Фарал, городской священник, должен знать больше.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Фарал не хочет говорить о костной муке. Но я мог бы упросить его за 5 крыльев насекомых.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Фарал рассказал, что костная мука - очень мощное целительное средство, и он весьма огорчен его запрещением. Я должен найти Форонира в Приюте Падших, если я хочу узнать больше. Нужно сказать ему пароль 'Сияние тени'.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Я поговорил с Форониром в Приюте Падших. Он сможет смешать мне зелье из костной муки, если я принесу ему 5 костей скелета. В заброшенном доме к северу от Приюта Падших должно быть несколько скелетов.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я принес кости Форониру. Он теперь в состоянии снабдить меня зельем из костной муки.\nЯ должен быть осторожным при использовании, так как Лорд Геомир запретил его приминение.",
                "rewardExperience": 900,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "jan",
        "name": "Погибшие друзья",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Ян рассказал мне свою историю о нем, Гандиру и Ироготу. Три бывших друга пошли в дыру за сокровищами, но - поссорились и стали драться. Ирогот убил Гандира в своем гневе. \nЯ должен забрать кольцо Гандира у Ирогота, и отдать Яну, когда оно будет у меня.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я принес Яну кольцо Гандира, и отомстил за его друга. Ирогот мертв.",
                "rewardExperience": 1500,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "bucus",
        "name": "Ключ для Лютора",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Бикус из Приюта Падших что-то зает об Эндоре. Он хочет что-бы я принес ему ключ Лютера из катакомб под церковью Приюта Падших.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Катакомбы под церковью Приюта Падших заперты. Афамир только у него есть право и мужество спускаться в них. Я должен увидеться с ним на юго-западе от церкви.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Афамир просит принести ему немного мяса, может тогда он сможет поговорить со мной.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Я принес немного мяса Афамиру.",
                "rewardExperience": 700,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Афамир дал мне разрешение спуститься в катакомбы под церковью Приюта Падших.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я принес Бикусу ключ Лютора.",
                "rewardExperience": 2150,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "fallhavendrunk",
        "name": "Рассказ пьяницы",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Пьяница возле таверны в Приюте Падших начал рассказывать историю, но вдруг попросил принести ему мёд. Непонятно, к чему он все это говорил.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Пьяница рассказал, что путешествовал с Унмиром. Я должен поговорить с Унмиром.",
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "calomyran",
        "name": "Секрет Каломирана",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Старик в Приюте Падших потерял книгу 'Секреты Каломирана'. Я должен найти ее. Может, она в доме Арсира на юге?",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я нашел вырванную страницу из книги 'Секреты Каломирана' с именем 'Ларкал' на форзаце.",
                "finishesQuest": 0
            },
            {
                "progress": 100,
                "logText": "Я вернул старику книгу.",
                "rewardExperience": 600,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "nocmar",
        "name": "Утраченные сокровища",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Унмир сказал мне, что когда-то был путешественником и намекнул, что неплохо бы поговорить с Нокмаром. Его дом на юго-западе от таверны в Приюте Падших.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Нокмар сказал мне, что когда-то был кузнецом. Но лорд Геомир запретил использование сердечной стали, и теперь он не может ковать свое фирменное оружие.\nЕсли я найду для Нокмара сердечную руду, он снова сможет ковать.",
                "finishesQuest": 0
            },
            {
                "progress": 200,
                "logText": "Я принес сердечную руду Нокмару. Теперь у него появились стальные причиндалы.",
                "rewardExperience": 1200,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "flagstone",
        "name": "Древние секреты",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Я встретил стражника у крепости Флагстоун. Он рассказал мне о прошлом Флагстоуна, бывшего лагерем для беглых рабов из Горы Галмор. В последнее время флагстоунские нежить и чудища сильно активизировались. Я решил исследовать данный факт. Страж сказал, чтобы я возвращался за помощью, если что.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Я обнаружил туннель под Флагстоуном, который, кажется, ведет к большой пещере. Пещера охраняется демоном, так что я не могу даже приблизиться. Может быть, страж за пределами Флагстоуна знает больше?",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Страж рассказал мне, что бывший надзиратель носил ожерелье, которым он подозрительно дорожил. На ожерелье, вероятно, заклинание от демона. За расшифровкой заклинания необходимо будет вернуться к стражу.",
                "finishesQuest": 0
            },
            {
                "progress": 31,
                "logText": "Я нашел бывшего надзирателя Флагстоуна на верхнем уровне.",
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Я узнал заклинание от демона под Флагстоуном. 'Дневная Тень'.",
                "rewardExperience": 1600,
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Глубоко под Флагстоуном, я нашел источник нежити. Существа рождаются из горя бывших узников Флагстоуна.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Я нашел одного заключенного, Нараеля, оставшегося в живых в глубинах Флагстоуна. Нараель был гражданином города Нор. Он слишком слаб, чтобы ходить, но щедро вознаградит меня за обнаружение его жены в Норе.",
                "rewardExperience": 2100,
                "finishesQuest": 1
            }
        ]
    },
    {
        "id": "vacor",
        "name": "Пропавшие части",
        "showInLog": 1,
        "stages": [
            {
                "progress": 10,
                "logText": "Маг, назвавшийся Вакором, на юго-западе Приюта Падших пытался создать Заклинание разрыва.\nОн был одержим своим заклинанием, говорил про увеличение силы посредством оного.",
                "finishesQuest": 0
            },
            {
                "progress": 20,
                "logText": "Вакор хочет, чтобы я принес ему четыре части Заклинания разрыва, он утверждает, что они были украдены у него. Бандиты должны быть где-то к югу от Приюта Падших.",
                "finishesQuest": 0
            },
            {
                "progress": 30,
                "logText": "Я принес четыре части Заклинания разрыва Вакору.",
                "rewardExperience": 1200,
                "finishesQuest": 0
            },
            {
                "progress": 40,
                "logText": "Вакор поведал о своем бывшем ученике, Унзеле, который мешает ему. Он попросил меня убить Унзела и принести его перстень, как доказательство. Унзел может быть на юго-западе от Приюта Падших",
                "finishesQuest": 0
            },
            {
                "progress": 50,
                "logText": "Унзел дал мне выбор, идти с ним, или с Вакором.",
                "finishesQuest": 0
            },
            {
                "progress": 51,
                "logText": "Я выбрал сторону Унзела. Я должен отправиться на юго-запад Приюта Падших и поговорить с Вакором об Унзеле и Тени.",
                "finishesQuest": 0
            },
            {
                "progress": 53,
                "logText": "Я начал битву с Унзелем. Я должен принести его перстень Вакору.",
                "finishesQuest": 0
            },
            {
                "progress": 54,
                "logText": "Я начал битву с Вакором. Я должен принести его перстень Унзелу.",
                "finishesQuest": 0
            },
            {
                "progress": 60,
                "logText": "Я убил Унзела и сообщил об этом Вакору.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            },
            {
                "progress": 61,
                "logText": "Я убил Вакора и сообщил об этом Унзелу.",
                "rewardExperience": 1600,
                "finishesQuest": 1
            }
        ]
    }
]
